{"events": [{"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/general/education/17/03/9202032/premarket-prep-recap-march-22-the-vice-index&cid=52779433415513&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNHdGBs219_sCB6oa2AvSkliuAwaVA\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nPreMarket Prep Recap, March 22: The Vice Index\n", "text": "<p>Did you miss today's PreMarket Prep? Here are some of the highlights from the show.\n\nKey Technical Levels\n\nThe following are some of the stocks discussed on the show. Co-host Joel Elconin offered technical levels.\n\nNike Inc (NYSE: NKE) hit a pre-market low of $54.32, Whole numbers come into play after that, but traders should keep in mind the double bottom from February 7-8 of $52.67 and $52.70.\n\n(NYSE: NKE) hit a pre-market low of $54.32, Whole numbers come into play after that, but traders should keep in mind the double bottom from February 7-8 of $52.67 and $52.70. Foot Locker, Inc. (NYSE: FL)'s Tuesday low of $72.40 is key. After that,there's potential air until the February 24 low of $70.37. It needs to clear the close of $73.45 to have any chance of a rally\n\n(NYSE: FL)'s Tuesday low of $72.40 is key. After that,there's potential air until the February 24 low of $70.37. It needs to clear the close of $73.45 to have any chance of a rally FedEx Corporation (NYSE: FDX) hit a pre-market high of $198.55 and backed off but not by much. The only relevant levels on the upside are the all-time high of $201.57 from December 13.\n\n(NYSE: FDX) hit a pre-market high of $198.55 and backed off but not by much. The only relevant levels on the upside are the all-time high of $201.57 from December 13. Silver Wheaton Corp. (USA) (NYSE: SLW) moved higher on light volume off its earnings report. Note the three-day high of $20.63; after that it opens up to the February 27 high of $21.32. There's support at the close of $19.93.\n\n(NYSE: SLW) moved higher on light volume off its earnings report. Note the three-day high of $20.63; after that it opens up to the February 27 high of $21.32. There's support at the close of $19.93. Winnebago Industries, Inc. (NYSE: WGO) The Street leaned the wrong way heading into this report. It needs to clear a double top from March 17 ($29.95) and March 20 ($30.02). It needs to hold $29.55 (Tuesday high) for rally to continue.\n\nIndustries That Got Crushed Tuesday\n\nCo-host Dennis Dick noted that, even though the financials have looked weak for a while, regional bank stocks like KeyCorp (NYSE: KEY) and Regions Financial Corp (NYSE: RF) took a particular hit on Wednesday. Listen to the full discussion here.\n\n(NYSE: KEY) and (NYSE: RF) took a particular hit on Wednesday. Listen to the full discussion here. Dick also pointed out the continued slide in retail. L Brands Inc (NYSE: LB) was downgraded at Keybanc. \"If you're thinking retail had already been beat up...they hit the retailers really hard again.\" He specifically noted Macy's Inc (NYSE: M), Kohls Corporation (NYSE: KSS) and Nordstrom, Inc. (NYSE: JWN) all had big down days on Tuesday. Listen to the full discussion here.\n\nMoneyball Economics\n\nAndrew Zatlin of Moneyball Econonmics stopped by the show to discuss his Vice Index, what it's telling him about overall consumer sentiment, and how it helps him forecast the market. Listen to the full interview with Zatlin here.\n\nHow To Listen And Watch\n\nPreMarket Prep is a daily trading ideas show with a focus on premarket volatility and technical setups. You can listen live and chat with our hosts, guests, and listeners every morning from 8-9 ET here or on YouTube Live. You can listen to the podcast on iTunes, Soundcloud, and Stitcher. The full recording of today's show is available below.\n\nPosted-In: Andrew Zatlin PreMarket PrepEducation Markets Trading Ideas Reviews Interview General\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.hotstockspoint.com/analysts-mean-rating-score-stands-at-2-10-while-nike-inc-s-nke-stock-price-is-now-at-58-01-notable-runners/&cid=52779429734208&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNFhRWF43R2dmFKlbc9cN1APOyJEVQ\">Hot Stocks Point</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAnalysts mean rating score stands at 2.10 while NIKE, Inc.'s (NKE) stock price ...\n", "text": "<p>NIKE, Inc. (NKE)’s Stock Price Trading Update:\n\nNIKE, Inc. (NKE) stock price ended its day with loss -1.14% and finalized at the value of $58.01. During its last trading session, Stock traded with the total exchanged volume of 14.51 million shares. The average volume stands around 9.1 million shares. The average numbers of shares are traded in a security per day, during the recent 3-month period. The stock has relative volume of 1.59. Relative volume is ratio between current volume and 3-month average value, intraday adjusted. NIKE, Inc. (NKE) is a part of Consumer Goods sector and belongs to Textile – Apparel Footwear & Accessories industry.\n\nImportant Technical Indicators:\n\nATR value of company was 0.93. Average True Range (ATR) is an indicator based on trading ranges smoothed by an N-period exponential moving average percentage of the true range values. ATR can display volatility of stocks, ETFs and indexes. The principal of ATR is very similar to other volatility indicators: A high ATR value signals a possible trend change. A low ATR value correlates with a weaker trend movement.\n\nRelative Strength Index (RSI) was 62.27. Developed J. Welles Wilder, the Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements. RSI oscillates between zero and 100. Traditionally, and according to Wilder, RSI is considered overbought when above 70 and oversold when below 30.\n\nThe stock volatility for week was 1.69% while for month was 1.56%.The stock, as of last close, traded 19.16% to its 52 week low and was changed -10.25% from its 52 week high. Beta factor, which measures the riskiness of the security, was observed as 0.47. NKE’s value Change from Open was at -1.31% with a Gap of 0.17%.\n\nEarnings per share Details about NKE:\n\nEPS in next five year years is expected to touch 12.18% while EPS growth in past 5 year was 14.10% along with sales growth of 10.00% in the last five years.\n\nEPS growth in next year is estimated to reach 12.75% while EPS growth estimate for this year is set at 16.60%.\n\nThe price/earnings ratio (P/E) is 25.60 and the forward P/E ratio stands at 22.02. The price to earnings growth is 2.10 and the price to sales ratio is 17. It has a dividend yield of 1.24%.\n\nPerformance Review:\n\nTo review the NKE previous performance, look at its past history, which highlighted below:\n\nDuring last 5 trades the stock sticks almost 1.27%.\n\nDuring last one month it showed the change of 2.54%.\n\nDuring last 3 month it remained at 14.28%.\n\nDuring last one year month it performed at -9.25%.\n\nAlong with these its year to date performance is standing at 14.48%.\n\nAnalysts Mean Rating:\n\nAnalysts’ mean recommendation for NIKE, Inc. (NKE) stands at 2.10. Rating Scale; where 1.0 rating means Strong Buy, 2.0 rating signify Buy, 3.0 recommendation reveals Hold, 4.0 rating score shows Sell and 5.0 displays Strong Sell signal.\n\nNKE Stock Price Comparison to Moving Averages:\n\nUSA based company, NIKE, Inc. (NKE)’s latest closing price was 7.61% from the average-price of 200 days while it maintained a distance from the 50 Day Moving Average at 5.23% and 1.31% compared with the 20 Day Moving Average.\n\nThree Months Ago Analysts Rating:\n\nHere we discussed Analysts views what they told about Nike, Inc. (NKE) stock 3 Months Ago. Analysts recommended an average brokerage rating of Overweight derived from brokerage firms, according to FactSet. 18 said a “Buy Rating” and 3 announced “Overweight Rating”. 12 advised “Hold Rating” regarding the stock. 0 announced “Sell Rating” and 1 disclosed “Underweight Rating”. Analysts play a useful role in our capital markets. For example, by doing in-depth research for their large institutional clients and employers, analysts can help substantial sums of capital be directed to more productive uses in our economy. A “Buy” rating does not mean that every investor should acquire the stock. Nor does a “Sell” rating mean that every investor should immediately sell it. Your own financial situation and investment needs are what matter. If you consider any individual rating, do not views it in absolute or abstract terms, but in the context of your own unique financial situation. In short, whatever a given analyst recommendation may say, always consider whether a particular investment is right for you in light of your own financial circumstances. Remember, you are the boss, it’s your money, and your situation and goals that matter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/buzzus-stocks-on-the-movenike-sears-therapix-frontier-snap-transdigm--xcel-brands-20170322-00944&cid=52779433060425&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNHNiC-9Y7RKUUQfMTk4c6Nds9NG3g\">Nasdaq</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nBUZZ-US STOCKS ON THE MOVE-Nike, Sears, Therapix, Frontier, Snap, TransDigm ...\n", "text": "<p>Reuters\n\n\n\n\n\n* Eikon search string for individual stock moves: STXBZ * The Day Ahead newsletter: http://tmsnrt.rs/2ggOmBi * The Morning News Call newsletter: http://tmsnrt.rs/2fwPLTh The S&P and the Nasdaq reversed course to hit session highs in late morning trading on Wednesday, even as investors remained cautious ahead of the first major legislative test of Donald Trump's presidency. [.N] At 14:23 ET, the Dow Jones Industrial Average <.DJI> was down 0.18 percent at 20,631.17. The S&P 500 <.SPX> was up 0.02 percent at 2,344.51 and the Nasdaq Composite <.IXIC> was up 0.20 percent at 5,805.147. ANALYSIS-Markets fret as Trump agenda shows signs of cracks [nL2N1GY191] World stocks seen as most overvalued in 17 years - BAML survey [nL5N1GY4LQ] BUZZ-S&P 500: Downside reversal can gain steam [nL2N1GY0WF] BUZZ-DJI: May play on a swing set [nL2N1GZ0F2] BUZZ-Utilities index hits highest level since August [nL2N1GZ1AH] The top three percentage gainers on the S&P 500 <.PG.INX>: ** Marriott Int'l <MAR.O>, up 2.7 pct at $91.47 [nL3N1GY4CY] ** Ventas Inc <VTR.N>, up 2.5 pct at $62.31 ** Freeport McMoRan <FCX.N>, up 2.4 pct at $12.87 [nFWN1GZ02J] The top three percentage losers on the S&P 500 <.PL.INX>: ** Nike Inc <NKE.N>, down 6.4 pct at $54.29 [nL3N1GZ4Q1] ** TransDigm Group <TDG.N>, down 4 pct at $215.76 [nL3N1GZ4KX] ** Mallinckrodt <MNK.N>, down 3.3 pct at $42.60 The top three percentage gainers on the NYSE <.PG.N>: ** Asia Pacific Fund <APB.N>, up 8.3 pct at $11.96 ** Silver Wheaton <SLW.N>, up 8.3 pct at $21.58 [nASB0B6FV] ** Yingli Green Energy <YGE.N>, up 7.7 pct at $2.10 The top three percentage losers on the NYSE <.PL.N>: ** Glassbridge Enterprises <GLA.N>, down 16.6 pct at $5.14 [nASB0B6HC] ** OI SA ADR <OIBRc.N>, down 9.9 pct at $6.72 [nL2N1GY1LL] ** China Online Education <COE.N>, down 8.7 pct at $16.99 [nL3N1GZ48U] The top three percentage gainers on the Nasdaq <.PG.O>: ** Therapix Biosciences <TRPX.O>, up 43.3 pct at $8.60 [nL3N1GZ4RH] ** Ominto Inc <OMNT.O>, up 24.7 pct at $12.35 ** Idera Pharma <IDRA.O>, up 17.2 pct at $2.45 [nL3N1GZ493] The top three percentage losers on the Nasdaq <.PL.O>: ** Zions Bancorp warrants <ZIONZ.O>, down 30 pct at $7.80 ** Xcel Brands Inc <XELB.O>, down 18.8 pct at $2.76 [nL3N1GZ4G2] ** Sears Holding <SHLD.O>, down 14.2 pct at $7.81 [nL3N1GZ4PQ] ** Nike Inc <NKE.N>: down 6.4 pct at $54.29 UPDATE 3-Nike's revenue misses estimates as rivals gain ground [nL3N1GY558] BUZZ-Nike Inc: Brokerages cut PTs after Q3 revenue miss, drop in orders [nL3N1GZ4Q1] ** Sears Holdings Corp <SHLD.O>: down 14.2 pct at $7.81 UPDATE 2-Sears shares sink as creditors, investors fret over going-concern risk [nL3N1GZ4PQ] BUZZ-Sears Holdings: Warns on ability to continue as going concern [nL3N1GZ4G3] ** FedEx Corp <FDX.N>: up 1.6 pct at $194.93 UPDATE 2-FedEx misses on earnings, but sees higher margins ahead [nL2N1GX17D] BUZZ-FedEx Corp: 2nd biggest S&P 500 gainer after upbeat earnings report [nL3N1GZ3YY] ** Therapix Biosciences Ltd <TRPX.O>: up 43.3 pct at $8.60BUZZ-Therapix Biosciences Ltd: Shares surge as much as 55 pct in debut [nL3N1GZ4RH] ** Frontier Communications Corp <FTR.O>: down 15.9 pct at $1.99 ** Windstream Holdings Inc <WIN.O>: down 8.0 pct at $5.88 ** CenturyLink Inc <CTL.N>: down 2.8 pct at $22.70 BUZZ-Goldman Sachs points to U.S. telcos' 'wireline woes' [nL3N1GZ3QJ] ** Winnebago Industries Inc <WGO.N>: up 5.2 pct at $29.25BUZZ-Winnebago Industries: Best day in 4 months as EPS beats again [nL3N1GZ417] ** Xcel Brands Inc <XELB.O>: down 18.8 pct at $2.76BUZZ-Xcel Brands Inc: Hits more than 4-yr low after weak Q4 results [nL3N1GZ4G2] ** Moleculin Biotech Inc <MBRX.O>: up 36.4 pct at $1.46 BUZZ-Moleculin Biotech: Lead cancer treatment gets orphan drug status [nL3N1GZ4NL] ** Calithera Biosciences Inc <CALA.O>: down 2.8 pct at $10.25BUZZ-Calithera Biosciences Inc: Drops on stock offering [nL3N1GZ40M] ** Duluth Holdings Inc <DLTH.O>: up 14.0 pct at $21.96BUZZ-Duluth Holdings Inc: Best intraday jump in a nearly year on strong forecast [nL3N1GZ439] ** Acushnet Holdings Corp <GOLF.N>: up 3.6 pct at $18.41BRIEF-Acushnet Holdings sees FY 2017 sales in line with estimates [nFWN1GZ0AT] ** Easterly Government Properties Inc <DEA.N>: down 1.4 pct at $19.45BUZZ-Easterly Government Properties: Dips on equity raise to fund acquisitions [nL2N1GZ0F9] ** Cooper Cos Inc <COO.N>: up 2.3 pct at $199.79Cooper Cos increase share repurchase program [nASB0B6FC] ** Marriott International Inc <MAR.O>: up 2.7 pct at $91.47 Brokers hike PTs a day after upbeat forecast [nL3N1GY4CY] ** Freeport McMoRan Inc <FCX.N>: up 2.4 pct at $12.87 Berenberg raises to \"hold\" from \"sell\" [nFWN1GZ02J] ** Taylor Morrison Home Corp <TMHC.N>: down 5.2 pct at $20.71BUZZ-Taylor Morrison Homes: Falls as sponsors sell via block [nL2N1GZ0JA] ** L Brands Inc <LB.N>: down 3.0 pct at $47.72 Keybanc cuts to \"underweight\" ** General Mills Inc <GIS.N>: down 1.7 pct at $58.77 Stifel cuts to hold rating - trader ** Dynatronics Corp <DYNT.O>: down 1.9 pct at $2.85 BRIEF-Dynatronics to acquire Hausmann Industries for $10 mln [nASB0B6J3] ** TransDigm Group Inc <TDG.N>: down 4.0 pct at $215.76BUZZ-TransDigm Group Inc: Hits more than 10-month low [nL3N1GZ4KX] ** Idera Pharmaceuticals Inc <IDRA.O>: up 17.2 pct at $2.45 BUZZ-Idera Pharma: At 6-mth high after JMP starts with \"market outperform\" [nL3N1GZ493] ** China Online Education Group <COE.N>: down 8.7 pct at $16.99BUZZ-China Online Education Group: Plunges after Q4 loss widens [nL3N1GZ48U] ** Steelcase Inc <SCS.N>: up 3.2 pct at $16.20 BRIEF-Steelcase reports Q4 results [nASB0B6EV] ** Oi SA <OIBRc.N>: down 9.9 pct at $6.72 BUZZ-Brazil's Oi: creditor group asks court mediation to discuss debt plan [nL2N1GY1LL] ** Dow Chemical <DOW.N>: down 1.1 pct at $62.36 ** DuPont <DD.N>: down 1.4 pct at $78.66 Indian regulator says Dow, DuPont deal likely to hurt competition [nL3N1GZ4GM] ** PPG Industries Inc <PPG.N>: down 0.7 pct at $103.79 UPDATE 5-Shareholders urge Akzo to negotiate with suitor PPG ** Bank of America <BAC.N>: down 0.4 pct at $22.94 ** Goldman Sachs <GS.N>: down 1.1 pct at $230.41 ** Wells Fargo <WFC.N>: down 1.0 pct at $55.28 ** Morgan Stanley <MS.N>: down 1.0 pct at $42.25 ** JPMorgan Chase <JPM.N>: flat at $87.43 ** Citigroup Inc <C.N>: down 0.3 pct at $57.86 U.S. bank stocks fall as investor hope wanes for policy boosts [nL2N1GY1O0] BUZZ-Bank stocks tumble as investors take profits on political uncertainty [nL2N1GY10X] BUZZ-Amid bank sell off, greater pain centered in regionals [nL2N1GU0TN] ** Snap Inc <SNAP.N>: up 5.7 pct at $21.54 Snap pops 9 percent after winning second 'buy' recommendation [nL2N1GZ164] BUZZ-Snap Inc wins second 'buy' rating from analyst [nL2N1GY213] ** American Airlines Group Inc <AAL.O>: down 0.9 pct at $40.04 ** Delta Air Lines Inc <DAL.N>: up 0.1 pct at $45.58 ** Southwest Airlines Co <LUV.N>: up 0.6 pct at $52.19 ** Alaska Air Group Inc <ALK.N>: up 0.4 pct at $92.47 BUZZ-U.S. airlines: MS downgrades to \"in-line\" [nL3N1GZ3ZE] ** Bebe Stores Inc <BEBE.O>: up 6.4 pct at $3.80BUZZ-Bebe Stores Inc: Claws back some gains after Tuesday's rout [nL3N1GZ3YM] MEDIA-Bebe plans to shut its stores and focus on web sales - Bloomberg [nL3N1GY4RD] ** Uni-Pixel Inc <UNXL.O>: up 17.1 pct at $0.89BUZZ-Uni-Pixel Inc: best day in nearly 1-1/2 years [nL3N1GZ454] ** Silver Wheaton Corp <SLW.N>: up 8.3 pct at $21.58 BRIEF-Silver Wheaton reports Q4 results, hikes dividend [nASB0B6FV] Silver Wheaton proposes changing name to Wheaton Precious Metals [nL2N1GY1YC] ** Regenxbio Inc <RGNX.O>: down 8.6 pct at $20.20BUZZ-Regenxbio Inc: Drops after stock offering prices [nL3N1GZ3TF] The 11 major S&P 500 sectors: Consumer Discretionary <.SPLRCD> down 0.15 pct Consumer Staples <.SPLRCS> down 0.24 pct Energy <.SPNY> down 0.13 pct Financial <.SPSY> down 0.31 pct Health <.SPXHC> down 0.10 pct Industrial <.SPLRCI> up 0.22 pct Information Technology <.SPLRCT> up 0.61 pct Materials <.SPLRCM> down 0.10 pct Real Estate <.SPLRCR> down 0.13 pct Teleservices <.SPLRCL> down 1.33 pct Utilities <.SPLRCU> up 0.38 pct (Compiled by Sruthi Shankar in Bengaluru; Editing by Savio D'Souza) ((sruthi.shankar@thomsonreuters.com; within U.S. +1 646 223 8780; outside U.S. +91 80 6749 6328; Reuters Messaging: sruthi.shankar.reuters.com@reuters.net)) Keywords: MARKETS USA STOCKS/PULSE</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.sfgate.com/business/article/Sears-Nike-and-US-Bancorp-stumble-while-FedEx-11020655.php&cid=52779433723471&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNFhXNNmjJe86OO5sRpx9z7MvmDMag\">SFGate</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nSears, Nike and US Bancorp stumble while FedEx, Duluth rise\n", "text": "<p>Sears, Nike and US Bancorp stumble while FedEx, Duluth rise\n\nNEW YORK (AP) — Stocks that moved substantially or traded heavily on Wednesday:\n\nSears Holdings Corp., down $1.12 to $7.98\n\nThe retailer said in a regulatory filing that there is \"substantial doubt\" it will be able to remain in business.\n\nNike Inc., down $4.09 to $53.92\n\nThe shoe and athletic apparel retailer reported weaker sales than expected and investors weren't pleased with its outlook.\n\nU.S. Bancorp, down 9 cents to $52.60\n\nBanks fell for the fourth trading day in a row as interest rates decreased again.\n\nFedEx Corp., up $4.08 to $195.92\n\nThe shipping company's holiday-season results were mixed, but analysts expect its business to improve.\n\nDuluth Holdings Inc., up $2.76 to $22.02\n\nThe clothing and tools supplier had a strong fourth quarter and its annual forecast was better than analysts expected.\n\nPPG Industries Inc., down 23 cents to $104.25\n\nPPG offered to buy industrial paints and chemicals company AkzoNobel for about $24 billion, which AkzoNobel rejected.\n\nPublic Service Enterprise Group Inc., up 44 cents to $45.10\n\nUtility companies continued to do better than the rest of the market as investors snap up high-dividend stocks as bond yields fall.\n\nMallinckrodt PLC, down $1.51 to $42.54\n\nImprimis Pharmaceuticals said it is studying a drug that would compete with Mallinckrodt's costly drug HP Acthar gel.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/news/earnings/17/03/9202102/mid-morning-market-update-markets-mostly-lower-nike-sales-miss-views&cid=52779434063818&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNG6AXh8D8gDl3eDxhTd3tYP6_6LNQ\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nMid-Morning Market Update: Markets Mostly Lower; Nike Sales Miss Views\n", "text": "<p>Following the market opening Wednesday, the Dow traded down 0.29 percent to 20,607.98 while the NASDAQ rose 0.05 percent to 5,796.52. The S&P also fell, dropping 0.16 percent to 2,340.38.\n\nLeading and Lagging Sectors\n\nWednesday morning, the utilities sector proved to be a source of strength for the market. Leading the sector was strength from Korea Electric Power Corporation (ADR) (NYSE: KEP) and RGC Resources Inc. (NASDAQ: RGCO).\n\nIn trading on Wednesday, financial shares fell 0.54 percent. Meanwhile, top losers in the sector included CBL & Associates Properties, Inc. (NYSE: CBL), down 4 percent, and ING Groep NV (ADR) (NYSE: ING), down 4 percent.\n\nTop Headline\n\nNike Inc (NYSE: NKE) reported upbeat earnings for its third quarter, while sales missed estimates.\n\nNike posted Q3 earnings of $0.68 per share on revenue of $8.4 billion. Analysts expected earnings of $0.53 per share on revenue of $8.47 billion. On a currency-neutral basis, Nike’s futures orders dropped 1 percent, while futures orders on a reported basis dropped around 4 percent.\n\nEquities Trading UP\n\nDuluth Holdings Inc (NASDAQ: DLTH) shares shot up 15 percent to $22.24 after the company reported upbeat Q4 results.\n\nShares of Moleculin Biotech Inc (NASDAQ: MBRX) got a boost, shooting up 27 percent to $1.36 after the company reported that its AML treatment Liposomal Annamycin has been awarded the FDA Orphan Drug designation.\n\nbebe stores, inc. (NASDAQ: BEBE) shares were also up, gaining 16 percent to $4.14 after dropping 44.65 percent on Tuesday.\n\nEquities Trading DOWN\n\nDiana Containerships Inc (NASDAQ: DCIX) shares dropped 26 percent to $1.69. Diana Containerships reported up to $150 million securities offering.\n\nShares of Sears Holdings Corp (NASDAQ: SHLD) were down around 12 percent to $8.02. Sears warned on Tuesday about its ability to continue as a going concern after years of losses and declining sales.\n\nVital Therapies Inc (NASDAQ: VTL) was down, falling around 8 percent to $3.90. Vital Therapies priced an offering of 8.75 million shares at $4 per share.\n\nCommodities\n\nIn commodity news, oil traded down 1.45 percent to $47.54 while gold traded up 0.06 percent to $1,250.30.\n\nSilver traded down 0.27 percent Wednesday to $17.535, while copper fell 0.63 percent to $2.602.\n\nEurozone\n\nEuropean shares were mostly lower today. The eurozone’s STOXX 600 fell 0.63 percent, the Spanish Ibex Index rose 0.04 percent, while Italy’s FTSE MIB Index slipped 0.15 percent. Meanwhile the German DAX declined 0.49 percent, and the French CAC 40 fell 0.42 percent while U.K. shares fell 0.88 percent.\n\nEconomics\n\nExisting-home sales declined 3.7 percent to an annual rate of 5.48 million in February, the National Association of Realtors reported. However, economists were expecting a 5.57 million rate.\n\nThe Energy Information Administration’s weekly report on petroleum inventories is schedule for release at 10:30 a.m. ET.\n\nPosted-In: Earnings News Eurozone Commodities Global Intraday Update Markets Movers\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.newsoracle.com/2017/03/22/investors-catching-stocks-nike-inc-nke/&cid=52779432692552&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNGjUipzM0SKFCZGzOanN_S2OsNpCw\">News Oracle</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nInvestors Catching Stocks NIKE, Inc. (NKE)\n", "text": "<p>NIKE, Inc. (NKE) will report its next earnings on 21-Mar-17. The company reported the earnings of $0.5/Share in the last quarter where the estimated EPS by analysts was $0.43/share. The difference between the expected and actual EPS was $0.07/share, which represents an Earnings surprise of 16.3%.\n\nMany analysts are providing their Estimated Earnings analysis for NIKE, Inc. and for the current quarter 32 analysts have projected that the stock could give an Average Earnings estimate of $0.53/share. These analysts have also projected a Low Estimate of $0.48/share and a High Estimate of $0.58/share.\n\nIn case of Revenue Estimates, 29 analysts have provided their consensus Average Revenue Estimates for NIKE, Inc. as 8.47 Billion. According to these analysts, the Low Revenue Estimate for NIKE, Inc. is 8.32 Billion and the High Revenue Estimate is 8.61 Billion. The company had Year Ago Sales of 8.03 Billion.\n\nThese analysts also forecasted Growth Estimates for the Current Quarter for NKE to be -3.6%. They are projecting Next Quarter growth of 18.4%. For the next 5 years, NIKE, Inc. is expecting Growth of 12.18% per annum, whereas in the past 5 years the growth was 17.38% per annum.\n\nSome buy side analysts are also providing their Analysis on NIKE, Inc., where 8 analysts have rated the stock as Strong buy, 14 analysts have given a Buy signal, 11 said it’s a HOLD, 1 reported it as Underperform and 0 analysts rated the stock as Sell. (These Recommendations are for the Current Month Only reported by Yahoo Finance.)\n\nWhen it comes to the Analysis of a Stock, Price Target plays a vital role. 30 Analysts reported that the Price Target for NIKE, Inc. might touch $100 high while the Average Price Target and Low price Target is $62.47 and $46 respectively.\n\nTo analyze a stock, one should look for Upgrades and Downgrades of a stock. NIKE, Inc. got Initiated on 19-Jan-17 where investment firm Atlantic Equities Initiated the stock to Overweight.\n\nNIKE, Inc. closed its last trading session at $58.68 with the loss of -1.14%. The Market Capitalization of the company stands at 95.98 Billion. The Company has 52-week high of $65.44 and 52-week low of $49.01. The stock’s current distance from 20-Day Simple Moving Average (SMA20) is 1.31% where SMA50 and SMA200 are 5.23% and 7.61% respectively. The Company Touched its 52-Week High on Mar 22, 2016 and 52-Week Low on Nov 2, 2016.\n\nThe Relative Volume of the company is 1.59 and Average Volume (3 months) is 9.1 million. NIKE, Inc. P/E (price to earnings) ratio is 25.6 and Forward P/E ratio of 22.02.\n\nThe company shows its Return on Assets (ROA) value of 18%. The Return on Equity (ROE) value stands at 31.7%. While it’s Return on Investment (ROI) value is 25.5%.\n\nWhile looking at the Stock’s Performance, NIKE, Inc. currently shows a Weekly Performance of 1.27%, where Monthly Performance is 2.54%, Quarterly performance is 14.28%, 6 Months performance is 6.28% and yearly performance percentage is -9.25%. Year to Date performance value (YTD perf) value is 14.48%. The Stock currently has a Weekly Volatility of 1.69% and Monthly Volatility of 1.56%.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/news/earnings/17/03/9200786/8-stocks-to-watch-for-march-22-2017&cid=52779427992231&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNGdifoQa3syp2CA7nj-rC0iWkmQBQ\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\n8 Stocks To Watch For March 22, 2017\n", "text": "<p>Some of the stocks that may grab investor focus today are:\n\nWall Street expects Herman Miller, Inc. (NASDAQ: MLHR) to post quarterly earnings at $0.32 per share on revenue of $530.50 million after the closing bell. Herman Miller shares fell 0.51 percent to $29.10 in after-hours trading.\n\n(NASDAQ: MLHR) to post quarterly earnings at $0.32 per share on revenue of $530.50 million after the closing bell. Herman Miller shares fell 0.51 percent to $29.10 in after-hours trading. Analysts expect Winnebago Industries, Inc. (NYSE: WGO) to report quarterly earnings at $0.45 per share on revenue of $345.19 million before the opening bell. Winnebago shares rose 2.32 percent to $28.44 in after-hours trading.\n\n(NYSE: WGO) to report quarterly earnings at $0.45 per share on revenue of $345.19 million before the opening bell. Winnebago shares rose 2.32 percent to $28.44 in after-hours trading. Before the markets open, Amaya Inc. (NASDAQ: AYA) is estimated to report its quarterly earnings at $0.43 per share on revenue of $298.42 million. Amaya shares gained 0.62 percent to $15.44 in after-hours trading.\n\n(NASDAQ: AYA) is estimated to report its quarterly earnings at $0.43 per share on revenue of $298.42 million. Amaya shares gained 0.62 percent to $15.44 in after-hours trading. Nike Inc (NYSE: NKE) reported upbeat earnings for its third quarter, while sales missed estimates. Nike shares dropped 3.71 percent to $55.86 in the after-hours trading session.\n\nFind out what's going on in today's market and bring any questions you have to Benzinga's PreMarket Prep.\n\nAnalysts are expecting Perry Ellis International, Inc. (NASDAQ: PERY) to have earned $0.60 per share on revenue of $229.64 million in the latest quarter. Perry Ellis will release earnings before the markets open. Perry Ellis shares gained 1.67 percent to $23.20 in after-hours trading.\n\n(NASDAQ: PERY) to have earned $0.60 per share on revenue of $229.64 million in the latest quarter. Perry Ellis will release earnings before the markets open. Perry Ellis shares gained 1.67 percent to $23.20 in after-hours trading. After the markets close, Cintas Corporation (NASDAQ: CTAS) is projected to post its quarterly earnings at $1.07 per share on revenue of $1.28 billion. Cintas shares rose 0.02 percent to $123.80 in after-hours trading.\n\n(NASDAQ: CTAS) is projected to post its quarterly earnings at $1.07 per share on revenue of $1.28 billion. Cintas shares rose 0.02 percent to $123.80 in after-hours trading. FedEx Corporation (NYSE: FDX) reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17. FedEx shares rose 2.06 percent to $195.80 in the after-hours trading session.\n\n(NYSE: FDX) reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17. FedEx shares rose 2.06 percent to $195.80 in the after-hours trading session. Analysts expect PVH Corp (NYSE: PVH) to post quarterly earnings at $1.19 per share on revenue of $2.09 billion after the closing bell. PVH shares declined 1.59 percent to $91.21 in after-hours trading.\n\nPosted-In: Stocks To WatchEarnings News Guidance Pre-Market Outlook Markets Trading Ideas\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://stockmarketdaily.co/2017/03/22/stocks-to-watch-nike-inc-nysenke-fedex-corporation-nysefdx-regenxbio-inc-nasdaqrgnx-autozone-inc-nyseazo-and-achillion-pharmaceuticals-inc-nasdaqachn/&cid=52779432233981&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNGm62rNWFq2_lJh-Lwt3kZ9gguqgQ\">Stock Market Daily</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nStocks To Watch: Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio ...\n", "text": "<p>Stocks To Watch: Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio Inc (NASDAQ:RGNX), AutoZone, Inc. (NYSE:AZO), And Achillion Pharmaceuticals, Inc. (NASDAQ:ACHN)\n\nAt least six companies’ shares are worth watching on Wednesday. They included Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio Inc (NASDAQ:RGNX), AutoZone, Inc. (NYSE:AZO), and Achillion Pharmaceuticals, Inc. (NASDAQ:ACHN).</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/analyst-ratings/price-target/17/03/9201975/7-biggest-price-target-changes-for-wednesday&cid=52779429678974&ei=FvfVWJnFEJj4uASX3ryoDg&usg=AFQjCNF9g89BtmRlkM4mwT8X_SIeffOyvQ\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\n7 Biggest Price Target Changes For Wednesday\n", "text": "<p>Membership is Free What are you waiting for? Sign up now!\n\nUsername: Username available! Username taken!\n\nEmail: Email available! Email taken!\n\nPassword:\n\nLeave blank:\n\nOR</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://seekingalpha.com/news/3253307-forward-view-weighs-nike\">seekingalpha</a>"}, "start_date": {"hour": 18, "month": 3, "second": 6, "year": 2017, "day": 24, "minute": 16}, "end_date": {}, "text": {"headline": "Forward View weighs in on Nike", "text": "<p> Forward View sizes up Nike (NYSE:NKE) after the company's FQ3 report sent shares lower earlier this week. The firm calls Nike one of the few manufacturers with the breath and capacity to consistently grow its direct-to-consumer business. \"As traditional distribution channels suffer, especially in the apparel industry, Nike has an unparalleled opportunity for double-digit DTC revenue growth for years. Look for Nike’s less-important retail buyers to increasingly worry if they’ll become obsolete and whether or not Nike will allot merchandise for them,\" writes analyst Nathan Yates. Nike is rated at Hold by Forward View and assigned a price target of $55 on concerns over the company hitting the consensus estimate with FQ4 EPS. The longer-term view on the Swoosh is more positive. </p>"}}]}