{"events": [{"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.chaffeybreeze.com/2017/03/22/goldman-sachs-group-inc-reaffirms-sell-rating-for-tesla-inc-tsla.html&cid=52779432852614&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNEnPXe5YYKeH8JA3L1O3pY9rdmDeA\">Chaffey Breeze</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nGoldman Sachs Group Inc Reaffirms “Sell” Rating for Tesla Inc (TSLA)\n", "text": "<p>Goldman Sachs Group Inc reiterated their sell rating on shares of Tesla Inc (NASDAQ:TSLA) in a research report report published on Friday morning. The brokerage currently has a $187.00 price objective on the electric vehicle producer’s stock, up from their previous price objective of $185.00.\n\nTSLA has been the topic of a number of other research reports. Robert W. Baird reissued an outperform rating and issued a $338.00 price target on shares of Tesla in a research note on Thursday, January 5th. Cowen and Company reissued an underperform rating and issued a $155.00 price target (down previously from $160.00) on shares of Tesla in a research note on Sunday, December 4th. Global Equities Research reissued an overweight rating and issued a $385.00 price target on shares of Tesla in a research note on Tuesday, December 6th. Vetr raised shares of Tesla from a hold rating to a buy rating and set a $197.97 price target on the stock in a research note on Tuesday, November 29th. Finally, TheStreet raised shares of Tesla from a d+ rating to a c- rating in a research note on Wednesday, January 25th. Eight equities research analysts have rated the stock with a sell rating, eleven have issued a hold rating and twelve have issued a buy rating to the company’s stock. The stock has a consensus rating of Hold and an average price target of $254.69.\n\nShares of Tesla (NASDAQ:TSLA) opened at 250.68 on Friday. The stock has a 50 day moving average of $258.45 and a 200 day moving average of $219.47. Tesla has a 52 week low of $178.19 and a 52 week high of $287.39. The stock’s market cap is $40.53 billion.\n\nTesla (NASDAQ:TSLA) last released its quarterly earnings results on Wednesday, February 22nd. The electric vehicle producer reported ($0.69) earnings per share (EPS) for the quarter, missing analysts’ consensus estimates of ($0.43) by $0.26. Tesla had a negative net margin of 14.74% and a negative return on equity of 29.17%. The company earned $2.29 billion during the quarter, compared to analyst estimates of $2.21 billion. During the same period in the prior year, the business posted ($0.87) EPS. Tesla’s revenue was up 88.2% compared to the same quarter last year. On average, analysts expect that Tesla will post ($1.42) earnings per share for the current year.\n\nYour IP Address:\n\nIn other Tesla news, CEO Elon Musk purchased 95,420 shares of the business’s stock in a transaction on Friday, March 17th. The shares were bought at an average cost of $262.00 per share, for a total transaction of $25,000,040.00. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. Also, Director Antonio J. Gracias sold 5,600 shares of the business’s stock in a transaction dated Wednesday, January 25th. The stock was sold at an average price of $254.37, for a total transaction of $1,424,472.00. Following the sale, the director now owns 5,600 shares in the company, valued at $1,424,472. The disclosure for this sale can be found here. Insiders have sold 14,700 shares of company stock worth $3,610,196 over the last quarter. Insiders own 27.70% of the company’s stock.\n\nA number of hedge funds have recently modified their holdings of the company. Advisory Services Network LLC raised its stake in shares of Tesla by 14.5% in the third quarter. Advisory Services Network LLC now owns 489 shares of the electric vehicle producer’s stock worth $100,000 after buying an additional 62 shares during the period. Reilly Financial Advisors LLC increased its position in shares of Tesla by 92.9% in the third quarter. Reilly Financial Advisors LLC now owns 492 shares of the electric vehicle producer’s stock worth $100,000 after buying an additional 237 shares in the last quarter. Independent Advisor Alliance bought a new position in shares of Tesla during the fourth quarter worth approximately $102,000. Parallel Advisors LLC bought a new position in shares of Tesla during the fourth quarter worth approximately $104,000. Finally, Cable Hill Partners LLC increased its position in shares of Tesla by 36.1% in the third quarter. Cable Hill Partners LLC now owns 693 shares of the electric vehicle producer’s stock worth $139,000 after buying an additional 184 shares in the last quarter. Institutional investors own 57.29% of the company’s stock.\n\nAbout Tesla\n\nTesla, Inc, formerly Tesla Motors, Inc, designs, develops, manufactures and sells electric vehicles and energy storage products. The Company produces and sells two electric vehicles: the Model S sedan and the Model X sport utility vehicle (SUV). The Company has delivered over 107,000 Model S vehicles across the world.\n\nReceive News & Ratings for Tesla Inc Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla Inc and related companies with MarketBeat.com's FREE daily email newsletter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.chaffeybreeze.com/2017/03/22/macerich-co-mac-downgraded-by-goldman-sachs-group-inc.html&cid=52779432666566&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNFfKiiy02iYmKb1qt7RIfpXjCfaVg\">Chaffey Breeze</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nMacerich Co (MAC) Downgraded by Goldman Sachs Group Inc\n", "text": "<p>Goldman Sachs Group Inc lowered shares of Macerich Co (NYSE:MAC) from a neutral rating to a sell rating in a research report sent to investors on Friday. The brokerage currently has $64.00 target price on the real estate investment trust’s stock.\n\nA number of other equities research analysts have also recently issued reports on MAC. BMO Capital Markets set a $75.00 target price on shares of Macerich and gave the stock a hold rating in a research report on Thursday, January 12th. Zacks Investment Research cut shares of Macerich from a hold rating to a sell rating in a research report on Thursday, January 12th. KeyCorp upgraded shares of Macerich to an overweight rating in a research report on Wednesday, December 21st. Mizuho reiterated a buy rating and set a $82.00 target price on shares of Macerich in a research report on Monday, March 13th. Finally, Canaccord Genuity dropped their target price on shares of Macerich from $84.00 to $77.00 and set a hold rating for the company in a research report on Monday, January 23rd. Three research analysts have rated the stock with a sell rating, ten have given a hold rating and four have assigned a buy rating to the company’s stock. The company presently has an average rating of Hold and a consensus price target of $75.93.\n\nMacerich (NYSE:MAC) traded down 1.62% during trading on Friday, reaching $63.25. The company had a trading volume of 204,189 shares. The stock has a 50 day moving average price of $66.52 and a 200-day moving average price of $71.44. The company has a market capitalization of $9.10 billion, a PE ratio of 17.97 and a beta of 0.79. Macerich has a 52-week low of $62.48 and a 52-week high of $94.51.\n\nMacerich (NYSE:MAC) last announced its earnings results on Monday, February 6th. The real estate investment trust reported $1.17 earnings per share (EPS) for the quarter, topping analysts’ consensus estimates of $1.16 by $0.01. Macerich had a net margin of 49.65% and a return on equity of 11.24%. During the same quarter in the previous year, the company posted $2.65 earnings per share. On average, equities research analysts anticipate that Macerich will post $0.63 earnings per share for the current fiscal year.\n\nYour IP Address:\n\nThe business also recently disclosed a quarterly dividend, which was paid on Friday, March 3rd. Shareholders of record on Tuesday, February 21st were given a $0.71 dividend. This represents a $2.84 annualized dividend and a yield of 4.42%. The ex-dividend date of this dividend was Thursday, February 16th. Macerich’s payout ratio is presently 83.04%.\n\nIn other Macerich news, EVP Robert D. Perlmutter sold 1,500 shares of the firm’s stock in a transaction dated Tuesday, January 3rd. The shares were sold at an average price of $70.79, for a total value of $106,185.00. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, EVP Hern Thomas E. O sold 5,000 shares of the firm’s stock in a transaction dated Tuesday, January 17th. The shares were sold at an average price of $70.00, for a total transaction of $350,000.00. Following the completion of the sale, the executive vice president now owns 55,077 shares of the company’s stock, valued at approximately $3,855,390. The disclosure for this sale can be found here. Company insiders own 3.54% of the company’s stock.\n\nA number of large investors have recently bought and sold shares of MAC. Tokio Marine Asset Management Co. Ltd. boosted its stake in Macerich by 47.2% in the third quarter. Tokio Marine Asset Management Co. Ltd. now owns 26,500 shares of the real estate investment trust’s stock valued at $2,143,000 after buying an additional 8,500 shares during the last quarter. Advisors Asset Management Inc. boosted its stake in Macerich by 65.7% in the third quarter. Advisors Asset Management Inc. now owns 3,528 shares of the real estate investment trust’s stock valued at $285,000 after buying an additional 1,399 shares during the last quarter. APG Asset Management N.V. boosted its stake in Macerich by 68.5% in the third quarter. APG Asset Management N.V. now owns 105,778 shares of the real estate investment trust’s stock valued at $8,554,000 after buying an additional 43,000 shares during the last quarter. Virginia Retirement Systems ET AL boosted its stake in Macerich by 154.9% in the third quarter. Virginia Retirement Systems ET AL now owns 96,443 shares of the real estate investment trust’s stock valued at $7,799,000 after buying an additional 58,600 shares during the last quarter. Finally, Kissinger Financial Services LLC bought a new stake in Macerich during the third quarter valued at $832,000. Hedge funds and other institutional investors own 93.27% of the company’s stock.\n\nMacerich Company Profile\n\nThe Macerich Company is a fully integrated self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. It owns 56 million square feet of real estate consisting primarily of interests in 51 regional shopping centers.\n\nReceive News & Ratings for Macerich Co Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Macerich Co and related companies with MarketBeat.com's FREE daily email newsletter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.thecerbatgem.com/2017/03/22/wm-morrison-supermarkets-plc-mrw-rating-reiterated-by-goldman-sachs-group-inc.html&cid=52779432740331&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNE9wUrun1RBjy5K7Mqp6dQrMjRczA\">The Cerbat Gem</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nWM Morrison Supermarkets PLC (MRW) Rating Reiterated by Goldman Sachs Group Inc\n", "text": "<p>WM Morrison Supermarkets PLC (LON:MRW)‘s stock had its “sell” rating restated by equities research analysts at Goldman Sachs Group Inc in a research note issued to investors on Wednesday. They currently have a GBX 190 ($2.35) target price on the grocer’s stock. Goldman Sachs Group Inc’s target price points to a potential downside of 19.49% from the stock’s previous close.\n\nA number of other equities research analysts have also commented on the stock. Credit Suisse Group AG reiterated a “neutral” rating and set a GBX 200 ($2.47) price target on shares of WM Morrison Supermarkets PLC in a report on Monday. BNP Paribas reissued a “neutral” rating and set a GBX 235 ($2.90) price objective on shares of WM Morrison Supermarkets PLC in a research report on Friday, March 17th. JPMorgan Chase & Co. reissued a “neutral” rating and set a GBX 260 ($3.21) price objective on shares of WM Morrison Supermarkets PLC in a research report on Tuesday, March 14th. Deutsche Bank AG reissued a “hold” rating on shares of WM Morrison Supermarkets PLC in a research report on Sunday, March 12th. Finally, Barclays PLC reissued an “underweight” rating and set a GBX 205 ($2.53) price objective on shares of WM Morrison Supermarkets PLC in a research report on Friday, March 10th. Ten investment analysts have rated the stock with a sell rating, six have issued a hold rating and one has given a buy rating to the company. WM Morrison Supermarkets PLC has a consensus rating of “Sell” and a consensus price target of GBX 196.81 ($2.43).\n\nWM Morrison Supermarkets PLC (LON:MRW) opened at 233.90 on Wednesday. The company’s market capitalization is GBX 5.43 billion. The company’s 50 day moving average is GBX 242.44 and its 200-day moving average is GBX 227.68. WM Morrison Supermarkets PLC has a 52-week low of GBX 168.50 and a 52-week high of GBX 250.00.\n\nThe company also recently disclosed a dividend, which will be paid on Thursday, June 29th. Investors of record on Thursday, May 25th will be given a dividend of GBX 3.85 ($0.05) per share. This represents a yield of 1.67%. This is an increase from WM Morrison Supermarkets PLC’s previous dividend of $1.58. The ex-dividend date is Thursday, May 25th.\n\nYour IP Address:\n\nIn other news, insider Paula Vennells acquired 12,745 shares of the business’s stock in a transaction that occurred on Friday, March 10th. The shares were bought at an average cost of GBX 234 ($2.89) per share, with a total value of £29,823.30 ($36,832.53). Also, insider Neil Davidson acquired 12,800 shares of the business’s stock in a transaction that occurred on Monday, March 13th. The shares were purchased at an average cost of GBX 235 ($2.90) per share, for a total transaction of £30,080 ($37,149.56).\n\nAbout WM Morrison Supermarkets PLC\n\nWm Morrison Supermarkets PLC is engaged in the operation of retail supermarket stores under the Morrisons brand and associated activities. The Company offers products, such as Free From, World Foods, Food To Go and Nutmeg clothing. It has food manufacturing capabilities in meat, fish, bakery, fruit and veg, deli and flowers.\n\nReceive News & Stock Ratings for WM Morrison Supermarkets PLC Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for WM Morrison Supermarkets PLC and related stocks with our FREE daily email newsletter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://petroglobalnews24.com/2017-03-22-shire-plcs-shpg-focus-list-rating-reaffirmed-at-goldman-sachs-group-inc/&cid=52779430629388&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNFZxbz0uvmy-w1Z8AYj3L17UY4ebA\">Petro Global News 24</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nShire PLC's (SHPG) “Focus List” Rating Reaffirmed at Goldman Sachs Group Inc\n", "text": "<p>Shire PLC (NASDAQ:SHPG)‘s stock had its “focus list” rating reissued by research analysts at Goldman Sachs Group Inc in a research note issued on Tuesday.\n\nA number of other research analysts have also weighed in on the company. Barclays PLC initiated coverage on Shire PLC in a report on Tuesday, March 7th. They set an “overweight” rating on the stock. Jefferies Group LLC set a $239.00 target price on Shire PLC and gave the stock a “buy” rating in a report on Friday, February 17th. Societe Generale initiated coverage on Shire PLC in a report on Friday, December 2nd. They set a “buy” rating on the stock. Royal Bank of Canada reissued a “buy” rating and set a $221.00 target price on shares of Shire PLC in a report on Tuesday, March 14th. Finally, Liberum Capital initiated coverage on Shire PLC in a report on Thursday, March 9th. They set a “buy” rating on the stock. Four investment analysts have rated the stock with a hold rating, nineteen have assigned a buy rating and one has given a strong buy rating to the stock. Shire PLC currently has an average rating of “Buy” and a consensus target price of $222.56.\n\nShares of Shire PLC (NASDAQ:SHPG) traded down 1.73% on Tuesday, reaching $173.14. The company had a trading volume of 1,120,219 shares. The company’s 50-day moving average price is $176.86 and its 200-day moving average price is $178.94. Shire PLC has a 52-week low of $155.67 and a 52-week high of $209.22. The firm has a market capitalization of $52240.26 billion, a price-to-earnings ratio of 264.74 and a beta of 1.53.\n\nShire PLC (NASDAQ:SHPG) last posted its quarterly earnings results on Thursday, February 16th. The biopharmaceutical company reported $3.37 earnings per share for the quarter, topping the Thomson Reuters’ consensus estimate of $3.24 by $0.13. The firm had revenue of $3.81 billion for the quarter. Shire PLC had a return on equity of 14.81% and a net margin of 1.62%. The firm’s revenue for the quarter was up 121.8% compared to the same quarter last year. During the same period last year, the firm earned $2.97 EPS. On average, analysts predict that Shire PLC will post $15.06 earnings per share for the current year.\n\nThe company also recently declared a dividend, which will be paid on Tuesday, April 25th. Investors of record on Friday, March 10th will be paid a $0.771 dividend. The ex-dividend date is Wednesday, March 8th. This is an increase from Shire PLC’s previous dividend of $0.14. Shire PLC’s payout ratio is 51.95%.\n\nHedge funds have recently added to or reduced their stakes in the stock. Seven Bridges Advisors LLC bought a new stake in Shire PLC during the third quarter worth $123,000. Sowell Financial Services LLC bought a new stake in Shire PLC during the fourth quarter worth $126,000. FTB Advisors Inc. increased its stake in Shire PLC by 12.3% in the third quarter. FTB Advisors Inc. now owns 674 shares of the biopharmaceutical company’s stock worth $127,000 after buying an additional 74 shares during the last quarter. Ropes Wealth Advisors LLC increased its stake in Shire PLC by 14.2% in the third quarter. Ropes Wealth Advisors LLC now owns 708 shares of the biopharmaceutical company’s stock worth $137,000 after buying an additional 88 shares during the last quarter. Finally, Advantage Investment Management LLC bought a new stake in Shire PLC during the fourth quarter worth $138,000. Hedge funds and other institutional investors own 22.69% of the company’s stock.\n\nAbout Shire PLC\n\nShire plc is a biotech company focused on serving people with rare diseases and other specialized conditions. The Company’s segment is engaged in research, development, licensing, manufacturing, marketing, distribution and sale of specialist medicines. It focuses its development resources on projects in various therapeutic areas (TAs), including Neuroscience, Ophthalmology, Hematology, Oncology, Immunology, Gastrointestinal (GI)/Metabolic/Endocrinology Diseases.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.information-management.com/news/goldman-sachs-set-to-hire-developer-to-work-on-new-robo-adviser&cid=52779432697191&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNEyXevC4vb-B0-lMdElsW3i-a9JaQ\">Information Management</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nGoldman Sachs set to hire developer to work on new robo-advisor\n", "text": "<p>(Bloomberg) -- Goldman Sachs Group Inc. plans to hire a software developer to help open an automated investing service for mass-market wealth clients.\n\nThe bank is advertising for a software developer to help create a platform that can be used to give customers “detailed information on their financial portfolio & analytics,” according to a job posting on the New York-based firm’s website.\n\nThe business would “cover mass affluent market by building an Automated Digital Advice Platform (Robo Advisor),” according to the listing. Reuters reported the new service earlier Monday. Andrew Williams, a bank spokesman, declined to comment.\n\nGoldman Sachs runs a private wealth business that has focused on clients with $50 million or more in assets. The bank has been doing more with mass-market consumers in recent years, opening an online bank and an Internet lender for consolidating credit-card debt. Last year, it purchased a retirement-plan operator for members of the so-called gig economy.\n\nThe robo-advisor would be housed in the firm’s investment-management division, which supervised almost $1.4 trillion in client assets at year-end.\n\n</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.benchmarkmonitor.com/the-goldman-sachs-group-inc-nysegs-and-morgan-stanley-executives-preparing-to-shift-staff/197071&cid=52779435163226&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNHp6mXqrk6YYtFF_d8ttWB-mTNahw\">Benchmark Monitor</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nThe Goldman Sachs Group, Inc. (NYSE:GS) and Morgan Stanley executives ...\n", "text": "<p>Senior The Goldman Sachs Group, Inc. (NYSE:GS) and Morgan Stanley executives said they’re preparing to shift staff and operations from London to elsewhere in the European Union as Prime Minister Theresa May sets up the U.K.’s exit from the bloc. A day after May’s office announced she will open two years of divorce talks with the EU on March 29, Richard Gnodde, co-head of investment banking at Goldman Sachs, told CNBC on Tuesday that his bank will initially relocate hundreds of London-based employees to expand other offices after the split. The Goldman Sachs Group, Inc. (NYSE:GS) shares went down -3.77% to $233.00 on Tuesday.\n\nTechnical Stock Analysis\n\nShares outstanding are recorded as 398.38M and total shares floated are 390.16M. Company’s distance from 20 day simple moving average is -6.45% and distance from 50-Day simple moving average is -4.14%.\n\nBest time to invest in stock market is when things are on odd side, and it’s not easy how to pick stocks. By reviewing stock prices from the stock market history of the company and examining its analysts ratings can give an investment picture with updated information of stock which helps investors to make investing decision. Stock has got OUTPERFORM rating from 11 analysts of Thomson Reuters, 13 analysts given HOLD rating to the stock and 1 given UNDERPERFORM rating. Analyst’s mean target price for GS is $249.68 while analysts mean recommendation is 2.60.\n\nThe Goldman Sachs Group, Inc. (NYSE:GS) yearly performance is 51.14% and net profit margin is 18.70%. Annual EPS Growth of past 5 years is 29.30%. Company price to earnings (P/E) ratio, which measures the relationship between the earnings of a company and its stock price, is calculated as 14.24. The current share price indicate that stock is -8.68% away from its one year high and is moving 70.22% ahead of its 52-week low.\n\nOn 21 March 2017, Advanced Energy Industries, Inc. (NASDAQ:AEIS) shares moved to $65.50 after starting the day at $70.00. Stock has got OUTPERFORM rating from 2 analysts of Thomson Reuters, 5 analysts given HOLD rating to the stock. Analyst’s mean target price for AEIS is $64.60 while analysts mean recommendation is 2.50.\n\nTata Motors Limited (NYSE:TTM) announced the commencement of pre-bookings for the Tata Tigor across all authorised dealership with a booking amount of Rs 5,000. This comes as the company will launch sub-compact sedan later this month. The Tigor is the rechristened version of the Kite 5 concept car which was first showcased at the Autoexpo 2016.\n\nAt the movement Tata Motors Limited (NYSE:TTM) is under coverage by number of analysts. Buy rating has been given by 2 analysts to the company stock. The consensus recommendation by Thomson Reuters analysts is Buy and their mean rating for the stock is 1.00 on scale of 1-5. Analysts mean target price for Tata Motors Limited (NYSE:TTM) is $45.00 while their mean recommendation is 1.00 (1=Buy, 5=sell).\n\nIf we look at stock performance in last active day trading, we see that stock has moved went down -2.35% to end the day at $35.76. Company price to earnings (P/E) ratio, which measures the relationship between the earnings of a company and its stock price, is calculated as 14.66. The current share price indicate that stock is -20.16% away from its one year high and is moving 32.65% ahead of its 52-week low.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/top-research-reports-for-netflix-goldman-sachs-kinder-morgan-cm764284&cid=52779433500120&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNHEpuVCMDh3mi4WjdzvH4j8K8SioQ\">Nasdaq</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nTop Research Reports for Netflix, Goldman Sachs & Kinder Morgan\n", "text": "<p>Today's Research Daily features new research reports on 16 major stocks, including Netflix, Inc. (NFLX), Kinder Morgan Inc (KMI) and The Goldman Sachs Group Inc (GS).\n\nNetflix shares have gained +42.7% over the past 12 months, outperforming the Zacks Broadcast Radio/TV industry, which has gained +23.3% over the same period. Netflix's focus on global expansion and original content has paid off with the streaming giant adding 7.05 million net new additions in the last reported quarter, taking the total count to 19 million for 2016. Moreover, for the first time, Netflix expects International segment to post profits in the current quarter to the tune of $16 million. But, investments in original/acquired content remain a drag on profitability. Netflix reports Q1 results on April 17th, with the company expected to earn 38 cents on $2.6 billion in revenues, up f rom 6 cents on $1.96 billion in revenues in the year-earlier period. (You can read the full research report on Netflix here >> )\n\nKinder Morgan, the owner and operator of the largest network of natural gas pipelines in North America, has moved past the worst in recent history when a debt-laden balance sheet and weaker commodity volumes in response to lower natural gas prices stretched its financials. The dividend cut and debt repayments have materially stabilized the company's financial profile and put it on track sustainable long-term growth. While near-term challenges remain, the company's strong position in natural gas infrastructure is a key long-term competitive advantage. The stock has lagged the Zacks Oil & gas Pipeline industry in the last one year, but has done better than the Energy sector as a whole. (You can read the full research report on Kinder Morgan here >> )\n\nGoldman Sachs outperformed the Investment Brokers industry over the past six months (+41.9% vs. +38.1%), while its focus to capitalize on growth opportunities through strategic moves, including its new digital consumer lending platform, should continue to bolster its overall business. Also, the company is poised to benefit from its disciplined expense management and solid capital position. However, several issues including sluggish global economic growth and a stringent regulatory landscape remain near-to-medium-term headwinds. (You can read the full research report on Goldman Sachs here >> )\n\nOther noteworthy reports we are featuring today include Adobe Systems Incorporated (ADBE), U.S. Bancorp (USB) and Colgate-Palmolive Company (CL).\n\n8 Stocks with Huge Profit Potential\n\nJust released: Driverless Cars: Your Roadmap to Mega-Profits Today. In this latest Special Report, Zacks' Aggressive Growth Strategist Brian Bolan explores a full-blown technological breakthrough in the making - autonomous cars. He also spotlights 8 stocks with tremendous gain potential to feed off this phenomenon. Click to see the stocks right now >>\n\nSheraz Mian\n\nDirector of Research\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here >>>\n\nToday's Must Read\n\nNetflix (NFLX) Original Content & Expansion Plan Pays Off\n\nKinder Morgan (KMI) to Spend $3.2B for 2017 Growth Projects\n\nGoldman (GS) Poised For Growth; Regulatory Issues Linger\n\nFeatured Reports\n\nPublic Service (PEG) Tops Q4 Earnings, Misses Sales Estimate\n\nPer the Zacks analyst, steady capital investment backed by a stable liquidity position drove Public Service's better-than-expected Q4 earnings.\n\nApache (APA) Reports Q4 Loss, to Boost 2017 Capex by 60%\n\nWhile the covering analyst likes Apache's plans to deliver a returns-focused growth in 2017, the volatility in oil prices limits upside from current levels.\n\nTELUS' (TU) IoT & Wireless Business Bode Well, Risks Stay\n\nPer the Zacks analyst, in spite of intense competition in the wireline and wireless markets, TELUS is focused on strengthening its Internet of Things (IoT) suite\n\nHormel (HRL) Upped to Hold on Growth Drivers, Risks Exists\n\nAccording to the Zacks analyst, Hormel is poised to grow on product launches, meaningful acquisitions and higher market demand.\n\nIncyte (INCY) Jakafi to Drive Growth, Pipeline Should Deliver\n\nPer the Zacks analyst, Incyte's efforts to expand Jakafi's label is positive. However, Incyte is highly dependent on single drug Jakafi while other pipeline candidates are in early-to-mid stages.\n\nU.S. Bancorp (USB) Poised to Growth; Cost Woes Linger\n\nAs per the Zacks analyst, organic growth remained a key strength at U.S. Bancorp, as reflected by higher loans and deposits balances.\n\nIntercontinental Exchange (ICE) Grows on Strategic Steps\n\nAccording to the Zacks analyst, Intercontinental Exchange is poised to grow on the back of continued strength in its energy franchise.\n\nNew Upgrades\n\nArcelorMittal (MT) to Gain from Cost & Debt Cuts, Expansion\n\nThe Zacks analyst is encouraged by ArcelorMittal's actions to cut debt & costs and expand capacity, which should lead to better operational performance.\n\nAdobe (ADBE) Beats Q1 Earnings and Revenue\n\nWith Adobe delivering strong Q1 results, the Zacks analyst believes that the company's strong position in creative cloud market and continued innovation will continue to drive growth going forward.\n\nLam Research (LRCX) Memory, Foundry & Logic Segments Strong\n\nThe Zacks analyst believes that Lam's exposure to memory manufacturers (a segment with multi-year growth prospects), and opportunity in logic and foundry segments are positives.\n\nNew Downgrades\n\nGeneral Mills (GIS) Beats on Q3 Earnings, Sales Weak\n\nAlthough General Mills' EPS grew, revenues and volumes dipped in Q3. Per the Zacks analyst, though robust restructuring savings helped improve the bottom line, a material improvement will take time.\n\nCerner (CERN) Hurt by Tough Competition in HCIT Market Space\n\nThe Zacks analyst believes that tough competition in the Healthcare & Information Technology (HCIT) market exerts considerable pressure on both pricing and margins of Cerner.\n\nColgate (CL) Continues to Fight Foreign Currency Headwinds\n\nPer the covering analyst, Colgate expects a challenging backdrop in 2017 owing to uncertain global markets and lingering currency headwinds.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.theusacommerce.com/2017/03/22/the-goldman-sachs-group-inc-gs-checking-the-chart/&cid=52779433295724&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNG2D9Us1Oqh3DpJtD5Dp-vc68iCTw\">The USA Commerce</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nThe Goldman Sachs Group, Inc. (GS) : Checking the Chart\n", "text": "<p>We have gathered the technical data on The Goldman Sachs Group, Inc. (GS), and see some interesting trends in the stock’s behavior of late. In the end, it’s all about what a stock does that matters. In the case of this particular stock, the chart tells quite a story at present.\n\nGS has been trading in a bearish trend, based on the relative levels of its 50-day and 200-day simple moving averages. This suggests that the broad sum of capital flow in the stock has been generally negative over the recent period. In terms of the relative level of interest afforded this stock among active participants in the market, relative volume measures have been weak, indicating apathy for the name by traders, investors, and money managers during the past month of action. This suggests something of the significance of other current technical measures as well.\n\nFor market timers, it’s also important to take measure of the relative level of recent lift or pressure in the stock is it overbought or oversold? For that, we turn to RSI and stochastic measures. The 14-day RSI stands at 28.41%. That shows that the stock, according to a traditional interpretation and usage of the RSI indicator, is becoming oversold or undervalued, and therefore may be ready for a trend change or corrective price reversal to the upside If we look at the stochastic measure, the raw data over the stock’s last month of action shows a score of 2.07%. Based on a raw data interpretation, this perspective doesn’t suggest either an overbought or oversold condition.\n\nAs professionals know, risk is best understood through a measure of volatility in an investment vehicle. In recent action, GS has made a move of -18.76 over the past month. Over the trailing year, the stock is outperforming the S&P 500 by 32.55%, and it’s gotten there by action that has been more volatile on a day-to-day basis than most other stocks on the exchange. The stock’s recent movement has come on a historical volatility score of 17.47%, which represents the standard deviation of returns of a theoretical long position from a mean price during that period. On a daily basis over the past month, the average true range of the stock, as expressed in percentage terms, is 1.7%. That should give you a pretty good sense of the level of risk implied in a short-term trading approach in the stock with a stop-loss in place.\n\nAs it stands at present, the stock might find important action at key Fibonacci levels. Fibonacci levels are used by major Wall Street firm technical desks. The math is drawn from the Fibonacci series that defines growth systems by an interval increase characterized by steps divisible by the “golden ratio” of 61.8%. In this case, the critical 38.2% level drawn off the 52-weeklow of $136.88 sits at $182.06. GS also has additional support below at the stock’s 200-day simple moving average, which sits at $195.75.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.thecerbatgem.com/2017/03/22/novartis-ag-nvs-receives-neutral-rating-from-goldman-sachs-group-inc.html&cid=52779426820045&ei=4g3WWKmkNZLYuASynZrgBg&usg=AFQjCNE3jg9Uzsi_qiaYigWZJdnvoTIXRg\">The Cerbat Gem</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nNovartis AG (NVS) Receives Neutral Rating from Goldman Sachs Group Inc\n", "text": "<p>Novartis AG (NYSE:NVS)‘s stock had its “neutral” rating reaffirmed by analysts at Goldman Sachs Group Inc in a report issued on Wednesday.\n\nA number of other brokerages have also recently commented on NVS. Vetr upgraded Novartis AG from a “hold” rating to a “buy” rating and set a $79.30 target price for the company in a report on Wednesday, March 1st. JPMorgan Chase & Co. reiterated a “neutral” rating on shares of Novartis AG in a report on Tuesday, March 14th. BNP Paribas cut Novartis AG from a “neutral” rating to an “underperform” rating in a report on Tuesday, March 7th. Societe Generale upgraded Novartis AG from a “hold” rating to a “buy” rating and lifted their target price for the stock from $73.82 to $74.37 in a report on Tuesday, March 7th. Finally, Barclays PLC assumed coverage on Novartis AG in a report on Tuesday, March 7th. They issued an “underweight” rating for the company. Three investment analysts have rated the stock with a sell rating, ten have assigned a hold rating, five have assigned a buy rating and one has issued a strong buy rating to the company’s stock. The company presently has a consensus rating of “Hold” and a consensus target price of $85.73.\n\nShares of Novartis AG (NYSE:NVS) traded down 0.11% during midday trading on Wednesday, reaching $74.31. The company had a trading volume of 1,438,026 shares. Novartis AG has a 1-year low of $66.93 and a 1-year high of $83.58. The stock has a market capitalization of $176.42 billion, a price-to-earnings ratio of 26.54 and a beta of 0.73. The firm’s 50 day moving average price is $75.37 and its 200-day moving average price is $74.30.\n\nNovartis AG (NYSE:NVS) last announced its earnings results on Wednesday, January 25th. The company reported $1.12 EPS for the quarter, hitting the Zacks’ consensus estimate of $1.12. The firm earned $12.32 billion during the quarter, compared to analysts’ expectations of $12.44 billion. Novartis AG had a return on equity of 15.37% and a net margin of 13.80%. The company’s quarterly revenue was down 1.6% on a year-over-year basis. During the same quarter in the previous year, the business earned $1.14 EPS. Equities research analysts expect that Novartis AG will post $4.70 EPS for the current fiscal year.\n\nThe firm also recently declared an annual dividend, which was paid on Friday, March 3rd. Investors of record on Friday, March 3rd were paid a dividend of $2.327 per share. The ex-dividend date of this dividend was Wednesday, March 1st. Novartis AG’s dividend payout ratio is currently 82.14%.\n\nYour IP Address:\n\nSeveral large investors have recently modified their holdings of the company. Sowell Financial Services LLC acquired a new stake in shares of Novartis AG during the fourth quarter worth about $116,000. Zions Bancorporation raised its stake in shares of Novartis AG by 21.0% in the fourth quarter. Zions Bancorporation now owns 1,656 shares of the company’s stock worth $120,000 after buying an additional 287 shares in the last quarter. Mosaic Family Wealth LLC raised its stake in shares of Novartis AG by 11.2% in the third quarter. Mosaic Family Wealth LLC now owns 1,886 shares of the company’s stock worth $149,000 after buying an additional 190 shares in the last quarter. First PREMIER Bank raised its stake in shares of Novartis AG by 65.7% in the third quarter. First PREMIER Bank now owns 1,955 shares of the company’s stock worth $154,000 after buying an additional 775 shares in the last quarter. Finally, Integrated Wealth Counsel LLC raised its stake in shares of Novartis AG by 13.8% in the third quarter. Integrated Wealth Counsel LLC now owns 1,998 shares of the company’s stock worth $158,000 after buying an additional 242 shares in the last quarter. 9.82% of the stock is owned by hedge funds and other institutional investors.\n\nAbout Novartis AG\n\nNovartis AG is a holding company, which provides healthcare solutions. The Company is engaged in the research, development, manufacturing and marketing of a range of healthcare products led by pharmaceuticals. The Company’s segments include Innovative Medicines, Sandoz, Alcon and Corporate activities.\n\nReceive News & Stock Ratings for Novartis AG Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Novartis AG and related stocks with our FREE daily email newsletter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"https://www.bloomberg.com/news/articles/2017-03-23/goldman-bny-mellon-bow-to-investor-pressure-on-gender-pay-gap\">bloomberg</a>"}, "start_date": {"hour": 21, "month": 3, "second": 44, "year": 2017, "day": 23, "minute": 3}, "end_date": {}, "text": {"headline": "Goldman, BNY Mellon Bow to Investor Pressure on Gender Pay", "text": "<p>An activist shareholder says it has persuaded Goldman Sachs, BNY Mellon and three telecommunications companies to “take proactive steps” to address the disparities in men’s and women’s compensation, avoiding a shareholder vote on the issue.\n\nPax World Management, which oversees about $4.1 billion, had filed proposals asking the two banks, along with Verizon, AT&T and Qualcomm, to disclose what’s known as pay-gap data and to work toward parity. Pax withdrew the proposals after all five agreed to take steps to address pay inequities, though none committed to the specific requests to make public the data or to close the gaps.\n\n“This is a process,” said Heather Smith, lead sustainability research analyst at Portsmouth, New Hampshire-based Pax. “We don’t expect our work to stop here. We will be continuing our conversations with these and other companies.”\n\nFollowing Pax’s proposals, three of the companies -- Bank of New York Mellon Corp., Verizon Communications Inc. and Qualcomm Inc. -- released statements outlining their commitments to pay parity and explaining how they will monitor it. Goldman Sachs Group Inc. agreed to enhance pay equity disclosures in a report this spring, Smith said. Fletcher Cook, a spokesman for AT&T, said the company had signed the White House Equal Pay Pledge last year, reinforcing “what we already deliver to our employees: equal pay for comparable work, experience and performance.”\n\nOther finance companies are resisting similar pressure from Boston-based Arjuna Capital. At 2017 annual meetings, shareholders at Wells Fargo & Co., Citigroup Inc., American Express Co. and Bank of America Corp. will vote on measures asking the companies to issue reports examining gender-pay gaps and their efforts to ensure parity.\n\nAll four have advised investors to reject the proposals, arguing that they already have strong records on hiring, paying and promoting women. None make public any examination of gender-pay gaps or efforts to ensure pay parity, according to Natasha Lamb, managing director at Arjuna.\n\nThe most important business stories of the day. Get Bloomberg's daily newsletter.\n\nLamb said the companies she engaged with had offered similar responses to those Pax received, but Arjuna didn’t withdraw its proposals. “It is not sufficient,” she said. “We expect the same level of reporting as the tech companies gave in 2016. That means reporting the percentage gap and committing to close it.” Last year, Arjuna made equal pay proposals at nine tech companies, seven of which -- including Intel Corp. and Apple Inc. -- agreed to make the data public and close the gaps.\n\nThe gender-pay gap has become an important metric for investors and others who are concerned about increasing opportunity for women in finance. While women represent about half of the workforce of the 23 banks with market capitalization of greater than $25 billion, they make up only about 21 percent of their executive ranks, according to Bloomberg data.\n\nThe finance industry also has one of the largest pay disparities, according to a survey by job site Glassdoor.com. Men who work at financial services firms on average earn 6.4 percent more than women, after controlling for job title and responsibilities. The gap at technology companies, for example, is 5.9 percent.</p>"}}]}