{"events": [{"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.sfgate.com/business/article/Sears-Nike-and-US-Bancorp-stumble-while-FedEx-11020655.php&cid=52779433723471&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNEe1D7NSmOQNsavfFtrzFF5qJardw\">SFGate</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nSears, Nike and US Bancorp stumble while FedEx, Duluth rise\n", "text": "<p>Sears, Nike and US Bancorp stumble while FedEx, Duluth rise\n\nNEW YORK (AP) — Stocks that moved substantially or traded heavily on Wednesday:\n\nSears Holdings Corp., down $1.12 to $7.98\n\nThe retailer said in a regulatory filing that there is \"substantial doubt\" it will be able to remain in business.\n\nNike Inc., down $4.09 to $53.92\n\nThe shoe and athletic apparel retailer reported weaker sales than expected and investors weren't pleased with its outlook.\n\nU.S. Bancorp, down 9 cents to $52.60\n\nBanks fell for the fourth trading day in a row as interest rates decreased again.\n\nFedEx Corp., up $4.08 to $195.92\n\nThe shipping company's holiday-season results were mixed, but analysts expect its business to improve.\n\nDuluth Holdings Inc., up $2.76 to $22.02\n\nThe clothing and tools supplier had a strong fourth quarter and its annual forecast was better than analysts expected.\n\nPPG Industries Inc., down 23 cents to $104.25\n\nPPG offered to buy industrial paints and chemicals company AkzoNobel for about $24 billion, which AkzoNobel rejected.\n\nPublic Service Enterprise Group Inc., up 44 cents to $45.10\n\nUtility companies continued to do better than the rest of the market as investors snap up high-dividend stocks as bond yields fall.\n\nMallinckrodt PLC, down $1.51 to $42.54\n\nImprimis Pharmaceuticals said it is studying a drug that would compete with Mallinckrodt's costly drug HP Acthar gel.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://myfox28columbus.com/sports/jason-day-withdraws-from-wgc-event-to-be-with-cancer-stricken-mother&cid=0&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNE3GWUOjuXj3aAv6uprUp6MeE3r-Q\">Fox 28</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nJason Day withdraws from WGC event to be with cancer-stricken mother\n", "text": "<p>Defending champion Jason Day, right, of Australia, walks down the seventh hole after he conceded to Pat Perez after six holes of play during round-robin play at the Dell Technologies Match Play golf tournament at Austin County Club, Wednesday, March 22, 2017, in Austin, Texas. Day also withdrew from the tournament. (AP Photo/Eric Gay)\n\nAUSTIN, Texas (AP) — Defending champion Jason Day tearfully withdrew from the Dell Technologies Match Play on Wednesday after six holes to be with his mother when she has lung cancer surgery.\n\nDay says his mother, Dening, was diagnosed in Australia at the start of the year and was told she had 12 months to live. He brought her to Ohio, where he lives with his wife and two children, for more tests.\n\nDay says the surgery will be Friday and he could not keep his mind off it. He was 3 down to Pat Perez when he conceded the match and withdrew from the tournament.\n\n\n\n\n\nHis father, Alvin, died of stomach cancer when Day was 12.\n\nDay's agent, Bud Martin, says doctors in Ohio have offered a more positive prognosis and will know more after surgery.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.newsoracle.com/2017/03/22/investors-catching-stocks-nike-inc-nke/&cid=52779432692552&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNHdzl0NxzZZ7VELUCyyIxUAhVmPaA\">News Oracle</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nInvestors Catching Stocks NIKE, Inc. (NKE)\n", "text": "<p>NIKE, Inc. (NKE) will report its next earnings on 21-Mar-17. The company reported the earnings of $0.5/Share in the last quarter where the estimated EPS by analysts was $0.43/share. The difference between the expected and actual EPS was $0.07/share, which represents an Earnings surprise of 16.3%.\n\nMany analysts are providing their Estimated Earnings analysis for NIKE, Inc. and for the current quarter 32 analysts have projected that the stock could give an Average Earnings estimate of $0.53/share. These analysts have also projected a Low Estimate of $0.48/share and a High Estimate of $0.58/share.\n\nIn case of Revenue Estimates, 29 analysts have provided their consensus Average Revenue Estimates for NIKE, Inc. as 8.47 Billion. According to these analysts, the Low Revenue Estimate for NIKE, Inc. is 8.32 Billion and the High Revenue Estimate is 8.61 Billion. The company had Year Ago Sales of 8.03 Billion.\n\nThese analysts also forecasted Growth Estimates for the Current Quarter for NKE to be -3.6%. They are projecting Next Quarter growth of 18.4%. For the next 5 years, NIKE, Inc. is expecting Growth of 12.18% per annum, whereas in the past 5 years the growth was 17.38% per annum.\n\nSome buy side analysts are also providing their Analysis on NIKE, Inc., where 8 analysts have rated the stock as Strong buy, 14 analysts have given a Buy signal, 11 said it’s a HOLD, 1 reported it as Underperform and 0 analysts rated the stock as Sell. (These Recommendations are for the Current Month Only reported by Yahoo Finance.)\n\nWhen it comes to the Analysis of a Stock, Price Target plays a vital role. 30 Analysts reported that the Price Target for NIKE, Inc. might touch $100 high while the Average Price Target and Low price Target is $62.47 and $46 respectively.\n\nTo analyze a stock, one should look for Upgrades and Downgrades of a stock. NIKE, Inc. got Initiated on 19-Jan-17 where investment firm Atlantic Equities Initiated the stock to Overweight.\n\nNIKE, Inc. closed its last trading session at $58.68 with the loss of -1.14%. The Market Capitalization of the company stands at 95.98 Billion. The Company has 52-week high of $65.44 and 52-week low of $49.01. The stock’s current distance from 20-Day Simple Moving Average (SMA20) is 1.31% where SMA50 and SMA200 are 5.23% and 7.61% respectively. The Company Touched its 52-Week High on Mar 22, 2016 and 52-Week Low on Nov 2, 2016.\n\nThe Relative Volume of the company is 1.59 and Average Volume (3 months) is 9.1 million. NIKE, Inc. P/E (price to earnings) ratio is 25.6 and Forward P/E ratio of 22.02.\n\nThe company shows its Return on Assets (ROA) value of 18%. The Return on Equity (ROE) value stands at 31.7%. While it’s Return on Investment (ROI) value is 25.5%.\n\nWhile looking at the Stock’s Performance, NIKE, Inc. currently shows a Weekly Performance of 1.27%, where Monthly Performance is 2.54%, Quarterly performance is 14.28%, 6 Months performance is 6.28% and yearly performance percentage is -9.25%. Year to Date performance value (YTD perf) value is 14.48%. The Stock currently has a Weekly Volatility of 1.69% and Monthly Volatility of 1.56%.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.hotstockspoint.com/analysts-mean-rating-score-stands-at-2-10-while-nike-inc-s-nke-stock-price-is-now-at-58-01-notable-runners/&cid=52779429734208&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNEohXX_FaiMTbI5Zsvfag-YJB2GqA\">Hot Stocks Point</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAnalysts mean rating score stands at 2.10 while NIKE, Inc.'s (NKE) stock price ...\n", "text": "<p>NIKE, Inc. (NKE)’s Stock Price Trading Update:\n\nNIKE, Inc. (NKE) stock price ended its day with loss -1.14% and finalized at the value of $58.01. During its last trading session, Stock traded with the total exchanged volume of 14.51 million shares. The average volume stands around 9.1 million shares. The average numbers of shares are traded in a security per day, during the recent 3-month period. The stock has relative volume of 1.59. Relative volume is ratio between current volume and 3-month average value, intraday adjusted. NIKE, Inc. (NKE) is a part of Consumer Goods sector and belongs to Textile – Apparel Footwear & Accessories industry.\n\nImportant Technical Indicators:\n\nATR value of company was 0.93. Average True Range (ATR) is an indicator based on trading ranges smoothed by an N-period exponential moving average percentage of the true range values. ATR can display volatility of stocks, ETFs and indexes. The principal of ATR is very similar to other volatility indicators: A high ATR value signals a possible trend change. A low ATR value correlates with a weaker trend movement.\n\nRelative Strength Index (RSI) was 62.27. Developed J. Welles Wilder, the Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements. RSI oscillates between zero and 100. Traditionally, and according to Wilder, RSI is considered overbought when above 70 and oversold when below 30.\n\nThe stock volatility for week was 1.69% while for month was 1.56%.The stock, as of last close, traded 19.16% to its 52 week low and was changed -10.25% from its 52 week high. Beta factor, which measures the riskiness of the security, was observed as 0.47. NKE’s value Change from Open was at -1.31% with a Gap of 0.17%.\n\nEarnings per share Details about NKE:\n\nEPS in next five year years is expected to touch 12.18% while EPS growth in past 5 year was 14.10% along with sales growth of 10.00% in the last five years.\n\nEPS growth in next year is estimated to reach 12.75% while EPS growth estimate for this year is set at 16.60%.\n\nThe price/earnings ratio (P/E) is 25.60 and the forward P/E ratio stands at 22.02. The price to earnings growth is 2.10 and the price to sales ratio is 17. It has a dividend yield of 1.24%.\n\nPerformance Review:\n\nTo review the NKE previous performance, look at its past history, which highlighted below:\n\nDuring last 5 trades the stock sticks almost 1.27%.\n\nDuring last one month it showed the change of 2.54%.\n\nDuring last 3 month it remained at 14.28%.\n\nDuring last one year month it performed at -9.25%.\n\nAlong with these its year to date performance is standing at 14.48%.\n\nAnalysts Mean Rating:\n\nAnalysts’ mean recommendation for NIKE, Inc. (NKE) stands at 2.10. Rating Scale; where 1.0 rating means Strong Buy, 2.0 rating signify Buy, 3.0 recommendation reveals Hold, 4.0 rating score shows Sell and 5.0 displays Strong Sell signal.\n\nNKE Stock Price Comparison to Moving Averages:\n\nUSA based company, NIKE, Inc. (NKE)’s latest closing price was 7.61% from the average-price of 200 days while it maintained a distance from the 50 Day Moving Average at 5.23% and 1.31% compared with the 20 Day Moving Average.\n\nThree Months Ago Analysts Rating:\n\nHere we discussed Analysts views what they told about Nike, Inc. (NKE) stock 3 Months Ago. Analysts recommended an average brokerage rating of Overweight derived from brokerage firms, according to FactSet. 18 said a “Buy Rating” and 3 announced “Overweight Rating”. 12 advised “Hold Rating” regarding the stock. 0 announced “Sell Rating” and 1 disclosed “Underweight Rating”. Analysts play a useful role in our capital markets. For example, by doing in-depth research for their large institutional clients and employers, analysts can help substantial sums of capital be directed to more productive uses in our economy. A “Buy” rating does not mean that every investor should acquire the stock. Nor does a “Sell” rating mean that every investor should immediately sell it. Your own financial situation and investment needs are what matter. If you consider any individual rating, do not views it in absolute or abstract terms, but in the context of your own unique financial situation. In short, whatever a given analyst recommendation may say, always consider whether a particular investment is right for you in light of your own financial circumstances. Remember, you are the boss, it’s your money, and your situation and goals that matter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/buzzus-stocks-on-the-movenike-sears-therapix-frontier-snap-transdigm--xcel-brands-20170322-00944&cid=52779433060425&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNFyw08NKGvUaXlqxpAmZJvQMUYYvQ\">Nasdaq</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nBUZZ-US STOCKS ON THE MOVE-Nike, Sears, Therapix, Frontier, Snap, TransDigm ...\n", "text": "<p>Reuters\n\n\n\n\n\n* Eikon search string for individual stock moves: STXBZ * The Day Ahead newsletter: http://tmsnrt.rs/2ggOmBi * The Morning News Call newsletter: http://tmsnrt.rs/2fwPLTh The S&P and the Nasdaq reversed course to hit session highs in late morning trading on Wednesday, even as investors remained cautious ahead of the first major legislative test of Donald Trump's presidency. [.N] At 14:23 ET, the Dow Jones Industrial Average <.DJI> was down 0.18 percent at 20,631.17. The S&P 500 <.SPX> was up 0.02 percent at 2,344.51 and the Nasdaq Composite <.IXIC> was up 0.20 percent at 5,805.147. ANALYSIS-Markets fret as Trump agenda shows signs of cracks [nL2N1GY191] World stocks seen as most overvalued in 17 years - BAML survey [nL5N1GY4LQ] BUZZ-S&P 500: Downside reversal can gain steam [nL2N1GY0WF] BUZZ-DJI: May play on a swing set [nL2N1GZ0F2] BUZZ-Utilities index hits highest level since August [nL2N1GZ1AH] The top three percentage gainers on the S&P 500 <.PG.INX>: ** Marriott Int'l <MAR.O>, up 2.7 pct at $91.47 [nL3N1GY4CY] ** Ventas Inc <VTR.N>, up 2.5 pct at $62.31 ** Freeport McMoRan <FCX.N>, up 2.4 pct at $12.87 [nFWN1GZ02J] The top three percentage losers on the S&P 500 <.PL.INX>: ** Nike Inc <NKE.N>, down 6.4 pct at $54.29 [nL3N1GZ4Q1] ** TransDigm Group <TDG.N>, down 4 pct at $215.76 [nL3N1GZ4KX] ** Mallinckrodt <MNK.N>, down 3.3 pct at $42.60 The top three percentage gainers on the NYSE <.PG.N>: ** Asia Pacific Fund <APB.N>, up 8.3 pct at $11.96 ** Silver Wheaton <SLW.N>, up 8.3 pct at $21.58 [nASB0B6FV] ** Yingli Green Energy <YGE.N>, up 7.7 pct at $2.10 The top three percentage losers on the NYSE <.PL.N>: ** Glassbridge Enterprises <GLA.N>, down 16.6 pct at $5.14 [nASB0B6HC] ** OI SA ADR <OIBRc.N>, down 9.9 pct at $6.72 [nL2N1GY1LL] ** China Online Education <COE.N>, down 8.7 pct at $16.99 [nL3N1GZ48U] The top three percentage gainers on the Nasdaq <.PG.O>: ** Therapix Biosciences <TRPX.O>, up 43.3 pct at $8.60 [nL3N1GZ4RH] ** Ominto Inc <OMNT.O>, up 24.7 pct at $12.35 ** Idera Pharma <IDRA.O>, up 17.2 pct at $2.45 [nL3N1GZ493] The top three percentage losers on the Nasdaq <.PL.O>: ** Zions Bancorp warrants <ZIONZ.O>, down 30 pct at $7.80 ** Xcel Brands Inc <XELB.O>, down 18.8 pct at $2.76 [nL3N1GZ4G2] ** Sears Holding <SHLD.O>, down 14.2 pct at $7.81 [nL3N1GZ4PQ] ** Nike Inc <NKE.N>: down 6.4 pct at $54.29 UPDATE 3-Nike's revenue misses estimates as rivals gain ground [nL3N1GY558] BUZZ-Nike Inc: Brokerages cut PTs after Q3 revenue miss, drop in orders [nL3N1GZ4Q1] ** Sears Holdings Corp <SHLD.O>: down 14.2 pct at $7.81 UPDATE 2-Sears shares sink as creditors, investors fret over going-concern risk [nL3N1GZ4PQ] BUZZ-Sears Holdings: Warns on ability to continue as going concern [nL3N1GZ4G3] ** FedEx Corp <FDX.N>: up 1.6 pct at $194.93 UPDATE 2-FedEx misses on earnings, but sees higher margins ahead [nL2N1GX17D] BUZZ-FedEx Corp: 2nd biggest S&P 500 gainer after upbeat earnings report [nL3N1GZ3YY] ** Therapix Biosciences Ltd <TRPX.O>: up 43.3 pct at $8.60BUZZ-Therapix Biosciences Ltd: Shares surge as much as 55 pct in debut [nL3N1GZ4RH] ** Frontier Communications Corp <FTR.O>: down 15.9 pct at $1.99 ** Windstream Holdings Inc <WIN.O>: down 8.0 pct at $5.88 ** CenturyLink Inc <CTL.N>: down 2.8 pct at $22.70 BUZZ-Goldman Sachs points to U.S. telcos' 'wireline woes' [nL3N1GZ3QJ] ** Winnebago Industries Inc <WGO.N>: up 5.2 pct at $29.25BUZZ-Winnebago Industries: Best day in 4 months as EPS beats again [nL3N1GZ417] ** Xcel Brands Inc <XELB.O>: down 18.8 pct at $2.76BUZZ-Xcel Brands Inc: Hits more than 4-yr low after weak Q4 results [nL3N1GZ4G2] ** Moleculin Biotech Inc <MBRX.O>: up 36.4 pct at $1.46 BUZZ-Moleculin Biotech: Lead cancer treatment gets orphan drug status [nL3N1GZ4NL] ** Calithera Biosciences Inc <CALA.O>: down 2.8 pct at $10.25BUZZ-Calithera Biosciences Inc: Drops on stock offering [nL3N1GZ40M] ** Duluth Holdings Inc <DLTH.O>: up 14.0 pct at $21.96BUZZ-Duluth Holdings Inc: Best intraday jump in a nearly year on strong forecast [nL3N1GZ439] ** Acushnet Holdings Corp <GOLF.N>: up 3.6 pct at $18.41BRIEF-Acushnet Holdings sees FY 2017 sales in line with estimates [nFWN1GZ0AT] ** Easterly Government Properties Inc <DEA.N>: down 1.4 pct at $19.45BUZZ-Easterly Government Properties: Dips on equity raise to fund acquisitions [nL2N1GZ0F9] ** Cooper Cos Inc <COO.N>: up 2.3 pct at $199.79Cooper Cos increase share repurchase program [nASB0B6FC] ** Marriott International Inc <MAR.O>: up 2.7 pct at $91.47 Brokers hike PTs a day after upbeat forecast [nL3N1GY4CY] ** Freeport McMoRan Inc <FCX.N>: up 2.4 pct at $12.87 Berenberg raises to \"hold\" from \"sell\" [nFWN1GZ02J] ** Taylor Morrison Home Corp <TMHC.N>: down 5.2 pct at $20.71BUZZ-Taylor Morrison Homes: Falls as sponsors sell via block [nL2N1GZ0JA] ** L Brands Inc <LB.N>: down 3.0 pct at $47.72 Keybanc cuts to \"underweight\" ** General Mills Inc <GIS.N>: down 1.7 pct at $58.77 Stifel cuts to hold rating - trader ** Dynatronics Corp <DYNT.O>: down 1.9 pct at $2.85 BRIEF-Dynatronics to acquire Hausmann Industries for $10 mln [nASB0B6J3] ** TransDigm Group Inc <TDG.N>: down 4.0 pct at $215.76BUZZ-TransDigm Group Inc: Hits more than 10-month low [nL3N1GZ4KX] ** Idera Pharmaceuticals Inc <IDRA.O>: up 17.2 pct at $2.45 BUZZ-Idera Pharma: At 6-mth high after JMP starts with \"market outperform\" [nL3N1GZ493] ** China Online Education Group <COE.N>: down 8.7 pct at $16.99BUZZ-China Online Education Group: Plunges after Q4 loss widens [nL3N1GZ48U] ** Steelcase Inc <SCS.N>: up 3.2 pct at $16.20 BRIEF-Steelcase reports Q4 results [nASB0B6EV] ** Oi SA <OIBRc.N>: down 9.9 pct at $6.72 BUZZ-Brazil's Oi: creditor group asks court mediation to discuss debt plan [nL2N1GY1LL] ** Dow Chemical <DOW.N>: down 1.1 pct at $62.36 ** DuPont <DD.N>: down 1.4 pct at $78.66 Indian regulator says Dow, DuPont deal likely to hurt competition [nL3N1GZ4GM] ** PPG Industries Inc <PPG.N>: down 0.7 pct at $103.79 UPDATE 5-Shareholders urge Akzo to negotiate with suitor PPG ** Bank of America <BAC.N>: down 0.4 pct at $22.94 ** Goldman Sachs <GS.N>: down 1.1 pct at $230.41 ** Wells Fargo <WFC.N>: down 1.0 pct at $55.28 ** Morgan Stanley <MS.N>: down 1.0 pct at $42.25 ** JPMorgan Chase <JPM.N>: flat at $87.43 ** Citigroup Inc <C.N>: down 0.3 pct at $57.86 U.S. bank stocks fall as investor hope wanes for policy boosts [nL2N1GY1O0] BUZZ-Bank stocks tumble as investors take profits on political uncertainty [nL2N1GY10X] BUZZ-Amid bank sell off, greater pain centered in regionals [nL2N1GU0TN] ** Snap Inc <SNAP.N>: up 5.7 pct at $21.54 Snap pops 9 percent after winning second 'buy' recommendation [nL2N1GZ164] BUZZ-Snap Inc wins second 'buy' rating from analyst [nL2N1GY213] ** American Airlines Group Inc <AAL.O>: down 0.9 pct at $40.04 ** Delta Air Lines Inc <DAL.N>: up 0.1 pct at $45.58 ** Southwest Airlines Co <LUV.N>: up 0.6 pct at $52.19 ** Alaska Air Group Inc <ALK.N>: up 0.4 pct at $92.47 BUZZ-U.S. airlines: MS downgrades to \"in-line\" [nL3N1GZ3ZE] ** Bebe Stores Inc <BEBE.O>: up 6.4 pct at $3.80BUZZ-Bebe Stores Inc: Claws back some gains after Tuesday's rout [nL3N1GZ3YM] MEDIA-Bebe plans to shut its stores and focus on web sales - Bloomberg [nL3N1GY4RD] ** Uni-Pixel Inc <UNXL.O>: up 17.1 pct at $0.89BUZZ-Uni-Pixel Inc: best day in nearly 1-1/2 years [nL3N1GZ454] ** Silver Wheaton Corp <SLW.N>: up 8.3 pct at $21.58 BRIEF-Silver Wheaton reports Q4 results, hikes dividend [nASB0B6FV] Silver Wheaton proposes changing name to Wheaton Precious Metals [nL2N1GY1YC] ** Regenxbio Inc <RGNX.O>: down 8.6 pct at $20.20BUZZ-Regenxbio Inc: Drops after stock offering prices [nL3N1GZ3TF] The 11 major S&P 500 sectors: Consumer Discretionary <.SPLRCD> down 0.15 pct Consumer Staples <.SPLRCS> down 0.24 pct Energy <.SPNY> down 0.13 pct Financial <.SPSY> down 0.31 pct Health <.SPXHC> down 0.10 pct Industrial <.SPLRCI> up 0.22 pct Information Technology <.SPLRCT> up 0.61 pct Materials <.SPLRCM> down 0.10 pct Real Estate <.SPLRCR> down 0.13 pct Teleservices <.SPLRCL> down 1.33 pct Utilities <.SPLRCU> up 0.38 pct (Compiled by Sruthi Shankar in Bengaluru; Editing by Savio D'Souza) ((sruthi.shankar@thomsonreuters.com; within U.S. +1 646 223 8780; outside U.S. +91 80 6749 6328; Reuters Messaging: sruthi.shankar.reuters.com@reuters.net)) Keywords: MARKETS USA STOCKS/PULSE</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.senecaglobe.com/active-volatile-stocks-nike-inc-nysenke-apple-inc-nasdaqaapl-cisco-systems-inc-nasdaqcsco/379742/&cid=52779425072711&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNGcL8Cc44MKf7JdJa9XC4QBYkySoQ\">Seneca Globe</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nActive Volatile Stocks- NIKE, Inc. (NYSE:NKE), Apple Inc. (NASDAQ:AAPL), Cisco ...\n", "text": "<p>NIKE, Inc. (NYSE:NKE) was among the mix trends movers as shares declined -1.14% to $58.01. Nike Inc. (NKE) reported that its fiscal Q3 profit of $1.14 billion. On a per-share basis, the Beaverton, Oregon-based company said it had net income of 68 cents. The results beat Wall Street expectations. The average estimate of 17 analysts surveyed by Zacks Investment Research was for earnings of 52 cents per share. The athletic apparel maker posted revenue of $8.43 billion in the period, falling short of Street forecasts. Twelve analysts surveyed by Zacks expected $8.45 billion. The stock outstanding shares were 1654.48. Having a prescribed look on price to sales ratio, that was 2.86, while price to earning ration of 25.60 attracting for long oriented investors.\n\nHow NIKE, Inc. dominated Wall Street through eye-catching trend? Read Considerable Report Here\n\nApple Inc. (NASDAQ:AAPL) declined turns in hot stance in regular session as it -1.15% to $139.84 in the session with shares volume of 39.45 Million. The Apple Store is down, and we know what that means. The Cupertino giant is all set to launch new products. Apple’s tradition has been to take down its online store ahead of major hardware product launches to ensure the site is properly updated with details of the new offerings.\n\nThat certainly appears to be the case right now, with the site now reading “We’ve got something special in store for you. And we can’t wait for you to see it. Please check back soon.” As for what Apple is expected to launch, that remains a little bit of a mystery. Past rumours indicate that Apple will launch a several products in March, specifically, a Red colour variant of the iPhone 7, a 128GB storage variant of the iPhone SE, and new iPad Pro models. The Company showed a positive 20.70% in the net profit margin and in addition to its operating margin which remained 27.10%.\n\nWhat made Apple Inc. to beat analysts’ forecasts in this rally? Find Out Here Totally Free\n\nShares of Cisco Systems, Inc. (NASDAQ:CSCO) fell -1.17% to finish at $33.88 in last run as Cisco Confirms Switches Exploited by CIA via CMP Flaw; Fix Coming Soon , Last week, WikiLeaks claimed that the CIA had exploited various apps, platforms, and devices unethically to spy on people. One of the affected tech companies was Cisco, whose switches were hacked by CIA to remotely exercise control.\n\nThe company has now confirmed that as many as 318 Cisco switches have a vulnerability that can allow the CIA to remotely execute malicious code and gain full control on the device. The company issued an advisory on the matter, and claimed that currently there are “no workaround that address this vulnerability,” but it’s looking to roll out a fix soon.\n\nCisco discovered the vulnerability in the Vault 7 dump by WikiLeaks. The advisory claims that the vulnerability is in the “Cisco Cluster Management Protocol (CMP) processing code in Cisco IOS and Cisco IOS XE Software, and it could allow an unauthenticated, remote attacker to cause a reload of an affected device or remotely execute code with elevated privileges.”\n\nLooking toward firm’s returns performance, it has return on equity of 15.50% and returns on assets was calculated 8.00% with 13.07% year to date performance. The annual sales growth for the past five year was 2.60%.\n\nHow Cisco Systems, Inc. attracted investors to get BUY rating after this bullish run? Read Considerable Report Here</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/news/earnings/17/03/9200786/8-stocks-to-watch-for-march-22-2017&cid=52779427992231&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNHTZfzYdIJTM6QxNrE71a7SHO6rlA\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\n8 Stocks To Watch For March 22, 2017\n", "text": "<p>Some of the stocks that may grab investor focus today are:\n\nWall Street expects Herman Miller, Inc. (NASDAQ: MLHR) to post quarterly earnings at $0.32 per share on revenue of $530.50 million after the closing bell. Herman Miller shares fell 0.51 percent to $29.10 in after-hours trading.\n\n(NASDAQ: MLHR) to post quarterly earnings at $0.32 per share on revenue of $530.50 million after the closing bell. Herman Miller shares fell 0.51 percent to $29.10 in after-hours trading. Analysts expect Winnebago Industries, Inc. (NYSE: WGO) to report quarterly earnings at $0.45 per share on revenue of $345.19 million before the opening bell. Winnebago shares rose 2.32 percent to $28.44 in after-hours trading.\n\n(NYSE: WGO) to report quarterly earnings at $0.45 per share on revenue of $345.19 million before the opening bell. Winnebago shares rose 2.32 percent to $28.44 in after-hours trading. Before the markets open, Amaya Inc. (NASDAQ: AYA) is estimated to report its quarterly earnings at $0.43 per share on revenue of $298.42 million. Amaya shares gained 0.62 percent to $15.44 in after-hours trading.\n\n(NASDAQ: AYA) is estimated to report its quarterly earnings at $0.43 per share on revenue of $298.42 million. Amaya shares gained 0.62 percent to $15.44 in after-hours trading. Nike Inc (NYSE: NKE) reported upbeat earnings for its third quarter, while sales missed estimates. Nike shares dropped 3.71 percent to $55.86 in the after-hours trading session.\n\nFind out what's going on in today's market and bring any questions you have to Benzinga's PreMarket Prep.\n\nAnalysts are expecting Perry Ellis International, Inc. (NASDAQ: PERY) to have earned $0.60 per share on revenue of $229.64 million in the latest quarter. Perry Ellis will release earnings before the markets open. Perry Ellis shares gained 1.67 percent to $23.20 in after-hours trading.\n\n(NASDAQ: PERY) to have earned $0.60 per share on revenue of $229.64 million in the latest quarter. Perry Ellis will release earnings before the markets open. Perry Ellis shares gained 1.67 percent to $23.20 in after-hours trading. After the markets close, Cintas Corporation (NASDAQ: CTAS) is projected to post its quarterly earnings at $1.07 per share on revenue of $1.28 billion. Cintas shares rose 0.02 percent to $123.80 in after-hours trading.\n\n(NASDAQ: CTAS) is projected to post its quarterly earnings at $1.07 per share on revenue of $1.28 billion. Cintas shares rose 0.02 percent to $123.80 in after-hours trading. FedEx Corporation (NYSE: FDX) reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17. FedEx shares rose 2.06 percent to $195.80 in the after-hours trading session.\n\n(NYSE: FDX) reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17. FedEx shares rose 2.06 percent to $195.80 in the after-hours trading session. Analysts expect PVH Corp (NYSE: PVH) to post quarterly earnings at $1.19 per share on revenue of $2.09 billion after the closing bell. PVH shares declined 1.59 percent to $91.21 in after-hours trading.\n\nPosted-In: Stocks To WatchEarnings News Guidance Pre-Market Outlook Markets Trading Ideas\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://www.investopedia.com/news/ubs-nike-will-get-darker-dawn/?utm_campaign=quote-bloomberg&utm_source=bloomberg&utm_medium=referral&utm_term=fb-capture&utm_content=/#ec|rss-bloomberg\">investopedia</a>"}, "start_date": {"hour": 21, "month": 3, "second": 0, "year": 2017, "day": 23, "minute": 12}, "end_date": {}, "text": {"headline": "UBS on Nike: Will ‘Get Darker Before the Dawn’", "text": "<p>Nike Inc. (NKE) saw its shares plummets on its latest quarterly earnings report in which revenue numbers failed to meet the consensus estimate.\n\nDespite posting earnings above expectations in the most recent fiscal third quarter, Nike’s future orders at negative 4% marked the the first time the metric has been negative in seven years. The forward indicator discouraged investors, selling of the stock now down about 5% since the prior to the Q3 report posted on March 21. (See also: Nike Posts Mixed Q3, Stock Falls.)\n\nFutures and Revenues Will Remain Less Correlated\n\nAnalysts see the next fiscal year as a “rebase year” while Nike shifts from wholesale to building out its direct-to-consumer infrastructure and ecommerce presence, reports Business Insider. This journey will be a rough one for the athletic apparel and footwear manufacturer, indicates UBS analysts in a recent research note to clients, which stated “it’s going to get darker before the dawn.” However, UBS says Nike’s new focus away from wholesale with traditional retail clients will make metrics such as futures less of a key indicator. “We think there’s truth to comments that futures and revenues will remain less correlated as [Nike] rolls out product with lead-time of less than 3 months,\" said UBS.\n\nAnalysts expect the overall retail climate to act as a headwind as Nike evolves its business. Data from NPD Group shows total athletic footwear sales down 14% year over year (YOY) in February, including declines in running and classics categories which have been relatively strong in the past. At the further expense of Nike’s sales is the revival of Adidas AG (ADDYY) in the U.S. market, as the German-based company saw its shares hit a record high on a fresh quarterly earnings beat.\n\nDespite industry headwinds and heightened competitive pressure, analysts remain optimistic on prospects for Nike’s turnaround in the next couple of quarters. The Beaverton, Ore.-based company will likely double down on innovation, speed up product to market time, and improve its distribution outside traditional retailers in order to remain at the head of the global industry. (See also: Adidas Shares Hit All-Time High.)</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://timesofindia.indiatimes.com/business/international-business/nike-inc-brokerages-cut-pts-after-q3-revenue-miss-drop-in-orders/articleshow/57778878.cms&cid=0&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNEqMdK6ucg5t_2sP3YxWJ3LpoJepg\">Times of India</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nNike Inc: Brokerages cut PTs after Q3 revenue miss, drop in orders\n", "text": "<p>(Updates)\n\n** World's largest footwear maker's shares down as much as 6.5 pct to $54.23; Biggest intraday pct fall in 18 months\n\n** Deutsche Bank cuts PT to $64 from $66, FBR cuts to $53 from $55 after NKE reports lower-than-expected Q3 revenue, surprise drop in futures orders on Tuesday\n\n** \"Given cautious commentary on the North America marketplace, we are tempering our gross margin forecast and weighting revenue growth further to 2H\" - Deutsche Bank\n\n** However, brokerage Susquehanna raises PT to $65 from $64, Citigroup raises to $66 from $60 and DA Davidson raises to $70 from $64\n\n** \"While we are disappointed in ongoing gross margin pressure and a steeper FX hit to EPS in FY18, we are encouraged by NKE's product innovation pipeline (four new cushioning platforms), SG&A discipline, and continued DTC success\" - DA Davidson\n\n** Of 34 analysts covering the stock, 22 have \"buy\" or higher ratings, 11 \"hold\" and 1 \"sell\"; Median PT $62.50\n\n** Up to Tuesday's close, stock had fallen 10.4 pct in the last 12 months, compared with a 10.6 pct increase in the S&P 500 Consumer Discretionary index</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.wsnews4investors.com/2017/03/22/noteworthy-active-stock-to-observe-nike-inc-s-nke-stock-price-finalizes-at-58-01-while-14508898-shares-change-at-hands/&cid=52779433151545&ei=4g3WWMnANorKuASN0LDAAw&usg=AFQjCNEKicDdpCuJyf78ewF6KhtBPkEcyA\">WsNews 4investors</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nNoteworthy Active Stock To Observe: NIKE, Inc.'s (NKE) stock price finalizes ...\n", "text": "<p>NIKE, Inc. (NKE) stock price distance from twenty day simple moving average surged at 1.31% while its distance from fifty day simple moving average raised 5.23% along with 7.61% above distance from two hundred simple moving averages. On technical aspect, moving averages may help to distinguish path of dispositions, and they may also be used to set degrees of support and resistance. Tracking the stock price in relation to moving averages as well as highs and lows for the year might assist with evaluating future stock performance.\n\nNIKE, Inc. (NKE) stock price tumbled -1.14% to finalize at $58.01 throughout previous buying and selling session. A total of 14.51 million shares exchanged at hands and its average trading volume is standing at 9.1 million shares.\n\nTaking a glance at past performance, we will examine different up or down moving trends about NKE. The stock added 1.27% beyond one week and climbed 2.54% during previous one month session. The stock went up 14.28% at some stage in past quarter. Inside the closing six months period the stock’s performance raised 6.28% while overall yearly performance lost -9.25%. The Company’s year to date (YTD) performance is now positive at 14.48%.\n\nImportant factors to focus when evaluating a stock’s present and future value are the 52 week price high and low levels. Shares of NIKE, Inc. (NKE) are trading -10.25% downward from the 52-week high mark and 19.16% above from the fifty two-week low mark.\n\nWhile taking a look at financials, we can look at a number of key indicators about NIKE, Inc. (NKE) . Average true range (ATR-14) of the company is at 0.93. Developed by J. Welles Wilder, ATR is an indicator that measures volatility. A stock experiencing a high level of volatility has a higher ATR, and a low volatility stock has a lower ATR. It may be used by market technicians to enter and exit trades, and it is a useful tool to add to a trading system.\n\nThe Stock has Weekly volatility of 1.69% and monthly volatility of 1.56%. Tracking most recent quarter period, Price to book (P/B) ration is at 7.81 and Price to cash per share ration is at 15.70. Beta value of the stock is marked at 0.47. A beta of less than 1 means that the security will be less volatile than the market. A beta of greater than 1 indicates that the security’s price will be more volatile than the market. The company has a Return on Assets (ROA) of 18.00%. Presently, it has a Return on Equity (ROE) of 31.70% and Return on Investment (ROI) of 25.50%.\n\nRelative strength index (RSI-14) for NIKE, Inc. (NKE) is at 62.27. In phrases of Market analysis and buying and selling signals, RSI moving above the horizontal 30 reference standard is regarded as a bullish indicator, at the same time as the RSI transferring under the horizontal 70 reference standard is visible to be a bearish indicator. Movements above 70 are interpreted as indicating overbought conditions; conversely moves underneath 30 notify oversold conditions.\n\nThe company’s quick ratio for most recent quarter is 2.10. Its price to free cash flow for trailing twelve months is 35.49 and Current ratio for most recent quarter of 3.10. Total debt to equity ratio of the company for most recent quarter is 0.29 while Long term debt to equity ratio for same time period is 0.28.\n\nOne Month Ago Analyst Ratings: NIKE, INC. (NKE) has received mean Analyst rating of 2.08 from polled analysts at Reuters One Month Ago. It has been suggested as “Buy Opinions” from 12 and 0 issued “Sell Thoughts” for the stock. 11 rated the company as a “Hold”. “Outperform View” rating was revealed by 11 and “Underperform Signal” rating was issued by 2. Should an investor react accordingly to new analyst’s recommendations and adjust a position based on the analyst’s rating alone Of course not. The research report and subsequent rating should be used to complement individual homework and strategy. If you are investing like Buffett, the report can assist in finding the company with the durable competitive advantage, and if Peter Lynch is your hero, you might find a low P/E ratio, share buyback or future earnings growth in the depths of the report.</p>"}}]}