{"events": [{"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://nystocknews.com/2017/03/22/the-goldman-sachs-group-inc-gs-and-its-technical-chart-creates-a-compelling-picture/&cid=52779436404311&ei=FvfVWNmDEZLYuASynZrgBg&usg=AFQjCNH8FDHLOzvjyoIAEbtLE3TZsVQf8A\">NY Stock News</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nThe Goldman Sachs Group, Inc. (GS) And Its Technical Chart Creates A ...\n", "text": "<p>The Goldman Sachs Group, Inc. (GS) has created a compelling message for traders in the most recent trading. That message has grown stronger as the technical chart setup has developed into a more composite picture for the stock. This is the breakdown as we see it. The technical chart doesn’t get the respect it deserves and it’s a shame, really. So many fortunes have been built upon an understanding, and use of a technical chart that it is almost unfathomable that some traders would ignore its power.\n\nThe 50 and 200 SMAs for GS have created a marked trend which is now helping traders to make solid decisions regarding the stock. It’s a trend that is now unmistakable. Based on the trend levels presented by both indicators, the overall sentiment towards GS is best described as bullish. This trend has created a unified opinion across the trading floor and it is clear that the overall outlook for the stock is now established as positive. But it’s not just the outlook that’s being affected for the stock. Thanks to the consolidated opinion on GS, activity has also seen a pronounced trend. Under current sentiments the volume activity and subsequent trend has created a weak outlook from buyers and sellers. Sentiments have a tendency to either weaken or strengthen as other technical factors begin to influence overall outlook. It’s interesting to see how things are playing out for GS. It is unsurprising in the case of GS, that the current trend has created some indifference among traders regarding the stock. In terms of consistency, it is clear that both the 50 and 200 SMAs have done their job in bring traders the overall trend-picture currently being seen for GS.\n\nThere is of course more to the tale than just what the SMAs have presented. For those added details, we can take a look at the Relative strength indicator (RSI) and Stochastic measures, both of which give deeper insights into the overall sentiment of buyers and sellers. SMAs will tell alert you to price direction, but when it comes to judging what buyers and sellers are doing, few indicators are better than RSI and the Stochastic. It as this level of technical data that a trader can determine whether a stock is currently overbought is oversold. The current picture for GS is of course very telling based on these two additional measures. Based on current readings, GS’s 14-day RSI is 28.41%. Taken on the standard scale of measurement for RSI, this suggests that GS is currently oversold, suggesting that the stock may have hit a floor and could potentially see an uptick. The stochastic reading offers another solid measure of whether the stock is either overbought, or oversold. In the case of GS, Stochastic readings gathered over the last 30 days have created a score of 2.07%. This suggests GS is oversold at current levels.\n\nSMAs and RSI, though not mythological narrations of a stock’s power or stranding, can sometimes provide the clarity needed to make decisions. But those decisions might be half-formed due to a lacking of all the pertinent information. This is where broadening the analysis can really help. By this point in the analysis of GS, it is clear that other technical indicators are saying essentially the same things. Specifically the -18.76 has birthed a negative overall sentiment when measured over the previous 30 days or so of trading. Over the longer-term GS has outperform the S&P 500 by 34.61. This has, unsurprisingly, created higher volatility levels when compared with similar stocks of the same grade and class. Historical volatility is no less consistent. The historical volatility picture for GS is shown in the reading of 17.47%. GS has clearly shown its full hand by the overall input of these technical indicators. But there is one final measure that when added to the already rich mix, shows in full color what GS is doing. The indicator is the Average True Range, and based on the current 1.74 reading, GS is certainly worth paying attention to.\n\nGS couldn’t be clearer in terms of the kind of action required in light of the picture shown by its technical indicators.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"https://www.bloomberg.com/news/articles/2017-03-23/goldman-said-to-shut-london-equity-fund-move-mahindru-to-nyc\">bloomberg</a>"}, "start_date": {"hour": 16, "month": 3, "second": 53, "year": 2017, "day": 23, "minute": 35}, "end_date": {}, "text": {"headline": "Goldman Said to Shut London Equity Fund, Move Mahindru to NYC", "text": "<p>Goldman Sachs Group Inc.’s Suneil Mahindru, head of international stock investing, is relocating to the U.S. from London after the firm decided to close a European-equities investment fund, according to a person with knowledge of the matter.\n\nMahindru, a managing director in the asset-management unit, and some people on his team will have desks on the division’s newly designed third floor at the bank’s New York headquarters, the person said. Some team members, who number fewer than 10, may stay in London, switch groups or leave the firm, the person said. Andrew Williams, a company spokesman, declined to comment.\n\nThe most important market news of the day. Get our markets daily newsletter.\n\nGoldman Sachs is shuttering the Europe Equity Partners fund after it failed to attract enough assets, and other similar strategies proved more popular, said the person, who asked not to be identified because the moves haven’t been announced publicly. The fund managed 366 million euros ($395 million) of assets at the end of February, according to a performance summary. Counting money held in separately managed accounts, the strategy managed about 3 billion euros, the person said.\n\nMahindru manages about $13 billion in non-U.S. stocks, part of the $80 billion managed by the firm’s fundamental equities group. Goldman Sachs will continue to invest in European stocks through its Global Equity Partners fund, as well as the Europe CORE Equity Portfolio, which has a five-star rating from Morningstar.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.thecerbatgem.com/2017/03/22/novartis-ag-nvs-receives-neutral-rating-from-goldman-sachs-group-inc.html&cid=52779426820045&ei=FvfVWNmDEZLYuASynZrgBg&usg=AFQjCNHbfrxDO34qJosFNkB8ydNdkjl-ug\">The Cerbat Gem</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nNovartis AG (NVS) Receives Neutral Rating from Goldman Sachs Group Inc\n", "text": "<p>Novartis AG (NYSE:NVS)‘s stock had its “neutral” rating reaffirmed by analysts at Goldman Sachs Group Inc in a report issued on Wednesday.\n\nA number of other brokerages have also recently commented on NVS. Vetr upgraded Novartis AG from a “hold” rating to a “buy” rating and set a $79.30 target price for the company in a report on Wednesday, March 1st. JPMorgan Chase & Co. reiterated a “neutral” rating on shares of Novartis AG in a report on Tuesday, March 14th. BNP Paribas cut Novartis AG from a “neutral” rating to an “underperform” rating in a report on Tuesday, March 7th. Societe Generale upgraded Novartis AG from a “hold” rating to a “buy” rating and lifted their target price for the stock from $73.82 to $74.37 in a report on Tuesday, March 7th. Finally, Barclays PLC assumed coverage on Novartis AG in a report on Tuesday, March 7th. They issued an “underweight” rating for the company. Three investment analysts have rated the stock with a sell rating, ten have assigned a hold rating, five have assigned a buy rating and one has issued a strong buy rating to the company’s stock. The company presently has a consensus rating of “Hold” and a consensus target price of $85.73.\n\nShares of Novartis AG (NYSE:NVS) traded down 0.11% during midday trading on Wednesday, reaching $74.31. The company had a trading volume of 1,438,026 shares. Novartis AG has a 1-year low of $66.93 and a 1-year high of $83.58. The stock has a market capitalization of $176.42 billion, a price-to-earnings ratio of 26.54 and a beta of 0.73. The firm’s 50 day moving average price is $75.37 and its 200-day moving average price is $74.30.\n\nNovartis AG (NYSE:NVS) last announced its earnings results on Wednesday, January 25th. The company reported $1.12 EPS for the quarter, hitting the Zacks’ consensus estimate of $1.12. The firm earned $12.32 billion during the quarter, compared to analysts’ expectations of $12.44 billion. Novartis AG had a return on equity of 15.37% and a net margin of 13.80%. The company’s quarterly revenue was down 1.6% on a year-over-year basis. During the same quarter in the previous year, the business earned $1.14 EPS. Equities research analysts expect that Novartis AG will post $4.70 EPS for the current fiscal year.\n\nThe firm also recently declared an annual dividend, which was paid on Friday, March 3rd. Investors of record on Friday, March 3rd were paid a dividend of $2.327 per share. The ex-dividend date of this dividend was Wednesday, March 1st. Novartis AG’s dividend payout ratio is currently 82.14%.\n\nYour IP Address:\n\nSeveral large investors have recently modified their holdings of the company. Sowell Financial Services LLC acquired a new stake in shares of Novartis AG during the fourth quarter worth about $116,000. Zions Bancorporation raised its stake in shares of Novartis AG by 21.0% in the fourth quarter. Zions Bancorporation now owns 1,656 shares of the company’s stock worth $120,000 after buying an additional 287 shares in the last quarter. Mosaic Family Wealth LLC raised its stake in shares of Novartis AG by 11.2% in the third quarter. Mosaic Family Wealth LLC now owns 1,886 shares of the company’s stock worth $149,000 after buying an additional 190 shares in the last quarter. First PREMIER Bank raised its stake in shares of Novartis AG by 65.7% in the third quarter. First PREMIER Bank now owns 1,955 shares of the company’s stock worth $154,000 after buying an additional 775 shares in the last quarter. Finally, Integrated Wealth Counsel LLC raised its stake in shares of Novartis AG by 13.8% in the third quarter. Integrated Wealth Counsel LLC now owns 1,998 shares of the company’s stock worth $158,000 after buying an additional 242 shares in the last quarter. 9.82% of the stock is owned by hedge funds and other institutional investors.\n\nAbout Novartis AG\n\nNovartis AG is a holding company, which provides healthcare solutions. The Company is engaged in the research, development, manufacturing and marketing of a range of healthcare products led by pharmaceuticals. The Company’s segments include Innovative Medicines, Sandoz, Alcon and Corporate activities.\n\nReceive News & Stock Ratings for Novartis AG Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Novartis AG and related stocks with our FREE daily email newsletter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.chaffeybreeze.com/2017/03/22/goldman-sachs-group-inc-reaffirms-sell-rating-for-tesla-inc-tsla.html&cid=52779432852614&ei=FvfVWNmDEZLYuASynZrgBg&usg=AFQjCNFpMfCD4B01IdSaMkkq4HHY_agL3Q\">Chaffey Breeze</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nGoldman Sachs Group Inc Reaffirms “Sell” Rating for Tesla Inc (TSLA)\n", "text": "<p>Goldman Sachs Group Inc reiterated their sell rating on shares of Tesla Inc (NASDAQ:TSLA) in a research report report published on Friday morning. The brokerage currently has a $187.00 price objective on the electric vehicle producer’s stock, up from their previous price objective of $185.00.\n\nTSLA has been the topic of a number of other research reports. Robert W. Baird reissued an outperform rating and issued a $338.00 price target on shares of Tesla in a research note on Thursday, January 5th. Cowen and Company reissued an underperform rating and issued a $155.00 price target (down previously from $160.00) on shares of Tesla in a research note on Sunday, December 4th. Global Equities Research reissued an overweight rating and issued a $385.00 price target on shares of Tesla in a research note on Tuesday, December 6th. Vetr raised shares of Tesla from a hold rating to a buy rating and set a $197.97 price target on the stock in a research note on Tuesday, November 29th. Finally, TheStreet raised shares of Tesla from a d+ rating to a c- rating in a research note on Wednesday, January 25th. Eight equities research analysts have rated the stock with a sell rating, eleven have issued a hold rating and twelve have issued a buy rating to the company’s stock. The stock has a consensus rating of Hold and an average price target of $254.69.\n\nShares of Tesla (NASDAQ:TSLA) opened at 250.68 on Friday. The stock has a 50 day moving average of $258.45 and a 200 day moving average of $219.47. Tesla has a 52 week low of $178.19 and a 52 week high of $287.39. The stock’s market cap is $40.53 billion.\n\nTesla (NASDAQ:TSLA) last released its quarterly earnings results on Wednesday, February 22nd. The electric vehicle producer reported ($0.69) earnings per share (EPS) for the quarter, missing analysts’ consensus estimates of ($0.43) by $0.26. Tesla had a negative net margin of 14.74% and a negative return on equity of 29.17%. The company earned $2.29 billion during the quarter, compared to analyst estimates of $2.21 billion. During the same period in the prior year, the business posted ($0.87) EPS. Tesla’s revenue was up 88.2% compared to the same quarter last year. On average, analysts expect that Tesla will post ($1.42) earnings per share for the current year.\n\nYour IP Address:\n\nIn other Tesla news, CEO Elon Musk purchased 95,420 shares of the business’s stock in a transaction on Friday, March 17th. The shares were bought at an average cost of $262.00 per share, for a total transaction of $25,000,040.00. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website. Also, Director Antonio J. Gracias sold 5,600 shares of the business’s stock in a transaction dated Wednesday, January 25th. The stock was sold at an average price of $254.37, for a total transaction of $1,424,472.00. Following the sale, the director now owns 5,600 shares in the company, valued at $1,424,472. The disclosure for this sale can be found here. Insiders have sold 14,700 shares of company stock worth $3,610,196 over the last quarter. Insiders own 27.70% of the company’s stock.\n\nA number of hedge funds have recently modified their holdings of the company. Advisory Services Network LLC raised its stake in shares of Tesla by 14.5% in the third quarter. Advisory Services Network LLC now owns 489 shares of the electric vehicle producer’s stock worth $100,000 after buying an additional 62 shares during the period. Reilly Financial Advisors LLC increased its position in shares of Tesla by 92.9% in the third quarter. Reilly Financial Advisors LLC now owns 492 shares of the electric vehicle producer’s stock worth $100,000 after buying an additional 237 shares in the last quarter. Independent Advisor Alliance bought a new position in shares of Tesla during the fourth quarter worth approximately $102,000. Parallel Advisors LLC bought a new position in shares of Tesla during the fourth quarter worth approximately $104,000. Finally, Cable Hill Partners LLC increased its position in shares of Tesla by 36.1% in the third quarter. Cable Hill Partners LLC now owns 693 shares of the electric vehicle producer’s stock worth $139,000 after buying an additional 184 shares in the last quarter. Institutional investors own 57.29% of the company’s stock.\n\nAbout Tesla\n\nTesla, Inc, formerly Tesla Motors, Inc, designs, develops, manufactures and sells electric vehicles and energy storage products. The Company produces and sells two electric vehicles: the Model S sedan and the Model X sport utility vehicle (SUV). The Company has delivered over 107,000 Model S vehicles across the world.\n\nReceive News & Ratings for Tesla Inc Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla Inc and related companies with MarketBeat.com's FREE daily email newsletter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.theusacommerce.com/2017/03/22/the-goldman-sachs-group-inc-gs-checking-the-chart/&cid=52779433295724&ei=FvfVWNmDEZLYuASynZrgBg&usg=AFQjCNF1fyLbDFIsw4Zz3Xk25atdb3rftw\">The USA Commerce</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nThe Goldman Sachs Group, Inc. (GS) : Checking the Chart\n", "text": "<p>We have gathered the technical data on The Goldman Sachs Group, Inc. (GS), and see some interesting trends in the stock’s behavior of late. In the end, it’s all about what a stock does that matters. In the case of this particular stock, the chart tells quite a story at present.\n\nGS has been trading in a bearish trend, based on the relative levels of its 50-day and 200-day simple moving averages. This suggests that the broad sum of capital flow in the stock has been generally negative over the recent period. In terms of the relative level of interest afforded this stock among active participants in the market, relative volume measures have been weak, indicating apathy for the name by traders, investors, and money managers during the past month of action. This suggests something of the significance of other current technical measures as well.\n\nFor market timers, it’s also important to take measure of the relative level of recent lift or pressure in the stock is it overbought or oversold? For that, we turn to RSI and stochastic measures. The 14-day RSI stands at 28.41%. That shows that the stock, according to a traditional interpretation and usage of the RSI indicator, is becoming oversold or undervalued, and therefore may be ready for a trend change or corrective price reversal to the upside If we look at the stochastic measure, the raw data over the stock’s last month of action shows a score of 2.07%. Based on a raw data interpretation, this perspective doesn’t suggest either an overbought or oversold condition.\n\nAs professionals know, risk is best understood through a measure of volatility in an investment vehicle. In recent action, GS has made a move of -18.76 over the past month. Over the trailing year, the stock is outperforming the S&P 500 by 32.55%, and it’s gotten there by action that has been more volatile on a day-to-day basis than most other stocks on the exchange. The stock’s recent movement has come on a historical volatility score of 17.47%, which represents the standard deviation of returns of a theoretical long position from a mean price during that period. On a daily basis over the past month, the average true range of the stock, as expressed in percentage terms, is 1.7%. That should give you a pretty good sense of the level of risk implied in a short-term trading approach in the stock with a stop-loss in place.\n\nAs it stands at present, the stock might find important action at key Fibonacci levels. Fibonacci levels are used by major Wall Street firm technical desks. The math is drawn from the Fibonacci series that defines growth systems by an interval increase characterized by steps divisible by the “golden ratio” of 61.8%. In this case, the critical 38.2% level drawn off the 52-weeklow of $136.88 sits at $182.06. GS also has additional support below at the stock’s 200-day simple moving average, which sits at $195.75.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.chaffeybreeze.com/2017/03/22/goldman-sachs-group-inc-reiterates-buy-rating-for-asos-plc-asc.html&cid=52779430195114&ei=FvfVWNmDEZLYuASynZrgBg&usg=AFQjCNFrMYKlqwejsp1PQAJzTvN1ZjR_1A\">Chaffey Breeze</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nGoldman Sachs Group Inc Reiterates “Buy” Rating for ASOS plc (ASC)\n", "text": "<p>ASOS plc (LON:ASC)‘s stock had its “buy” rating reissued by stock analysts at Goldman Sachs Group Inc in a report issued on Monday. They currently have a GBX 5,800 ($71.63) price objective on the stock. Goldman Sachs Group Inc’s price target suggests a potential downside of 0.57% from the stock’s current price.\n\nSeveral other research analysts have also recently commented on the stock. Deutsche Bank AG restated a “hold” rating on shares of ASOS plc in a research report on Tuesday, January 3rd. HSBC Holdings plc reaffirmed a “hold” rating and issued a GBX 5,290 ($65.33) price target on shares of ASOS plc in a research note on Tuesday, January 3rd. Berenberg Bank upped their price target on shares of ASOS plc from GBX 5,100 ($62.99) to GBX 6,500 ($80.28) and gave the stock a “buy” rating in a research note on Thursday, November 24th. Peel Hunt reaffirmed a “buy” rating and issued a GBX 5,800 ($71.63) price target on shares of ASOS plc in a research note on Friday, January 13th. Finally, BNP Paribas reaffirmed an “outperform” rating and issued a GBX 6,300 ($77.81) price target on shares of ASOS plc in a research note on Friday, December 2nd. One investment analyst has rated the stock with a sell rating, seven have assigned a hold rating and thirteen have given a buy rating to the company’s stock. The company presently has a consensus rating of “Buy” and an average target price of GBX 5,372.22 ($66.35).\n\nShares of ASOS plc (LON:ASC) opened at 5826.00 on Monday. The stock’s market capitalization is GBX 4.84 billion. ASOS plc has a 1-year low of GBX 3,020.00 and a 1-year high of GBX 5,966.00. The firm has a 50-day moving average of GBX 5,427.57 and a 200 day moving average of GBX 5,108.34.\n\nYour IP Address:\n\nIn related news, insider Nicholas Robertson sold 300,000 shares of the stock in a transaction that occurred on Wednesday, January 25th. The shares were sold at an average price of GBX 5,175 ($63.91), for a total transaction of £15,525,000 ($19,173,768.06).\n\nAbout ASOS plc\n\nAsos PLC is a global fashion destination for a range of things. The Company sells and offers a range of fashion-related content on ASOS.com. The Company’s segments include UK, US, EU and RoW. It sells over 85,000 branded and own-label products through localized mobile and Web experiences, delivering from its fulfilment centers in the United Kingdom, the United States, Europe and across the world.\n\nReceive News & Ratings for ASOS plc Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for ASOS plc and related companies with MarketBeat.com's FREE daily email newsletter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://www.investopedia.com/news/goldman-t-rowe-price-target-average-investors-robos/?utm_campaign=quote-bloomberg&utm_source=bloomberg&utm_medium=referral&utm_term=fb-capture&utm_content=/#ec|rss-bloomberg\">investopedia</a>"}, "start_date": {"hour": 10, "month": 3, "second": 0, "year": 2017, "day": 24, "minute": 0}, "end_date": {}, "text": {"headline": "Goldman, T. Rowe Price Target Average Investors With Robo-Advisors", "text": "<p>Goldman Sachs Group, Inc. (GS) and mutual fund giant T. Rowe Price (TROW) both plan to offer automated investment platforms for their clients, making themselves the latest entrants into the robo-advisor arena. They join other firms that have recently rolled out robo-advisor platforms such as Merrill Lynch with its Merrill Edge automated investment service.\n\nT. Rowe Price's ActivePlus Portfolios platform will only use actively-managed funds, and there is no fee for the service. Clients will simply pay the investment management fees charged by the underlying funds in the program. The new service will initially only be available to IRA clients who have a balance of at least $50,000. The investment portfolios that are created in the program will use between eight and 13 of the company's mutual funds in order to provide a broad measure of diversification. Also, T. Rowe Price's robo-model contains a human element with its licensed client managers who are available for clients who need advice or assistance with complex issues.\n\nAlthough Goldman Sachs has not made any official announcement of plans to roll out a robo-advisor platform, the firm has been advertising for employees who can help to build such a platform in its online job listings. The move signals a slight change in the direction the company is headed, as it seeks to expand its client base outside of the super-wealthy and penetrate the mass affluent market – current and potential customers with less than $1 million in investable assets. Its job ad states that the new automated service would be a part of the bank's investment management division.\n\nGoldman Sachs and T. Rowe Price will soon be followed by other firms such as Wells Fargo & Co. (WFC) and Raymond James, which are also planning on offering automated investment services to their clients. Morgan Stanley (MS) will roll out its robo-platform later this year. (For related reading, see: Citi's New Strategy for Wealthy Clients.)</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"https://www.bloomberg.com/news/articles/2017-03-23/goldman-bny-mellon-bow-to-investor-pressure-on-gender-pay-gap\">bloomberg</a>"}, "start_date": {"hour": 21, "month": 3, "second": 44, "year": 2017, "day": 23, "minute": 3}, "end_date": {}, "text": {"headline": "Goldman, BNY Mellon Bow to Investor Pressure on Gender Pay", "text": "<p>An activist shareholder says it has persuaded Goldman Sachs, BNY Mellon and three telecommunications companies to “take proactive steps” to address the disparities in men’s and women’s compensation, avoiding a shareholder vote on the issue.\n\nPax World Management, which oversees about $4.1 billion, had filed proposals asking the two banks, along with Verizon, AT&T and Qualcomm, to disclose what’s known as pay-gap data and to work toward parity. Pax withdrew the proposals after all five agreed to take steps to address pay inequities, though none committed to the specific requests to make public the data or to close the gaps.\n\n“This is a process,” said Heather Smith, lead sustainability research analyst at Portsmouth, New Hampshire-based Pax. “We don’t expect our work to stop here. We will be continuing our conversations with these and other companies.”\n\nFollowing Pax’s proposals, three of the companies -- Bank of New York Mellon Corp., Verizon Communications Inc. and Qualcomm Inc. -- released statements outlining their commitments to pay parity and explaining how they will monitor it. Goldman Sachs Group Inc. agreed to enhance pay equity disclosures in a report this spring, Smith said. Fletcher Cook, a spokesman for AT&T, said the company had signed the White House Equal Pay Pledge last year, reinforcing “what we already deliver to our employees: equal pay for comparable work, experience and performance.”\n\nOther finance companies are resisting similar pressure from Boston-based Arjuna Capital. At 2017 annual meetings, shareholders at Wells Fargo & Co., Citigroup Inc., American Express Co. and Bank of America Corp. will vote on measures asking the companies to issue reports examining gender-pay gaps and their efforts to ensure parity.\n\nAll four have advised investors to reject the proposals, arguing that they already have strong records on hiring, paying and promoting women. None make public any examination of gender-pay gaps or efforts to ensure pay parity, according to Natasha Lamb, managing director at Arjuna.\n\nThe most important business stories of the day. Get Bloomberg's daily newsletter.\n\nLamb said the companies she engaged with had offered similar responses to those Pax received, but Arjuna didn’t withdraw its proposals. “It is not sufficient,” she said. “We expect the same level of reporting as the tech companies gave in 2016. That means reporting the percentage gap and committing to close it.” Last year, Arjuna made equal pay proposals at nine tech companies, seven of which -- including Intel Corp. and Apple Inc. -- agreed to make the data public and close the gaps.\n\nThe gender-pay gap has become an important metric for investors and others who are concerned about increasing opportunity for women in finance. While women represent about half of the workforce of the 23 banks with market capitalization of greater than $25 billion, they make up only about 21 percent of their executive ranks, according to Bloomberg data.\n\nThe finance industry also has one of the largest pay disparities, according to a survey by job site Glassdoor.com. Men who work at financial services firms on average earn 6.4 percent more than women, after controlling for job title and responsibilities. The gap at technology companies, for example, is 5.9 percent.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.benchmarkmonitor.com/the-goldman-sachs-group-inc-nysegs-and-morgan-stanley-executives-preparing-to-shift-staff/197071&cid=52779435163226&ei=FvfVWNmDEZLYuASynZrgBg&usg=AFQjCNGIMaMr2mAVfJ4blAC7sd042-h8aA\">Benchmark Monitor</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nThe Goldman Sachs Group, Inc. (NYSE:GS) and Morgan Stanley executives ...\n", "text": "<p>Senior The Goldman Sachs Group, Inc. (NYSE:GS) and Morgan Stanley executives said they’re preparing to shift staff and operations from London to elsewhere in the European Union as Prime Minister Theresa May sets up the U.K.’s exit from the bloc. A day after May’s office announced she will open two years of divorce talks with the EU on March 29, Richard Gnodde, co-head of investment banking at Goldman Sachs, told CNBC on Tuesday that his bank will initially relocate hundreds of London-based employees to expand other offices after the split. The Goldman Sachs Group, Inc. (NYSE:GS) shares went down -3.77% to $233.00 on Tuesday.\n\nTechnical Stock Analysis\n\nShares outstanding are recorded as 398.38M and total shares floated are 390.16M. Company’s distance from 20 day simple moving average is -6.45% and distance from 50-Day simple moving average is -4.14%.\n\nBest time to invest in stock market is when things are on odd side, and it’s not easy how to pick stocks. By reviewing stock prices from the stock market history of the company and examining its analysts ratings can give an investment picture with updated information of stock which helps investors to make investing decision. Stock has got OUTPERFORM rating from 11 analysts of Thomson Reuters, 13 analysts given HOLD rating to the stock and 1 given UNDERPERFORM rating. Analyst’s mean target price for GS is $249.68 while analysts mean recommendation is 2.60.\n\nThe Goldman Sachs Group, Inc. (NYSE:GS) yearly performance is 51.14% and net profit margin is 18.70%. Annual EPS Growth of past 5 years is 29.30%. Company price to earnings (P/E) ratio, which measures the relationship between the earnings of a company and its stock price, is calculated as 14.24. The current share price indicate that stock is -8.68% away from its one year high and is moving 70.22% ahead of its 52-week low.\n\nOn 21 March 2017, Advanced Energy Industries, Inc. (NASDAQ:AEIS) shares moved to $65.50 after starting the day at $70.00. Stock has got OUTPERFORM rating from 2 analysts of Thomson Reuters, 5 analysts given HOLD rating to the stock. Analyst’s mean target price for AEIS is $64.60 while analysts mean recommendation is 2.50.\n\nTata Motors Limited (NYSE:TTM) announced the commencement of pre-bookings for the Tata Tigor across all authorised dealership with a booking amount of Rs 5,000. This comes as the company will launch sub-compact sedan later this month. The Tigor is the rechristened version of the Kite 5 concept car which was first showcased at the Autoexpo 2016.\n\nAt the movement Tata Motors Limited (NYSE:TTM) is under coverage by number of analysts. Buy rating has been given by 2 analysts to the company stock. The consensus recommendation by Thomson Reuters analysts is Buy and their mean rating for the stock is 1.00 on scale of 1-5. Analysts mean target price for Tata Motors Limited (NYSE:TTM) is $45.00 while their mean recommendation is 1.00 (1=Buy, 5=sell).\n\nIf we look at stock performance in last active day trading, we see that stock has moved went down -2.35% to end the day at $35.76. Company price to earnings (P/E) ratio, which measures the relationship between the earnings of a company and its stock price, is calculated as 14.66. The current share price indicate that stock is -20.16% away from its one year high and is moving 32.65% ahead of its 52-week low.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://petroglobalnews24.com/2017-03-22-lumentum-holdings-inc-lite-upgraded-at-goldman-sachs-group-inc/&cid=52779432853907&ei=FvfVWNmDEZLYuASynZrgBg&usg=AFQjCNHjmflBp07vMgHknO2lpx-xqX-4Dw\">Petro Global News 24</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nThe Lumentum Holdings Inc (LITE) Upgraded at Goldman Sachs Group Inc\n", "text": "<p>Goldman Sachs Group Inc upgraded shares of Lumentum Holdings Inc (NASDAQ:LITE) from a sell rating to a neutral rating in a research note issued to investors on Thursday. Goldman Sachs Group Inc currently has $45.00 target price on the stock, up from their prior target price of $38.00.\n\nSeveral other research analysts also recently weighed in on the company. Zacks Investment Research upgraded Lumentum Holdings from a hold rating to a buy rating and set a $45.00 price target for the company in a report on Wednesday, December 28th. B. Riley reiterated a buy rating on shares of Lumentum Holdings in a report on Thursday, January 5th. Needham & Company LLC reiterated a strong-buy rating on shares of Lumentum Holdings in a report on Friday, January 6th. Morgan Stanley boosted their price target on Lumentum Holdings from $34.00 to $44.00 and gave the company an underweight rating in a report on Wednesday, February 22nd. Finally, Barclays PLC boosted their price target on Lumentum Holdings from $32.00 to $35.00 and gave the company an underweight rating in a report on Wednesday, February 8th. Two research analysts have rated the stock with a sell rating, three have given a hold rating and nine have assigned a buy rating to the stock. The stock currently has a consensus rating of Buy and an average price target of $46.46.\n\nLumentum Holdings (NASDAQ:LITE) traded up 4.07% on Thursday, reaching $51.20. The company had a trading volume of 422,702 shares. The stock’s 50-day moving average price is $45.50 and its 200 day moving average price is $40.64. The firm has a market capitalization of $3.10 billion, a price-to-earnings ratio of 215.13 and a beta of 0.73. Lumentum Holdings has a 52-week low of $20.80 and a 52-week high of $53.69.\n\nLumentum Holdings (NASDAQ:LITE) last posted its earnings results on Tuesday, February 7th. The company reported $0.57 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $0.51 by $0.06. The firm had revenue of $265 million for the quarter, compared to analyst estimates of $265.66 million. Lumentum Holdings had a return on equity of 17.24% and a net margin of 1.50%. Lumentum Holdings’s revenue was up 21.4% on a year-over-year basis. During the same quarter in the prior year, the company earned $0.31 EPS. On average, equities analysts anticipate that Lumentum Holdings will post $2.12 earnings per share for the current fiscal year.\n\nIn other news, Director Harold L. Covert sold 12,000 shares of the company’s stock in a transaction on Friday, February 10th. The stock was sold at an average price of $47.09, for a total transaction of $565,080.00. Following the completion of the sale, the director now directly owns 15,953 shares in the company, valued at approximately $751,226.77. The transaction was disclosed in a legal filing with the SEC, which is available at this link. Also, CEO Alan S. Lowe sold 1,094 shares of the company’s stock in a transaction on Wednesday, February 22nd. The stock was sold at an average price of $52.10, for a total value of $56,997.40. Following the sale, the chief executive officer now owns 142,942 shares of the company’s stock, valued at $7,447,278.20. The disclosure for this sale can be found here. Over the last 90 days, insiders have sold 43,220 shares of company stock valued at $2,047,987. Insiders own 0.76% of the company’s stock.\n\nSeveral hedge funds have recently added to or reduced their stakes in the company. Fortaleza Asset Management Inc. increased its stake in Lumentum Holdings by 23.7% in the fourth quarter. Fortaleza Asset Management Inc. now owns 3,240 shares of the company’s stock worth $125,000 after buying an additional 620 shares during the last quarter. Aperio Group LLC purchased a new stake in Lumentum Holdings during the third quarter worth approximately $245,000. Brown Advisory Inc. increased its stake in Lumentum Holdings by 36.1% in the fourth quarter. Brown Advisory Inc. now owns 7,111 shares of the company’s stock worth $274,000 after buying an additional 1,888 shares during the last quarter. First American Bank purchased a new stake in Lumentum Holdings during the third quarter worth approximately $306,000. Finally, Capital Management Associates NY purchased a new stake in Lumentum Holdings during the third quarter worth approximately $313,000. Institutional investors and hedge funds own 84.16% of the company’s stock.\n\nAbout Lumentum Holdings\n\nLumentum Holdings Inc is a provider of optical and photonic products for a range of end market applications, including data communications (Datacom) and telecommunications (Telecom) networking and commercial lasers (commercial lasers) for manufacturing, inspection and life-science applications. The Company operates in two segments: Optical Communications (OpComms) and Commercial Lasers (Lasers).</p>"}}]}