{"events": [{"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.senecaglobe.com/investment-luring-titans-in-focus-general-mills-inc-nysegis-nike-inc-nysenke/379899/&cid=52779432697031&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNGiup1JgzTky5hd5wjWGmMaB_aXSw\">Seneca Globe</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nInvestment Luring Titans in Focus- General Mills, Inc. (NYSE:GIS), NIKE, Inc ...\n", "text": "<p>General Mills, Inc. (NYSE:GIS) [Trend Analysis] considering as most desiring stocks in active trading lead, shares Dropped after opening to traded at $58.88 with volume of 1.27 Million shares. General Mills Inc (GIS) declared its seventh straight decline in quarterly sales on Tuesday as the maker of Cheerios breakfast cereal limited discounting in a bid to boost margins, amid stiff pricing competition.\n\nThe company has been offering fewer discounts on products such as Progresso soups and Pillsbury dough to cut costs, while rivals have been slashing prices to compete for retailers’ shelves. The price gap with its competitors was one of General Mills’ “biggest challenges” so far this year, Chief Operating Officer Jeff Harmening told analysts on a post-earnings call.\n\n“We haven’t had the promotion mix right and we haven’t been as competitive in pricing as we could have been,” Harmening said. General Mills said it was still cutting back on discounting in the current quarter, but at a slower rate than it has so far done. Retailers including Wal-Mart Stores Inc (WMT.N), Target Corp (TGT.N) and Amazon.com Inc (AMZN.O) are currently embroiled in a price war that has made it crucial for them to stock cheaper products.\n\nGIS is ahead its 52-week low with 0.76%and going down from its 52-week high price with -17.88%. The company’s shares performance for the last one month was 0.89% and -1.16% in the previous week.\n\nAs the revenues measures, firm has operation margin of 15.90% in the following twelve months with net profit margin of positive 10.20%. The Company showed a positive 10.20% in the net profit margin. Company’s annual sales growth for the past five year was 2.20%.\n\nNIKE, Inc. (NYSE:NKE) [Trend Analysis] swings ardently in active trading session, it knocks down of -6.02% to close at $54.52. Nike Inc (NKE) declared that lower-than-expected quarterly revenue on Tuesday as the world’s largest footwear maker battles for market share in North America with a resurgent Adidas AG and a fast-growing Under Armour Inc.\n\nNike and its Jordan brand have been dominant in the U.S. footwear market for years, but Adidas (ADSGn.DE) and Under Armour (UAA.N) are gaining ground by revamping their brands and introducing new products. Nike has lost basketball sales to Under Armour since its rival poached the NBA’s Golden State Warriors star Stephen Curry in 2013.\n\nGermany’s Adidas has also been successful in its efforts to muscle back into the U.S. market, with fashion shoes made popular by collaborations with celebrities such as Kanye West, Pharrell Williams and Rita Ora.\n\nThe stock price of firm is moving down from its 20 days moving average with -4.65% and remote isolated negatively from 50 days moving average with -1.04%. (Full [FREE Analysis] of NYSE:NKE And Be Sure To Notice The Intermediate Period)\n\nMoving toward the volatility measures, the price volatility of stock was 1.69% for a week and 1.56% for a month as well as price volatility’s Average True Range for 14 days was 0.93. The beta, which indicates risk in relegation to the market, remained 0.47. The firm past twelve months price to sales ratio was 2.86 and price to cash ratio remained 15.70. As far as the returns are concern, the return on equity was recorded as 31.70% and return on investment was 25.50% while its return on asset stayed at 18.00%.\n\nFor latest Market Updates Subscribes Here</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.sfgate.com/business/article/Sears-Nike-and-US-Bancorp-stumble-while-FedEx-11020655.php&cid=52779433723471&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNG_j2SPihGxpBTUY9J1fWissiLdDQ\">SFGate</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nSears, Nike and US Bancorp stumble while FedEx, Duluth rise\n", "text": "<p>Sears, Nike and US Bancorp stumble while FedEx, Duluth rise\n\nNEW YORK (AP) — Stocks that moved substantially or traded heavily on Wednesday:\n\nSears Holdings Corp., down $1.12 to $7.98\n\nThe retailer said in a regulatory filing that there is \"substantial doubt\" it will be able to remain in business.\n\nNike Inc., down $4.09 to $53.92\n\nThe shoe and athletic apparel retailer reported weaker sales than expected and investors weren't pleased with its outlook.\n\nU.S. Bancorp, down 9 cents to $52.60\n\nBanks fell for the fourth trading day in a row as interest rates decreased again.\n\nFedEx Corp., up $4.08 to $195.92\n\nThe shipping company's holiday-season results were mixed, but analysts expect its business to improve.\n\nDuluth Holdings Inc., up $2.76 to $22.02\n\nThe clothing and tools supplier had a strong fourth quarter and its annual forecast was better than analysts expected.\n\nPPG Industries Inc., down 23 cents to $104.25\n\nPPG offered to buy industrial paints and chemicals company AkzoNobel for about $24 billion, which AkzoNobel rejected.\n\nPublic Service Enterprise Group Inc., up 44 cents to $45.10\n\nUtility companies continued to do better than the rest of the market as investors snap up high-dividend stocks as bond yields fall.\n\nMallinckrodt PLC, down $1.51 to $42.54\n\nImprimis Pharmaceuticals said it is studying a drug that would compete with Mallinckrodt's costly drug HP Acthar gel.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.hotstockspoint.com/analysts-mean-rating-score-stands-at-2-10-while-nike-inc-s-nke-stock-price-is-now-at-58-01-notable-runners/&cid=52779429734208&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNFMKrAaor2ep4z3sdqQJLWajebJ8A\">Hot Stocks Point</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAnalysts mean rating score stands at 2.10 while NIKE, Inc.'s (NKE) stock price ...\n", "text": "<p>NIKE, Inc. (NKE)’s Stock Price Trading Update:\n\nNIKE, Inc. (NKE) stock price ended its day with loss -1.14% and finalized at the value of $58.01. During its last trading session, Stock traded with the total exchanged volume of 14.51 million shares. The average volume stands around 9.1 million shares. The average numbers of shares are traded in a security per day, during the recent 3-month period. The stock has relative volume of 1.59. Relative volume is ratio between current volume and 3-month average value, intraday adjusted. NIKE, Inc. (NKE) is a part of Consumer Goods sector and belongs to Textile – Apparel Footwear & Accessories industry.\n\nImportant Technical Indicators:\n\nATR value of company was 0.93. Average True Range (ATR) is an indicator based on trading ranges smoothed by an N-period exponential moving average percentage of the true range values. ATR can display volatility of stocks, ETFs and indexes. The principal of ATR is very similar to other volatility indicators: A high ATR value signals a possible trend change. A low ATR value correlates with a weaker trend movement.\n\nRelative Strength Index (RSI) was 62.27. Developed J. Welles Wilder, the Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements. RSI oscillates between zero and 100. Traditionally, and according to Wilder, RSI is considered overbought when above 70 and oversold when below 30.\n\nThe stock volatility for week was 1.69% while for month was 1.56%.The stock, as of last close, traded 19.16% to its 52 week low and was changed -10.25% from its 52 week high. Beta factor, which measures the riskiness of the security, was observed as 0.47. NKE’s value Change from Open was at -1.31% with a Gap of 0.17%.\n\nEarnings per share Details about NKE:\n\nEPS in next five year years is expected to touch 12.18% while EPS growth in past 5 year was 14.10% along with sales growth of 10.00% in the last five years.\n\nEPS growth in next year is estimated to reach 12.75% while EPS growth estimate for this year is set at 16.60%.\n\nThe price/earnings ratio (P/E) is 25.60 and the forward P/E ratio stands at 22.02. The price to earnings growth is 2.10 and the price to sales ratio is 17. It has a dividend yield of 1.24%.\n\nPerformance Review:\n\nTo review the NKE previous performance, look at its past history, which highlighted below:\n\nDuring last 5 trades the stock sticks almost 1.27%.\n\nDuring last one month it showed the change of 2.54%.\n\nDuring last 3 month it remained at 14.28%.\n\nDuring last one year month it performed at -9.25%.\n\nAlong with these its year to date performance is standing at 14.48%.\n\nAnalysts Mean Rating:\n\nAnalysts’ mean recommendation for NIKE, Inc. (NKE) stands at 2.10. Rating Scale; where 1.0 rating means Strong Buy, 2.0 rating signify Buy, 3.0 recommendation reveals Hold, 4.0 rating score shows Sell and 5.0 displays Strong Sell signal.\n\nNKE Stock Price Comparison to Moving Averages:\n\nUSA based company, NIKE, Inc. (NKE)’s latest closing price was 7.61% from the average-price of 200 days while it maintained a distance from the 50 Day Moving Average at 5.23% and 1.31% compared with the 20 Day Moving Average.\n\nThree Months Ago Analysts Rating:\n\nHere we discussed Analysts views what they told about Nike, Inc. (NKE) stock 3 Months Ago. Analysts recommended an average brokerage rating of Overweight derived from brokerage firms, according to FactSet. 18 said a “Buy Rating” and 3 announced “Overweight Rating”. 12 advised “Hold Rating” regarding the stock. 0 announced “Sell Rating” and 1 disclosed “Underweight Rating”. Analysts play a useful role in our capital markets. For example, by doing in-depth research for their large institutional clients and employers, analysts can help substantial sums of capital be directed to more productive uses in our economy. A “Buy” rating does not mean that every investor should acquire the stock. Nor does a “Sell” rating mean that every investor should immediately sell it. Your own financial situation and investment needs are what matter. If you consider any individual rating, do not views it in absolute or abstract terms, but in the context of your own unique financial situation. In short, whatever a given analyst recommendation may say, always consider whether a particular investment is right for you in light of your own financial circumstances. Remember, you are the boss, it’s your money, and your situation and goals that matter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/news/17/03/9201309/18-stocks-moving-in-wednesdays-pre-market-session&cid=52779432938613&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNGJECZWaLAfXOo21sR4mFjHb_kXTw\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\n18 Stocks Moving In Wednesday's Pre-Market Session\n", "text": "<p>Gainers\n\nbebe stores, inc. (NASDAQ: BEBE) rose 33.1 percent to $4.75 in pre-market trading after dropping 44.65 percent on Tuesday.\n\n(NASDAQ: BEBE) rose 33.1 percent to $4.75 in pre-market trading after dropping 44.65 percent on Tuesday. Achillion Pharmaceuticals, Inc. (NASDAQ: ACHN) rose 18.5 percent to $4.55 in pre-market trading after the company disclosed that the USPTO has granted composition of matter patent to company for small molecule complement alternative pathway factor D inhibitors.\n\n(NASDAQ: ACHN) rose 18.5 percent to $4.55 in pre-market trading after the company disclosed that the USPTO has granted composition of matter patent to company for small molecule complement alternative pathway factor D inhibitors. Moleculin Biotech Inc (NASDAQ: MBRX) shares rose 14.1 percent to $1.22 in pre-market trading after the company reported that its AML treatment liposomal annamycin has been awarded the FDA Orphan Drug designation.\n\n(NASDAQ: MBRX) shares rose 14.1 percent to $1.22 in pre-market trading after the company reported that its AML treatment liposomal annamycin has been awarded the FDA Orphan Drug designation. Ballard Power Systems Inc. (USA) (NASDAQ: BLDP) shares rose 6.5 percent to $2.30 in pre-market trading after declining 4.00 percent on Tuesday.\n\n(NASDAQ: BLDP) shares rose 6.5 percent to $2.30 in pre-market trading after declining 4.00 percent on Tuesday. Winnebago Industries, Inc. (NYSE: WGO) rose 5.2 percent to $29.25 in pre-market trading after the company reported better-than-expected results for its second quarter.\n\n(NYSE: WGO) rose 5.2 percent to $29.25 in pre-market trading after the company reported better-than-expected results for its second quarter. Sunrun Inc (NASDAQ: RUN) rose 4.2 percent to $5.00 in pre-market trading. UBS upgraded Sunrun from Neutral to Buy.\n\n(NASDAQ: RUN) rose 4.2 percent to $5.00 in pre-market trading. UBS upgraded Sunrun from Neutral to Buy. Pulmatrix Inc (NASDAQ: PULM) shares rose 3.9 percent to $4.03 in pre-market trading after surging 39.57 percent on Tuesday.\n\n(NASDAQ: PULM) shares rose 3.9 percent to $4.03 in pre-market trading after surging 39.57 percent on Tuesday. Amaya Inc. (NASDAQ: AYA) rose 2.6 percent to $15.75 in pre-market trading after the company reported strong quarterly results.\n\n(NASDAQ: AYA) rose 2.6 percent to $15.75 in pre-market trading after the company reported strong quarterly results. Aurinia Pharmaceuticals Inc (NASDAQ: AUPH) rose 2.5 percent to $8.58 in pre-market trading after dropping 4.67 percent on Tuesday.\n\n(NASDAQ: AUPH) rose 2.5 percent to $8.58 in pre-market trading after dropping 4.67 percent on Tuesday. FedEx Corporation (NYSE: FDX) shares rose 2 percent to $195.50 in pre-market trading. FedEx reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17.\n\nFind out what's going on in today's market and bring any questions you have to Benzinga's PreMarket Prep.\n\nLosers\n\nSears Holdings Corp (NASDAQ: SHLD) shares fell 11.4 percent to $8.06 in pre-market trading. 10-K from Sears showed a comment 'Our historical operating results indicate substantial doubt exists related to the Company's ability to continue as a going concern.'\n\n(NASDAQ: SHLD) shares fell 11.4 percent to $8.06 in pre-market trading. 10-K from Sears showed a comment 'Our historical operating results indicate substantial doubt exists related to the Company's ability to continue as a going concern.' Frontier Communications Corp (NASDAQ: FTR) shares fell 8.1 percent to $2.17 in pre-market trading. Goldman Sachs downgraded Frontier Communications from Neutral to Sell.\n\n(NASDAQ: FTR) shares fell 8.1 percent to $2.17 in pre-market trading. Goldman Sachs downgraded Frontier Communications from Neutral to Sell. Regenxbio Inc (NASDAQ: RGNX) fell 7.5 percent to $20.45 in pre-market trading. REGENXBIO reported a $75 million offering of common stock.\n\n(NASDAQ: RGNX) fell 7.5 percent to $20.45 in pre-market trading. REGENXBIO reported a $75 million offering of common stock. Global Blood Therapeutics Inc (NASDAQ: GBT) shares fell 6.4 percent to $34.00 in the pre-market trading session after dropping 2.81 percent on Tuesday.\n\n(NASDAQ: GBT) shares fell 6.4 percent to $34.00 in the pre-market trading session after dropping 2.81 percent on Tuesday. Nike Inc (NYSE: NKE) fell around 5.3 percent to $54.95 in pre-market trading. Nike reported upbeat earnings for its third quarter, while sales missed estimates.\n\n(NYSE: NKE) fell around 5.3 percent to $54.95 in pre-market trading. Nike reported upbeat earnings for its third quarter, while sales missed estimates. ING Groep NV (ADR) (NYSE: ING) fell 4.9 percent to $14.71 in pre-market trading after gaining 0.98 percent on Tuesday.\n\n(NYSE: ING) fell 4.9 percent to $14.71 in pre-market trading after gaining 0.98 percent on Tuesday. Golden Ocean Group Ltd (NASDAQ: GOGL) fell 3.6 percent to $7.33 in pre-market trading after dropping 6.75 percent on Tuesday.\n\n(NASDAQ: GOGL) fell 3.6 percent to $7.33 in pre-market trading after dropping 6.75 percent on Tuesday. Utah Medical Products, Inc. (NASDAQ: UTMD) fell 3.3 percent to $59.05 in pre-market trading after slipping 0.81 percent on Tuesday.\n\nPosted-In: #PreMarket Gainers LosersNews Movers & Shakers Pre-Market Outlook Markets Movers\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://stockmarketdaily.co/2017/03/22/stocks-to-watch-nike-inc-nysenke-fedex-corporation-nysefdx-regenxbio-inc-nasdaqrgnx-autozone-inc-nyseazo-and-achillion-pharmaceuticals-inc-nasdaqachn/&cid=52779432233981&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNH9zxWIPC12UwDU6uVCj15Gjh4PYw\">Stock Market Daily</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nStocks To Watch: Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio ...\n", "text": "<p>Stocks To Watch: Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio Inc (NASDAQ:RGNX), AutoZone, Inc. (NYSE:AZO), And Achillion Pharmaceuticals, Inc. (NASDAQ:ACHN)\n\nAt least six companies’ shares are worth watching on Wednesday. They included Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio Inc (NASDAQ:RGNX), AutoZone, Inc. (NYSE:AZO), and Achillion Pharmaceuticals, Inc. (NASDAQ:ACHN).</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://buckeyebusinessreview.com/2017/03/22/rating-this-stock-how-do-the-technicals-stack-up-for-nike-inc-nysenke/&cid=52779433749401&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNHSsJBIO9eKniMfa3JG4V_LfIo1Uw\">Buckeye Business Review</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nRating This Stock: How Do the Technicals Stack Up For NIKE, Inc. (NYSE:NKE)?\n", "text": "<p>Rating This Stock: How Do the Technicals Stack Up For NIKE, Inc. (NYSE:NKE)?\n\nnvestors having NIKE, Inc. (NYSE:NKE) on their watchlists might want to take into consideration the Gross Margin Score of the firm. NIKE, Inc. currently has a score of 1.00000. This score is derived from the Gross Margin (Marx) stability and growth over the previous eight years. The Gross Margin score lands on a scale from 1 to 100 where a score of 1 would be considered positive, and a score of 100 would be seen as negative. The low score of 1.00000 for NIKE, Inc. indicates a top score for stability and growth.\n\nChecking in on some valuation rankings, NIKE, Inc. (NYSE:NKE) has a Value Composite score of 63. Developed by James O’Shaughnessy, the VC score uses five valuation ratios. These ratios are price to earnings, price to cash flow, EBITDA to EV, price to book value, and price to sales. The VC is displayed as a number between 1 and 100. In general, a company with a score closer to 0 would be seen as undervalued, and a score closer to 100 would indicate an overvalued company. Adding a sixth ratio, shareholder yield, we can view the Value Composite 2 score which is currently sitting at 51.\n\nAfter a recent scan, we can see that NIKE, Inc. (NYSE:NKE) has a Shareholder Yield of 0.040845 and a Shareholder Yield (Mebane Faber) of 0.02666. The first value is calculated by adding the dividend yield to the percentage of repurchased shares. The second value adds in the net debt repaid yield to the calculation. Shareholder yield has the ability to show how much money the firm is giving back to shareholders via a few different avenues. Companies may issue new shares and buy back their own shares. This may occur at the same time. Investors may also use shareholder yield to gauge a baseline rate of return.\n\nAt the time of writing, NIKE, Inc. (NYSE:NKE) has a Piotroski F-Score of 5. The F-Score may help discover companies with strengthening balance sheets. The score may also be used to spot the weak performers. Joseph Piotroski developed the F-Score which employs nine different variables based on the company financial statement. A single point is assigned to each test that a stock passes. Typically, a stock scoring an 8 or 9 would be seen as strong. On the other end, a stock with a score from 0-2 would be viewed as weak.\n\nNIKE, Inc. (NYSE:NKE) has a current ERP5 Rank of 5040 . The ERP5 Rank may assist investors with spotting companies that are undervalued. This ranking uses four ratios. These ratios are Earnings Yield, ROIC, Price to Book, and 5 year average ROIC. When looking at the ERP5 ranking, it is generally considered the lower the value, the better.\n\nShifting gears, we can see that NIKE, Inc. (NYSE:NKE) has a Q.i. Value of 50.00000. The Q.i. Value ranks companies using four ratios. These ratios consist of EBITDA Yield, FCF Yield, Liquidity, and Earnings Yield. The purpose of the Q.i. Value is to help identify companies that are the most undervalued. Typically, the lower the value, the more undervalued the company tends to be.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/news/earnings/17/03/9201087/a-peek-into-the-markets-u-s-stock-futures-down-ahead-of-existing-home-sa&cid=52779432879371&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNGALhW96k8_fPR9MbzuPtiMDFryuA\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nA Peek Into The Markets: US Stock Futures Down Ahead Of Existing-Home Sales Report\n", "text": "<p>Pre-open movers\n\nU.S. stock futures traded lower in early pre-market trade. The FHFA House Price Index for January will be released at 9:00 a.m. ET, while data on existing home sales for February will be released at 10:00 a.m. ET.\n\nFutures for the Dow Jones Industrial Average dropped 39 points to 20,588.00, while the Standard & Poor’s 500 index futures fell 1.75 points to 2,340.50. Futures for the Nasdaq 100 index slipped 4 points to 5,334.25.\n\nOil prices traded lower as Brent crude futures dropped 1.22 percent to trade at $50.34 per barrel, while US WTI crude futures fell 0.57 percent to trade at $47.67 a barrel. The Energy Information Administration’s weekly report on petroleum inventories is schedule for release at 10:30 a.m. ET.\n\nA Peek Into Global Markets\n\nEuropean markets were lower today, with the Spanish Ibex Index dropping 0.31 percent, STOXX Europe 600 Index declining 0.65 percent and German DAX 30 index falling 0.49 percent. The UK's FTSE index was trading lower by 0.78 percent, while French CAC 40 Index slipped 0.47 percent.\n\nIn Asian markets, Japan’s Nikkei Stock Average fell 2.13 percent, Hong Kong’s Hang Seng Index dropped 1.11 percent, China’s Shanghai Composite Index fell 0.50 percent and India’s BSE Sensex fell 1.08 percent.\n\nBroker Recommendation\n\nAnalysts at Stifel Nicolaus downgraded General Mills, Inc. (NYSE: GIS) from Buy to Hold.\n\nGeneral Mills shares fell 0.83 percent to close at $59.76 on Tuesday.\n\nBreaking news\n\nNike Inc (NYSE: NKE) reported upbeat earnings for its third quarter, while sales missed estimates.\n\n(NYSE: NKE) reported upbeat earnings for its third quarter, while sales missed estimates. Winnebago Industries, Inc. (NYSE: WGO) reported better-than-expected results for its second quarter.\n\n(NYSE: WGO) reported better-than-expected results for its second quarter. FedEx Corporation (NYSE: FDX) reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17.\n\n(NYSE: FDX) reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17. Perry Ellis International, Inc. (NASDAQ: PERY) posted upbeat earnings for its second quarter on Wednesday.\n\nPosted-In: A Peek Into The MarketsEarnings News Eurozone Futures Global Pre-Market Outlook Markets\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://wolcottdaily.com/nike-nke-reaches-54-01-after-3-00-gap-down-modine-manufacturing-company-mod-si-decreased-by-13-31/&cid=52779433413169&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNH_goix70lOtyWm4LKxnmWSuIznyw\">Wolcott Daily</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nNike (NKE) Reaches $54.01 After 3.00% Gap Down; Modine Manufacturing Company ...\n", "text": "<p>The stock of Nike Inc (NYSE:NKE) gapped down by $2.72 today and has $52.39 target or 3.00% below today’s $54.01 share price. The 7 months technical chart setup indicates high risk for the $88.34 billion company. The gap down was reported on Mar, 22 by Barchart.com. If the $52.39 price target is reached, the company will be worth $2.65B less. About 31.74M shares traded or 237.30% up from the average. Nike Inc (NYSE:NKE) has risen 2.18% since August 15, 2016 and is uptrending. It has underperformed by 4.84% the S&P500.\n\nModine Manufacturing Company (NYSE:MOD) had a decrease of 13.31% in short interest. MOD’s SI was 566,100 shares in March as released by FINRA. Its down 13.31% from 653,000 shares previously. With 309,700 avg volume, 2 days are for Modine Manufacturing Company (NYSE:MOD)’s short sellers to cover MOD’s short positions. The SI to Modine Manufacturing Company’s float is 1.2%. About 202,347 shares traded. Modine Manufacturing Co. (NYSE:MOD) has risen 7.04% since August 15, 2016 and is uptrending. It has outperformed by 0.01% the S&P500.\n\nNIKE, Inc. is engaged in the design, development, marketing and selling of athletic footwear, apparel, equipment, accessories and services. The company has market cap of $88.34 billion. The Company’s operating divisions include North America, Western Europe, Central & Eastern Europe, Greater China, Japan and Emerging Markets. It has a 22.55 P/E ratio. The Company’s portfolio brands include the NIKE Brand, Jordan Brand, Hurley and Converse.\n\nInvestors sentiment increased to 0.98 in 2016 Q4. Its up 0.04, from 0.94 in 2016Q3. It is positive, as 84 investors sold Nike Inc shares while 443 reduced holdings. 112 funds opened positions while 405 raised stakes. 993.29 million shares or 0.55% less from 998.81 million shares in 2016Q3 were reported. Boston Family Office Ltd Co holds 1.1% of its portfolio in Nike Inc (NYSE:NKE) for 166,154 shares. Greenwood Capital Assoc Ltd Co has invested 0.78% in Nike Inc (NYSE:NKE). Peak Asset Lc owns 7,137 shares for 0.15% of their portfolio. Mackenzie Financial Corporation holds 6.04 million shares or 1.84% of its portfolio. Charter Company reported 75,392 shares. North Star Asset Management has invested 0.29% in Nike Inc (NYSE:NKE). Bkd Wealth Advsrs Ltd Llc holds 4,358 shares. Camarda Fincl Lc holds 64 shares or 0% of its portfolio. Shamrock Asset Management Limited Liability Co owns 200 shares. Blue Ridge Ltd Liability Co accumulated 4.99 million shares. Exane Derivatives holds 0% or 41,548 shares in its portfolio. Ridgeworth Cap Llc holds 0.11% of its portfolio in Nike Inc (NYSE:NKE) for 248,349 shares. Lenox Wealth Mgmt accumulated 2,460 shares or 0.1% of the stock. 715 are held by Edge Wealth Mgmt Limited Liability Corporation. Blackrock Japan Ltd, a Japan-based fund reported 1.77 million shares.\n\nSince September 30, 2016, it had 1 buy, and 5 sales for $40.89 million activity. Slusher John F also sold $7.09M worth of Nike Inc (NYSE:NKE) shares. $10.48M worth of Nike Inc (NYSE:NKE) was sold by Ayre David J. Another trade for 150,000 shares valued at $7.47 million was made by PARKER MARK G on Tuesday, November 1. $52,717 worth of Nike Inc (NYSE:NKE) was bought by LECHLEITER JOHN C on Friday, September 30.\n\nAmong 37 analysts covering Nike Inc. (NYSE:NKE), 23 have Buy rating, 2 Sell and 12 Hold. Therefore 62% are positive. Nike Inc. had 113 analyst reports since July 29, 2015 according to SRatingsIntel. On Friday, September 25 the stock rating was maintained by B. Riley & Co with “Buy”. The rating was initiated by Oppenheimer on Tuesday, October 25 with “Perform”. The stock of Nike Inc (NYSE:NKE) earned “Neutral” rating by Wedbush on Wednesday, November 2. The stock has “Outperform” rating by Robert W. Baird on Wednesday, September 28. Canaccord Genuity maintained the stock with “Hold” rating in Friday, September 23 report. The rating was maintained by Credit Suisse with “Outperform” on Friday, September 25. As per Wednesday, December 2, the company rating was downgraded by Goldman Sachs. Barclays Capital maintained the shares of NKE in report on Wednesday, March 23 with “Overweight” rating. The rating was maintained by DA Davidson on Wednesday, December 23 with “Buy”. The rating was upgraded by BB&T Capital on Monday, October 19 to “Buy”.\n\nAmong 3 analysts covering Modine Manufacturing (NYSE:MOD), 3 have Buy rating, 0 Sell and 0 Hold. Therefore 100% are positive. Modine Manufacturing had 4 analyst reports since August 4, 2015 according to SRatingsIntel. The stock has “Hold” rating by Zacks on Tuesday, August 4. The firm has “Buy” rating given on Tuesday, January 31 by Gabelli. As per Thursday, March 24, the company rating was upgraded by Seaport Global.\n\nSince November 14, 2016, it had 0 buys, and 3 insider sales for $432,599 activity. 7,500 Modine Manufacturing Co. (NYSE:MOD) shares with value of $119,625 were sold by Bowser Scott L. $303,199 worth of stock was sold by Marry Thomas F on Tuesday, December 13. Patterson Christopher William sold $9,775 worth of Modine Manufacturing Co. (NYSE:MOD) on Monday, November 14.\n\nInvestors sentiment increased to 1 in Q4 2016. Its up 0.05, from 0.95 in 2016Q3. It improved, as 10 investors sold Modine Manufacturing Co. shares while 45 reduced holdings. 16 funds opened positions while 39 raised stakes. 40.26 million shares or 1.58% more from 39.64 million shares in 2016Q3 were reported. Gsa Cap Prtnrs Llp invested in 0.19% or 211,042 shares. Allianz Asset Ag accumulated 0% or 274,148 shares. Driehaus Management Limited Liability Com owns 162,910 shares. Glenmede Company Na owns 0% invested in Modine Manufacturing Co. (NYSE:MOD) for 10,448 shares. Cornerstone Capital Mgmt Holdg Lc accumulated 34,078 shares or 0% of the stock. Metropolitan Life New York reported 33,974 shares. Schwab Charles Investment Management Inc accumulated 0% or 209,483 shares. Qs Invsts Limited Liability Corp reported 0.02% of its portfolio in Modine Manufacturing Co. (NYSE:MOD). Wells Fargo Co Mn has 33,268 shares. Millennium Mngmt Ltd has 0% invested in Modine Manufacturing Co. (NYSE:MOD). Ajo L P owns 30,088 shares. Public Employees Retirement Association Of Colorado holds 0% in Modine Manufacturing Co. (NYSE:MOD) or 19,998 shares. Credit Suisse Ag owns 67,492 shares. Savings Bank Of Ny Mellon Corp has 0% invested in Modine Manufacturing Co. (NYSE:MOD). Jpmorgan Chase & holds 0% or 25,049 shares in its portfolio.\n\nModine Manufacturing Company provides engineered heat transfer systems and heat transfer components for use in on-highway and off-highway original equipment maker vehicular applications, and for sale into an array of building, industrial and refrigeration markets. The company has market cap of $541.23 million. The Company’s products include radiators and radiator cores, exhaust gas recirculation coolers, building heating, ventilating and air conditioning (HVAC) equipment, and coils. It has a 37.83 P/E ratio. The Company’s divisions include Americas, Europe, Asia and Building HVAC.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/buzzus-stocks-on-the-movenike-sears-therapix-frontier-snap-transdigm--xcel-brands-20170322-00944&cid=52779433060425&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNGrjstDXg7MOv9QTA9M3JsorBZ9YQ\">Nasdaq</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nBUZZ-US STOCKS ON THE MOVE-Nike, Sears, Therapix, Frontier, Snap, TransDigm ...\n", "text": "<p>Reuters\n\n\n\n\n\n* Eikon search string for individual stock moves: STXBZ * The Day Ahead newsletter: http://tmsnrt.rs/2ggOmBi * The Morning News Call newsletter: http://tmsnrt.rs/2fwPLTh The S&P and the Nasdaq reversed course to hit session highs in late morning trading on Wednesday, even as investors remained cautious ahead of the first major legislative test of Donald Trump's presidency. [.N] At 14:23 ET, the Dow Jones Industrial Average <.DJI> was down 0.18 percent at 20,631.17. The S&P 500 <.SPX> was up 0.02 percent at 2,344.51 and the Nasdaq Composite <.IXIC> was up 0.20 percent at 5,805.147. ANALYSIS-Markets fret as Trump agenda shows signs of cracks [nL2N1GY191] World stocks seen as most overvalued in 17 years - BAML survey [nL5N1GY4LQ] BUZZ-S&P 500: Downside reversal can gain steam [nL2N1GY0WF] BUZZ-DJI: May play on a swing set [nL2N1GZ0F2] BUZZ-Utilities index hits highest level since August [nL2N1GZ1AH] The top three percentage gainers on the S&P 500 <.PG.INX>: ** Marriott Int'l <MAR.O>, up 2.7 pct at $91.47 [nL3N1GY4CY] ** Ventas Inc <VTR.N>, up 2.5 pct at $62.31 ** Freeport McMoRan <FCX.N>, up 2.4 pct at $12.87 [nFWN1GZ02J] The top three percentage losers on the S&P 500 <.PL.INX>: ** Nike Inc <NKE.N>, down 6.4 pct at $54.29 [nL3N1GZ4Q1] ** TransDigm Group <TDG.N>, down 4 pct at $215.76 [nL3N1GZ4KX] ** Mallinckrodt <MNK.N>, down 3.3 pct at $42.60 The top three percentage gainers on the NYSE <.PG.N>: ** Asia Pacific Fund <APB.N>, up 8.3 pct at $11.96 ** Silver Wheaton <SLW.N>, up 8.3 pct at $21.58 [nASB0B6FV] ** Yingli Green Energy <YGE.N>, up 7.7 pct at $2.10 The top three percentage losers on the NYSE <.PL.N>: ** Glassbridge Enterprises <GLA.N>, down 16.6 pct at $5.14 [nASB0B6HC] ** OI SA ADR <OIBRc.N>, down 9.9 pct at $6.72 [nL2N1GY1LL] ** China Online Education <COE.N>, down 8.7 pct at $16.99 [nL3N1GZ48U] The top three percentage gainers on the Nasdaq <.PG.O>: ** Therapix Biosciences <TRPX.O>, up 43.3 pct at $8.60 [nL3N1GZ4RH] ** Ominto Inc <OMNT.O>, up 24.7 pct at $12.35 ** Idera Pharma <IDRA.O>, up 17.2 pct at $2.45 [nL3N1GZ493] The top three percentage losers on the Nasdaq <.PL.O>: ** Zions Bancorp warrants <ZIONZ.O>, down 30 pct at $7.80 ** Xcel Brands Inc <XELB.O>, down 18.8 pct at $2.76 [nL3N1GZ4G2] ** Sears Holding <SHLD.O>, down 14.2 pct at $7.81 [nL3N1GZ4PQ] ** Nike Inc <NKE.N>: down 6.4 pct at $54.29 UPDATE 3-Nike's revenue misses estimates as rivals gain ground [nL3N1GY558] BUZZ-Nike Inc: Brokerages cut PTs after Q3 revenue miss, drop in orders [nL3N1GZ4Q1] ** Sears Holdings Corp <SHLD.O>: down 14.2 pct at $7.81 UPDATE 2-Sears shares sink as creditors, investors fret over going-concern risk [nL3N1GZ4PQ] BUZZ-Sears Holdings: Warns on ability to continue as going concern [nL3N1GZ4G3] ** FedEx Corp <FDX.N>: up 1.6 pct at $194.93 UPDATE 2-FedEx misses on earnings, but sees higher margins ahead [nL2N1GX17D] BUZZ-FedEx Corp: 2nd biggest S&P 500 gainer after upbeat earnings report [nL3N1GZ3YY] ** Therapix Biosciences Ltd <TRPX.O>: up 43.3 pct at $8.60BUZZ-Therapix Biosciences Ltd: Shares surge as much as 55 pct in debut [nL3N1GZ4RH] ** Frontier Communications Corp <FTR.O>: down 15.9 pct at $1.99 ** Windstream Holdings Inc <WIN.O>: down 8.0 pct at $5.88 ** CenturyLink Inc <CTL.N>: down 2.8 pct at $22.70 BUZZ-Goldman Sachs points to U.S. telcos' 'wireline woes' [nL3N1GZ3QJ] ** Winnebago Industries Inc <WGO.N>: up 5.2 pct at $29.25BUZZ-Winnebago Industries: Best day in 4 months as EPS beats again [nL3N1GZ417] ** Xcel Brands Inc <XELB.O>: down 18.8 pct at $2.76BUZZ-Xcel Brands Inc: Hits more than 4-yr low after weak Q4 results [nL3N1GZ4G2] ** Moleculin Biotech Inc <MBRX.O>: up 36.4 pct at $1.46 BUZZ-Moleculin Biotech: Lead cancer treatment gets orphan drug status [nL3N1GZ4NL] ** Calithera Biosciences Inc <CALA.O>: down 2.8 pct at $10.25BUZZ-Calithera Biosciences Inc: Drops on stock offering [nL3N1GZ40M] ** Duluth Holdings Inc <DLTH.O>: up 14.0 pct at $21.96BUZZ-Duluth Holdings Inc: Best intraday jump in a nearly year on strong forecast [nL3N1GZ439] ** Acushnet Holdings Corp <GOLF.N>: up 3.6 pct at $18.41BRIEF-Acushnet Holdings sees FY 2017 sales in line with estimates [nFWN1GZ0AT] ** Easterly Government Properties Inc <DEA.N>: down 1.4 pct at $19.45BUZZ-Easterly Government Properties: Dips on equity raise to fund acquisitions [nL2N1GZ0F9] ** Cooper Cos Inc <COO.N>: up 2.3 pct at $199.79Cooper Cos increase share repurchase program [nASB0B6FC] ** Marriott International Inc <MAR.O>: up 2.7 pct at $91.47 Brokers hike PTs a day after upbeat forecast [nL3N1GY4CY] ** Freeport McMoRan Inc <FCX.N>: up 2.4 pct at $12.87 Berenberg raises to \"hold\" from \"sell\" [nFWN1GZ02J] ** Taylor Morrison Home Corp <TMHC.N>: down 5.2 pct at $20.71BUZZ-Taylor Morrison Homes: Falls as sponsors sell via block [nL2N1GZ0JA] ** L Brands Inc <LB.N>: down 3.0 pct at $47.72 Keybanc cuts to \"underweight\" ** General Mills Inc <GIS.N>: down 1.7 pct at $58.77 Stifel cuts to hold rating - trader ** Dynatronics Corp <DYNT.O>: down 1.9 pct at $2.85 BRIEF-Dynatronics to acquire Hausmann Industries for $10 mln [nASB0B6J3] ** TransDigm Group Inc <TDG.N>: down 4.0 pct at $215.76BUZZ-TransDigm Group Inc: Hits more than 10-month low [nL3N1GZ4KX] ** Idera Pharmaceuticals Inc <IDRA.O>: up 17.2 pct at $2.45 BUZZ-Idera Pharma: At 6-mth high after JMP starts with \"market outperform\" [nL3N1GZ493] ** China Online Education Group <COE.N>: down 8.7 pct at $16.99BUZZ-China Online Education Group: Plunges after Q4 loss widens [nL3N1GZ48U] ** Steelcase Inc <SCS.N>: up 3.2 pct at $16.20 BRIEF-Steelcase reports Q4 results [nASB0B6EV] ** Oi SA <OIBRc.N>: down 9.9 pct at $6.72 BUZZ-Brazil's Oi: creditor group asks court mediation to discuss debt plan [nL2N1GY1LL] ** Dow Chemical <DOW.N>: down 1.1 pct at $62.36 ** DuPont <DD.N>: down 1.4 pct at $78.66 Indian regulator says Dow, DuPont deal likely to hurt competition [nL3N1GZ4GM] ** PPG Industries Inc <PPG.N>: down 0.7 pct at $103.79 UPDATE 5-Shareholders urge Akzo to negotiate with suitor PPG ** Bank of America <BAC.N>: down 0.4 pct at $22.94 ** Goldman Sachs <GS.N>: down 1.1 pct at $230.41 ** Wells Fargo <WFC.N>: down 1.0 pct at $55.28 ** Morgan Stanley <MS.N>: down 1.0 pct at $42.25 ** JPMorgan Chase <JPM.N>: flat at $87.43 ** Citigroup Inc <C.N>: down 0.3 pct at $57.86 U.S. bank stocks fall as investor hope wanes for policy boosts [nL2N1GY1O0] BUZZ-Bank stocks tumble as investors take profits on political uncertainty [nL2N1GY10X] BUZZ-Amid bank sell off, greater pain centered in regionals [nL2N1GU0TN] ** Snap Inc <SNAP.N>: up 5.7 pct at $21.54 Snap pops 9 percent after winning second 'buy' recommendation [nL2N1GZ164] BUZZ-Snap Inc wins second 'buy' rating from analyst [nL2N1GY213] ** American Airlines Group Inc <AAL.O>: down 0.9 pct at $40.04 ** Delta Air Lines Inc <DAL.N>: up 0.1 pct at $45.58 ** Southwest Airlines Co <LUV.N>: up 0.6 pct at $52.19 ** Alaska Air Group Inc <ALK.N>: up 0.4 pct at $92.47 BUZZ-U.S. airlines: MS downgrades to \"in-line\" [nL3N1GZ3ZE] ** Bebe Stores Inc <BEBE.O>: up 6.4 pct at $3.80BUZZ-Bebe Stores Inc: Claws back some gains after Tuesday's rout [nL3N1GZ3YM] MEDIA-Bebe plans to shut its stores and focus on web sales - Bloomberg [nL3N1GY4RD] ** Uni-Pixel Inc <UNXL.O>: up 17.1 pct at $0.89BUZZ-Uni-Pixel Inc: best day in nearly 1-1/2 years [nL3N1GZ454] ** Silver Wheaton Corp <SLW.N>: up 8.3 pct at $21.58 BRIEF-Silver Wheaton reports Q4 results, hikes dividend [nASB0B6FV] Silver Wheaton proposes changing name to Wheaton Precious Metals [nL2N1GY1YC] ** Regenxbio Inc <RGNX.O>: down 8.6 pct at $20.20BUZZ-Regenxbio Inc: Drops after stock offering prices [nL3N1GZ3TF] The 11 major S&P 500 sectors: Consumer Discretionary <.SPLRCD> down 0.15 pct Consumer Staples <.SPLRCS> down 0.24 pct Energy <.SPNY> down 0.13 pct Financial <.SPSY> down 0.31 pct Health <.SPXHC> down 0.10 pct Industrial <.SPLRCI> up 0.22 pct Information Technology <.SPLRCT> up 0.61 pct Materials <.SPLRCM> down 0.10 pct Real Estate <.SPLRCR> down 0.13 pct Teleservices <.SPLRCL> down 1.33 pct Utilities <.SPLRCU> up 0.38 pct (Compiled by Sruthi Shankar in Bengaluru; Editing by Savio D'Souza) ((sruthi.shankar@thomsonreuters.com; within U.S. +1 646 223 8780; outside U.S. +91 80 6749 6328; Reuters Messaging: sruthi.shankar.reuters.com@reuters.net)) Keywords: MARKETS USA STOCKS/PULSE</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.fool.com/investing/2017/03/22/why-frontier-communications-nike-and-sirius-xm-slu.aspx&cid=52779433617266&ei=bB7WWNGOKsbkugSH6oKYBQ&usg=AFQjCNGpQ5I9Cx1bno0Apie9BW7Aj_nv6Q\">Motley Fool</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nWhy Frontier Communications, Nike, and Sirius XM Slumped Today\n", "text": "<p>Following the stock market's most painful decline in over six months yesterday given concerns over Treasury rates and legislative roadblocks to the U.S. presidential administration's attempts to push through new pro-growth policies, stocks enjoyed a modest rebound on Wednesday. The S&P 500 and Nasdaq indexes rose roughly 0.2% and 0.5%, respectively, while the Dow Jones Industrial Average fell just a few points.\n\nBut as always, a few individual companies bucked the largely positive trend, including Nike (NYSE:NKE), Frontier Communications (NASDAQ:FTR), and Sirius XM (NASDAQ:SIRI). Read on to see what drove their declines today.\n\nNike endures a tough market\n\nThe primary culprit of the Dow's decline today was a disappointing quarterly report that drove shares of longtime index component Nike down more than 7%. More specifically, Nike saw revenue in its latest quarter climb 5% year over year, to $8.432 billion -- just below the $8.47 billion investors were expecting -- while earnings per share rose a healthier 23.6% with the help of cost controls and share repurchases.\n\nWithin Nike's total, revenue in North America climbed only 3%, to $3.782 billion. To blame, according to Nike CEO Mark Parker, are changing consumer patterns and a difficult retail environment that has hurt traffic, the economics of its brick-and-mortar business, creating a \"more promotional environment in the near term.\"\n\nTo be fair, Nike views these headwinds as a chance to further establish its dominance with its digital initiatives and product innovation. But in the meantime, the company expects current-quarter revenue to increase at a rate slightly below the 5% growth it achieved last quarter -- again significantly below the 7.4% growth Wall Street was modeling.\n\nFrontier gets a downgrade\n\nFrontier Communications stock fell 10.6% after Goldman Sachs analyst Brett Feldman downgraded shares from to sell from neutral. Feldman also reduced his price target on Frontier from $3.00 to $1.50.\n\nTo justify his renewed bearishness, Feldman expressed concern that Frontier's \"weakening fundamentals\" may cause the company to voluntarily suspend its dividend after its impending first-quarter payment. This would allow Frontier Communications to deleverage its balance sheet and improve liquidity in order to repay maturing debt in the coming years. Given the fact Frontier's dividend currently yields an uncomfortably high 19.9% after the drop, the move wouldn't be entirely surprising.\n\nOne analyst put Sirius XM on mute\n\nFinally, shares of Sirius XM fell 1.8% as Barclays analyst Kannan Venkateshwar reduced its rating on the satellite radio specialist to \"equal weight\" from \"overweight.\" The analyst also assigned a price target of $4.90 per share (shares closed today at $5.10).\n\nVenkateshwar fairly noted that Sirius XM has handily outperformed the broader market over the past year and half. Most recently, he said, that outperformance was extended thanks to a combination of Berkshire Hathaway increasing its stake in the company, spurned rumors of its potential interest in acquiring streaming media competitor Pandora Media, and the potential value of SiriusXM's connected car business following Intel's recent acquisition of self-driving vehicle technology company Mobileye.\n\nGiven this vote for caution and with shares of SiriusXM still up nearly 30% over the past year alone, it's hard to blame investors for taking some of their profits off the table today.</p>"}}]}