{"events": [{"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.businesswire.com/news/home/20170322005860/en/American-Express-Plans-Live-Audio-Webcasts-Quarter&cid=52779430238379&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNEQEd1mzIylpmJJJt7MZTPUKnP6Ww\">Business Wire (press release)</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAmerican Express Plans Live Audio Webcasts of the First Quarter 2017 Earnings ...\n", "text": "<p>NEW YORK--(BUSINESS WIRE)--American Express Company (NYSE:AXP) plans to host a live audio webcast of its earnings conference call at 5:00 p.m. (ET) on Wednesday, April 19, 2017 to discuss first quarter 2017 financial results. The Company's financial results are scheduled to be announced shortly after the market closes that day.\n\nThe Company also plans to host a live audio webcast of its annual meeting of shareholders at 9:00 a.m. (ET) on Monday, May 1, 2017. The meeting will be held in the auditorium at the Company’s headquarters located in Lower Manhattan.\n\nBoth of the live audio webcasts will be accessible to the general public through the American Express Investor Relations website at http://ir.americanexpress.com/. Presentation materials will be posted on the website prior to each event, and an audio replay will be available on the website following each event.\n\nAbout American Express\n\nAmerican Express is a global services company, providing customers with access to products, insights and experiences that enrich lives and build business success. Learn more at americanexpress.com, and connect with us on facebook.com/americanexpress, foursquare.com/americanexpress, linkedin.com/company/american-express, twitter.com/americanexpress, and youtube.com/americanexpress.\n\nKey links to products, services and corporate responsibility information: charge and credit cards, business credit cards, Plenti rewards program, travel services, gift cards, prepaid cards, merchant services, Accertify, corporate card, business travel, and corporate responsibility.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.fool.com/investing/2017/03/22/where-social-media-and-the-payments-industry-mee-2.aspx%3Fsource%3Diedfolrf0000001&cid=52779433133175&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNG2HDWipFlzRvkGJzQ3DurNiKX6Kw\">Motley Fool</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nWhere Social Media and the Payments Industry Meet\n", "text": "<p>Payments processors like Visa (NYSE:V) and Mastercard (NYSE:MA) have been around for decades, but the last few years have seen the start of a new industry that combines payment facilitators and social commerce.\n\nOn this week's episode of Industry Focus: Financials, Motley Fool analyst Gaby Lapera talks with fellow podcaster Dylan Lewis about the evolving industry of payments processing and facilitating, and a panel he attended at this year's SXSW conference. Find out what Facebook (NASDAQ:FB) is getting out of facilitating payments free of charge on its platform, some of the established norms that are keeping apps like Venmo from taking off fully, the state of competition in the payments processing space today, and more.\n\nA full transcript follows the video.\n\nThis podcast was recorded on March 13, 2017.\n\nGaby Lapera: Hello, everyone! Welcome to Industry Focus, the podcast that dives into a different sector of the stock market every day. You're listening to the Financials edition, taped today on Monday, March 13, 2017. My name is Gaby Lapera, and joining me on the phone is Dylan Lewis, the Industry Focus: Tech host. Hey!\n\nDylan Lewis: How's it going, Gaby?\n\nLapera: Good, how about you?\n\nLewis: Doing OK. I'm calling you, more specifically, from my hotel room in Austin on a landline. I can't remember the last time I used a landline phone.\n\nLapera: Me neither, actually. [laughs] I know that you're in Austin, Texas. You're there for South by Southwest. Can you talk a little bit about what that is, for our listeners who aren't as familiar?\n\nLewis: Yeah. South by Southwest is an annual conference. You have the mix of music, art, and emerging tech, which is very much of the culture in Austin. We go every year, this is my second year going with the Fool, and we check out what's going on, what are some of the nascent technologies that companies are spending some time investing in, putting some big resources behind, and some things that might be changing the landscape of a lot of the industries that we focus on every day.\n\nLapera: Awesome. Listeners, get used to hearing Dylan. I hope you like him. I know I do. Because, the shows this week are going to be a little bit different. He's going to be joining each one and talking about how tech is seeping into all of our sectors, and what the maybe next big thing is in each sector. Which I'm pretty excited about.\n\nLewis: Yeah, it'll be less of an investing-focused week, not so much in the nuts and bolts of, say, accounting. A little bit more talking about emerging tech. Thankfully, premium analyst Simon Erickson is also going to hop on the podcast. He's going to handle the Healthcare episode and the Energy and Industrials show on Thursday. So you won't have to hear my voice too much.\n\nLapera: Oh. I forgot about Simon. That will be really good too. And I'm sure you're breathing a sigh of relief, because I know healthcare isn't exactly your thing. [laughs]\n\nLewis: No. Simon has a lot more interesting things to say about healthcare than I do.\n\nLapera: That's OK. I know you have plenty of interesting things to say about financials, so I'm glad to have you on my show. Today's topic is about disruption in the payments space. You attended a session called \"Payments Gone Viral: The Rise Of Social Commerce.\" Can you tell us a little bit about the general premise, and tell us about who was there?\n\nLewis: Yeah. The two folks that I was really interested in on the panel were Hans Morris, who is someone who is a long-term member of the payments space, he's currently a VC, he's at Nyca Partners, he has extensive experience working in payments at Visa and [Citigroup]. And also, Kahina Van Dyke, who is at Facebook, she works in the consumer financials services and payments and commerce side of their business, which I think a lot of people don't even realize exists. It was definitely really interesting to hear the two of them weigh in on what is going on with social platforms and payments, and how that relates to some of the industry stalwarts like the payment processors, the credit card companies, and the banks.\n\nLapera: Yeah. What is social commerce?\n\nLewis: It's basically layering on a lot of the financial services or money exchanging that we're used to doing with banks, on platforms that we tend to think of more for social. So, Messenger allows for peer-to-peer --\n\nLapera: That's Facebook Messenger, folks, just in case you weren't sure which one. AOL instant messenger, etc. [laughs]\n\nLewis: Sorry, I realize I need to be a little bit less insider tech. That's great clarification, sorry about that. But, Facebook Messenger allows for peer-to-peer processing of payments. They're not doing the processing, though the optics for a user might be. They're really just enabling people to transfer money back and forth, and leaning on the legacy systems. That was really what a lot of this talk was about. I think one of the things really early on that set the tone for me was Hans said, \"If you're thinking about getting into the payments space, whether you are a big tech company or a new fresh starter looking to disrupt the space, don't compete with other forms of electronic payments. Compete with cash or with transactions that just don't happen.\" And his thought here is, there's so much going on, there's so much money that's been invested in the infrastructure to support payment processing. You're not going to unseat those people. What you are going to do is collect a decent amount of the market, and a meaningful market share, if you're able to replace cash and take what would be offline transactions digital. Or, if you're able to enable transactions that wouldn't happen. So, making it easier when people might not have money, or making a more streamlined, a little bit less friction type process that eliminates some of the barriers for transactions that don't happen now.\n\nLapera: Yeah, definitely. That's really interesting, you said it's brutally tough to compete with the legacy payment processors. Of course, he's talking about companies like Visa or Mastercard or even American Express. These companies have giant moats. They have these crazy international systems. The thing about Visa and Mastercard is the more users they have, the more merchants they're going to have, because the merchants have an interest in providing a service that lets people give them money easier. Of course, that creates a self-fulfilling cycle, where the more merchants who have Visa, the more customers who have Visa.\n\nLewis: In tech, to bring it back around and use a tech term, we call that the network effect. It's no different than the idea that Facebook as a platform is more valuable because there are more users on Facebook. So, with every incremental user -- if you only have four friends on Facebook, then how valuable is it for you to be on there? If you have 1,000 friends on Facebook, and it's the way you connect with people, and that's how you plan, then it becomes a much more valuable and compelling value proposition for potential users. So, the same mechanics at play.\n\nLapera: Definitely. And one thing I want listeners to think about is, when was the last time you went into a merchant and you were like, \"Oh no, they don't take whatever card I have in my wallet?\" I bet you can't remember a time, unless they just didn't accept cards at all.\n\nLewis: Just those hip bars in D.C. that only collect cash.\n\nLapera: [laughs] Those are the most fun ones, though.\n\nLewis: They are the most fun ones. But you always have that pang of anxiety when you realize you only have about $10 in your wallet.\n\nLapera: Which is OK, because most of the times those bars are also the cheapest in D.C., which is a hard thing to find. If listeners are ever in D.C., I have a couple recommendations for cheap bars. Something that's few and far between in D.C., for sure.\n\nLewis: Yeah, definitely. I think, one of the reasons I thought this conversation was so interesting is, when you think about big tech companies coming into a space like payments, this is something we also see in driverless cars, getting into what we think of as manufacturing, which is typically something that tech would stay away from. You think about them coming and disrupting and possibly unseating the industry incumbents. From this talk, it sounded to me like there's just so much in the way for them to do that, and they have almost zero interest in doing it. And a lot of the tone that I got was, \"We're looking more for cooperative efforts, and a little bit less for competitive efforts.\"\n\nLapera: Which makes a lot of sense. It's really interesting, because Visa especially is trying to break into this electronic wallet space. And they're having some success, but not as much as, say, Apple Pay has had, or Venmo, or any of those already-online wallets. So, there are payment processors that are looking to team up with tech companies like Apple. Apple doesn't actually do any of the payment processing. They are teamed up with Visa and Mastercard in order to do the payments.\n\nLewis: Which really makes sense for them as a company. This is a point Kahina raised in the conversation, we think about what goes into payment processing. You have risk, you have compliance, you have all of this regulatory stuff that you have to navigate. If you're a tech company and this is kind of far afield from your core competency, why would you want to take on all those pressures? Why wouldn't you just leave it to someone who knows what they're doing, have them handle things like authentication, managing fraud, chargebacks, all of that, and just enjoy enabling purchases that might not happen otherwise on top of their systems.\n\nLapera: Yeah. And that's something that I think, listeners, just in case you don't know, credit card companies like Visa and Mastercard, they're not actually responsible for holding on to your money or anything, they're just the middleman. They're the people who contact your bank and are like, \"Do they have enough money? What's their credit limit?\" And then they help do the transfer between the merchant and the bank. But they're not actually holding on to your money for you.\n\nLewis: Which is something that I don't think I knew. I don't know the financials space all that well, and frankly, there were elements of this where I was like, \"Huh, I didn't know that.\" But one of my big takeaways was, wow, the moat that these legacy financial companies have is massive, because no one wants to go into building out that type of infrastructure.\n\nLapera: Yeah. You want to hear some numbers?\n\nLewis: Absolutely.\n\nLapera: In 2015, which is the latest that I have data on in front of me, Visa had 50% of the U.S. credit card market share by network purchase volume, which is a lot. Mastercard is trailing around 25%. The debit card market share by network purchase volume, Visa has had a little dip, and now it's only at 70%. But it used to be at 80%. Mastercard is hovering around 30%. Market share based on number of credit cards in circulation at the end of 2015, Visa had 328 million credit cards in the U.S. circulating. Mastercard had 192 million. Which is crazy. The monthly purchase/spending volume at the end of 2015 on a Visa card is $341. For a MasterCard, it's $283. That's a lot of money, especially if you annualize that.\n\nLewis: Wow. One of the things I noticed with a lot of those numbers that you cited were that they were U.S.-focused. With some of these social platforms, as you might imagine, the most valuable markets are the U.S. market, the European market, so, the North American markets and the European markets. And then, some of the developing parts of the world are less valuable on a revenue-per-user basis. It sounds to me like that's the same thing for financials.\n\nLapera: Yeah, absolutely. Visa has actually just taken a big leg up on its competition by integrating Visa Europe, which, oddly enough, not part of Visa before this last quarter. They did that pretty flawlessly, when all things are considered. The metrics, the financial side of it, the accounting side of it, looks really good. And that's going to grow their business by 25% in one fell swoop. Isn't that crazy?\n\nLewis: Wow. One of the other things they touched on that plays into this regional conversation we're having is the idea that a lot of vendors are using Facebook in developing countries, and that's how they are creating an online presence. And then, they're using the peer-to-peer on Messenger as a way to facilitate transactions that aren't happening. I think, if there is a risk that you're looking for in any of this in the financials space, it's more in the developing markets, and maybe tech companies getting a foot in there and having that be the natural association that users have with payments, rather than traditional bank accounts, because a lot of folks in developing countries are unbanked at the moment. You probably know a little bit more about that than I do, Gaby.\n\nLapera: I know a lot about that, actually. If anyone wants a book recommendation, I have one for you.\n\nLewis: Yeah?\n\nLapera: Yeah. Lisa Servon, she actually came to Fool HQ a couple weeks ago, she wrote a book called The Unbanking Of America. Really interesting book about how the middle class is navigating being unbanked and underbanked in the United States. But a lot of those lessons can be applied to developing worlds, or developing nations.\n\nLewis: Is it a quick read?\n\nLapera: I thought so, but I also have a background in social sciences, so it was really fast for me. It's really interesting whenever I go on Amazon to look at book reviews, because half of them are always like, \"This book was way too technical,\" and I'm like, \"Great, I'll probably love this book.\" [laughs] So, if you're not into a lot of numbers, maybe not the book for you. But I thought it was great.\n\nLewis: I think that's the right way to qualify that recommendation.\n\nLapera: Yeah, that's totally fair. Before we get to our next topic, unless you have anything else to say about being unbanked?\n\nLewis: No, I think that wraps it for me. I think that's more your area of expertise. If you're ready to move on, I'm ready to move on.\n\nLapera: Peer-to-peer transfer, also known as P2P, just in case we accidentally abbreviate that at some point in the show, let's talk a little bit about that.\n\nLewis: Yeah, I thought that was another really interesting element of this conversation. One of the things that Kahina Van Dyke from Facebook said was, Facebook is not looking to make any money off of the P2P side of money transfer. A direct quote here was, \"We offer P2P for free, but it does cost money.\" What she really means there is, they're offering this, and the whole point is, \"We're going to eat these costs because we think it's really great for engagement on our apps and on our platform. We're happy to do that if it keeps people in the system longer.\"\n\nLapera: Yeah. That makes a lot of sense. But, that's actually a really interesting point about collecting data. I don't know how many of our listeners are familiar with Venmo. They're owned by PayPal (NASDAQ:PYPL) now. They have this social feed that you can scroll through and see what all of your friends have been buying. So it could say, \"Dylan Lewis paid Gaby Lapera for 50 pineapple upside down cakes.\"\n\nLewis: A frequent purchase I make.\n\nLapera: Exactly. Dylan really likes pineapple. Actually, I don't know if you like pineapple, but I love pineapple, so maybe I would be paying you for pineapple upside down cake. [laughs] But, there's this really interesting aspect that sometimes people don't say exactly what they're actually using it for. There's actually this really sketchy feed called Vicemo, where these people have a scraper that goes through the Venmo feed -- because you can see anyone's purchases on it -- and it takes out anything that has any references to drugs or ladies of the night or alcohol, any illicit or less-above-board activities, and it publishes them in a feed that you can just scroll through. But I don't think that many people are saying, \"Yes, I am actually purchasing cocaine.\" They might do it as a joke, but I don't think it's real.\n\nLewis: Yeah, it's certainly entertaining. I think one of the things that highlights, and I am a Venmo user, and I do the same thing, I mess around with my friends, knowing that my payments are going to be public, and will often obscure whatever it is that I'm actually paying them for with a funny emoji instead. That kind of puts a ceiling on how helpful the data is that they're collecting on that messaging, and really understanding what people are using the platform to pay for.\n\nLapera: Yeah, definitely. I think the other thing that's really interesting about Venmo is that the adoption process, and other social commerce platforms, the adoption process has a hurdle in that a lot of people trust payment processors like Visa, or they trust their banks, but a lot of them have never heard of Venmo, or Facebook Messenger, as a way to transfer money. And they're like, \"Is that really secure? That's not really your area of expertise? Your area of expertise is Facebook, it's not money.\" So, I feel like a lot of potential users might hesitate to hop on to the social commerce, fintech-type space.\n\nLewis: Yeah. For as much as I enjoy messing around in the social space, and hanging out on digital media, I will not be giving Facebook my payment information. On my end, I'm happy to have one less point of access to my financial accounts.\n\nLapera: Yeah, definitely. That's something to keep in mind. And one of the really interesting things about Visa is that it's one of the most recognized brands in the world, and also one of the most trusted brands. And while Facebook might be one of the most recognized brands as well, I don't know that it's one of the most trusted, too.\n\nLewis: Yeah. There was a great quote from the panel. One of the people on it said, \"People may not like their banks, but they trust them.\" I think when you're talking about financial services, that's really what it comes down to. You want your money to still be there a week later. You don't want to have to worry about someone logging in and liquidating your accounts because you're constantly signed in to Messenger on your phone, or something like that. The authentication that it takes for me to get into my online bank account, there's a lot more hurdles there than it takes for me to log into Facebook on my iPhone.\n\nLapera: Yeah, which is one more argument for these tech companies using other parties that are already established to help them set up these networks. The other thing that's really interesting is that a lot of these things have not been monetized yet.\n\nLewis: Yeah. And they are backed by big tech money. Facebook saying, \"We're offering P2P for free,\" and it is, in some ways, a loss leader, or, it's a way to keep people playing on the platform, that echoes what Sheryl Sandberg has said in the past, one of their executives, basically saying that it's a way for them to enforce the activities that they want to see on Facebook and Instagram. It's not a means to an end in terms of profitability for them.\n\nLapera: They just want to see more people using their products.\n\nLewis: Exactly. And that's great for consumers. It's awesome for me to be able to send you money for free and not have to worry about it. But I think it does make the space a little bit tougher for your small players, maybe some of your upstarts.\n\nLapera: Yeah, definitely. I think Venmo is also free for P2P transfer. That's actually how I pay my rent. Fun fact, I told my landlords about it and they were 100% on board. They used to use PayPal, but they charged a processing fee. Venmo is free, as long as you're not paying via credit card. If you pay via credit card, there's a 3% surcharge. But as far as I know, that's the only way they're making money right now, and they're still not in the black.\n\nLewis: And they are, of course, part of PayPal, which is a large payment facilitation company. They're able to get away with fueling growth, fueling growth with the Venmo platform because they have this underlying business that is really firing on all cylinders. Ditto for Facebook. They have this huge ad business that just prints money, so they don't care what goes on with the payments on Messenger, because it's such an inconsequential amount of money for them. When you have that kind of backing, and you can have these loss leader services, it makes it a lot tougher for those new entrants, like I talked about. What you need to do and what you need to be able to offer is going to be eating into your bottom line for a long time just so that you can acquire customers.\n\nLapera: Yeah, definitely. I think this is going to be a really interesting space to watch going forward, and definitely something we will continue to cover at Industry Focus: Financials. Dylan, I want to thank you so much for joining us today.\n\nLewis: Thank you for having me. This was fun. I still have questions. There will be follow-up episodes where Dylan asks Gaby questions about financials because he doesn't understand the segment.\n\nLapera: I would love that. I think we should do all the crossover episodes ever. I have the most fun with those episodes.\n\nLewis: Hint hint, listeners, that might be another theme week coming up soon.\n\nLapera: As usual, people on the program may have interests in the stocks they talk about, and The Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. Contact us at industryfocus@fool.com, or by tweeting us @MFIndustryFocus. Dylan, thank you again for joining us from South by Southwest. I hope your flight back is a lot better.\n\n\n\nLewis: Yeah, me too. [laughs] We'll see. Hopefully Saturday, smooth sailing.\n\n\n\nLapera: And, thank you very much to Austin, the man that the City of Austin is named after, where South by Southwest is taking place. He is today's producer. And thank you to you all for joining us. Everyone, have a great week!</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.equitiesfocus.com/american-express-company-nyseaxp-peg-ratio-at-2-14/1252867/&cid=52779428267784&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNGjhI3X9fYOoCM8-O_AfWBAeshNtg\">Equities Focus</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAmerican Express Company (NYSE:AXP) PEG Ratio At 2.14\n", "text": "<p>Market professionals have $81.44 fixed mean price target on American Express Company (NYSE:AXP) stock. This is the mark obtained in First Call survey. It is foretold to be achieved in approaching year. For upcoming quarterly, $1.42 is estimated EPS while for year it is $5.63.\n\nTechnical View\n\nAmerican Express Company Common technical analysis shows American Express Company Common 50-day MA is $79.01, and it is trading $-1.19 points away or -1.50% from 50-day MA of $79.01. It is trading $5.76 or +8.00% off 200-day MA of $72.06. American Express Company (NYSE:AXP) 52-week high is $82.00 and 52-week low is $57.15.\n\nIf the equity moves $-4.18, 52-week high is hit. In occurrence of +36.17% nosedive, a 52-week mark is in prospect.\n\nIn finance, technical analysis is an equity assessment methodology for estimating the direction of prices through the review of past market data, mainly price and volume. Quantitative analysis and behavioural economics use several of the same tools of technical study which, being a part of active management, stands in contrary to much of latest portfolio theory. The efficacy of fundamental as well as technical analysis is undecided by the efficient-market hypothesis which shapes that stock market prices are basically unpredictable.\n\nAmerican Express Company (NYSE:AXP) P/E ratio came at 13.77. The stock closed at $77.82 in last trading period, so present market capitalization is $70.14B. The price/earnings ratio, often shortened to the PE ratio is the ratio of a firm’s stock price to the firm’s earnings per share. It is used in valuing firms. As an instance, if stock A price is $24 and the per-share earnings for the recent 12-month period stands at $3, then A boasts a P/E ratio of 8. Put another way, the buyer of the stock is putting $8 for every dollar of income. Companies with losses or no income have an undefined P/E, usually shown as “N/A”; sometimes, though, a negative PE ratio may be indicated. American Express Company (NYSE:AXP) PEG ratio is at 2.14.\n\n1 Chart Pattern Every Investor Should Know This little-known pattern preceded moves of 578% in ARWR, 562% in LCI, 513% in ICPT, 439% in EGRX, 408% in ADDUS and more... Click Here to See This Now.\n\n(Visited 7 times, 1 visits today)</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.forbes.com/sites/tomgroenfeldt/2017/03/22/sap-ariba-will-use-blockchain-to-track-shipments-ensure-authenticity/&cid=52779431542216&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNEYNWT7AJek0NUgjbN9qCiD-uQWRA\">Forbes</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nSAP Ariba Will Use Blockchain to Track Shipments, Ensure Authenticity\n", "text": "<p>SAP Ariba, which connects 2.5 million buyers and sellers around the world through its network, today announced it will offer blockchain record-keeping across its cloud-based applications and business network.\n\nAlso today, its parent company, SAP announced that it has joined Hyperledger, the blockchain development program from the Linux Foundation, as a premier member. It joins other industry leaders which are premier members including Accenture, American Express, CME Group, Deutsche Borse, JPMorgan, IBM and Intel.\n\n\"We believe blockchain is a transformative technology for enterprise businesses,” said Juergen Mueller, chief innovation officer at SAP in a press release. ”We are committed to advancing its adoption via the creation of new standards, use cases, platforms and open applications. In joining Hyperledger, we plan to share our expertise and knowledge to help bring open distributed ledger technology to all businesses.”\n\nSAP Ariba will use blockchain technology to improve its customer’s view of the business they are conducting, said Joe Fox, senior vice president for business development and strategy. The company’s focus is around trading and moving physical assets, not currencies but movements of goods.\n\n“Right now hundreds of billions of dollars of goods are moving that aren’t in the hands of the seller or the receiver.\n\nPhoto by Tom Groenfeldt\n\nHandoffs, control and ownership are done in a very traditional way.”\n\nBlockchain will allow buyers and receivers to track and trace the movement of goods. SAP Ariba also announced today that it has formed a partnership with Everledger a London-based firm that can capture the defining characteristics of diamonds and create a digital thumbprint of the asset that is stored on the blockchain. SAP Ariba said this information, including history, transport, events and ownership, can be used to verify authenticity.\n\n“If you can track and trace diamonds, you can track and trace anything.”\n\nEverledger was one of several companies using emerging technologies such as blockchain, artificial intelligence, machine learning and the Internet of Things to present at SAP Ariba Live in Las Vegas today.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.bloomberg.com/news/articles/2017-03-22/dean-foods-davis-exposes-seedy-side-in-insider-trial-testimony&cid=52779433679666&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNF0MNzHDENMHiXyWmOqaQDM2Iuxog\">Bloomberg</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nDean Foods Davis Tells Insider Jury of Prostitutes, Gambling\n", "text": "<p>Former chairman says he was ‘Enamored’ with Billy Walters\n\nBlackjack, patronizing prostitutes and stealing from a charity for women and children. Those were some of the vices the U.S. government’s star witness admitted to during testimony in the inside-trading trial of Las Vegas gambler Billy Walters.\n\nTom C. Davis, the former chairman of Dean Foods Co., also told a Manhattan jury he was enamored with Walters, who introduced him to pro golfer Phil Mickelson and was friends with investor Carl Icahn.\n\nEven after Walters arranged a $625,000 loan in 2010 for him, Davis said his failed investments, soaring expenses and a $200,000 casino debt forced him to siphon $100,000 from a golf charity that raised money for battered women. Davis repaid the money, but said he then \"double-dipped\" and withdrew $50,000 from the charity’s account to gamble and pay for hookers.\n\n“I made a very poor decision at that period of time in my life,” a chagrined Davis said in his gravelly Texas drawl.\n\nDavis, 68, made the admissions under questioning by U.S. Assistant Attorney Brooke Cucinella. It’s standard for a witness to disclose unsavory background information up front, rather than be forced to admit to it while questioned by a defense attorney. In that case, it might appear to a jury that the witness was trying to hide something.\n\nWalters, 70, is on trial, accused by the U.S. of reaping illegal profits over six years based on boardroom secrets Davis passed to him. Walters made $43 million, including $17.1 million on a lucrative tip about a spin-off of a Dean Foods unit in 2012, according to prosecutors.\n\nRepaid Charity\n\nDavis said he was authorized to draw from the charity account to pay expenses, food and gifts for the Pro-Am golf tournament he organized for the Dallas shelter. He said he repaid the charity in 2015, after having denied taking the money while being questioned under oath by officials from the U.S. Securities and Exchange Commission.\n\nThe most important market news of the day. Get our markets daily newsletter.\n\nDavis said he blew the $625,000 he got through Walters, including losing $200,000 on one hand of blackjack at the Cosmopolitan of Las Vegas in 2011. Davis then sought out Walters for a second loan of $400,000, telling him it was to refinance a Dallas bank. Even though he’d stopped making payments on the first loan, Davis said Walters agreed. He said he didn’t tell Walters the real reason for the loan was \"because I was embarrassed.\"\n\nAsked if he had a gambling problem, Davis insisted he didn’t. He told jurors he liked to regularly bet thousands of dollars on college and NFL football games. The most he said he ever lost on sports was $20,000 on a Super Bowl game, he said.\n\nFalse Pretenses\n\nWalters’s lawyer, Barry Berke, told jurors in opening statements last week that Davis was a liar who embezzled the $400,000 on false pretenses without ever investing the funds.\n\nCucinella asked Davis why he’d been giving inside information to Walters long before he got the 2010 loan.\n\n\"I’d developed a strong friendship with Mr. Walters,\" Davis said. \"I knew who Billy Walters was -- he was a fairly famous gambler. He had a lot of connections in Las Vegas. He was a big sports gambler. I was frankly enamored with him.\"\n\nDavis was also impressed with the company which Walters kept. Walters introduced him to Mickelson, who was a member of the same country club in Southern California as Walters.\n\nIcahn Connection\n\nDavis said Walters also passed on a stock tip to him, saying “my friend in New York likes this company a lot. You should look at it and you should think about buying the stock.”\n\nCucinella asked Davis who Walters’s friend was, to which Davis replied, \"Carl Icahn. He told me he had a good relationship, a close relationship with Mr. Icahn. I recall him saying he actually traveled with him before.\"\n\nDavis didn’t say when Walters gave him the tip or what company it pertained to.\n\nA spokeswoman for Icahn didn’t immediately respond to a request for comment on Davis’s testimony.\n\nDavis testified that Walters gave him a disposable phone, nicknamed the \"Bat Phone,\" to use when passing tips about Dean Foods and said he tossed it into a creek behind his Dallas home after the FBI visited him 2014. During cross-examination Wednesday, Berke suggested Davis made up the story.\n\nDavis had his own reasons for using a disposable phone -- because he \"had a history of infidelity\" and was trying to hide his frequent calls to escort services from his soon-to-be ex-wife, Terie Davis, Berke said.\n\nBerke confronted Davis with his telephone records and his American Express bills that showed dozens of calls and charges were made to escort services, including when he was in Colorado for a Dean Foods board of directors meeting.\n\n\"Do you recall sir, that while you were on a business trip that you called an escort service?\" Berke asked.\n\n\"I see that,\" Davis replied. \"I don’t recall ever paying for sex.\"\n\nThe case is U.S. v. Walters, 16-cr-338, U.S. District Court, Southern District of New York (Manhattan).</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.expressnews.com/business/technology/article/AT-T-halts-some-Google-ad-spending-amid-YouTube-11020748.php&cid=52779426631231&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNEln9ZKhmdQ_z-FB7POHd1XcFB-nQ\">San Antonio Express-News (subscription)</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAT&T, Verizon halt Google ad buying amid YouTube controversy\n", "text": "<p>AT&T, Verizon halt Google ad buying amid YouTube controversy\n\nPhoto: Alan Diaz /Associated Press AT&T Inc. halted non-search-advertising spending with Google,...\n\nAT&T Inc. and Verizon Communications Inc. halted non-search-advertising spending with Google, joining an expanding list of companies concerned about ads running beside offensive videos on YouTube.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://indianexpress.com/article/technology/tech-news-technology/samsung-pay-to-launch-in-india-today-all-you-need-to-know/&cid=52779429730081&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNFX3FM-MkKE-utDny5dSW2Fvv5Ziw\">The Indian Express</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nSamsung Pay in India, supports Credit, Debits cards and digital wallets\n", "text": "<p>Samsung Pay uses both NFC and MST (magnetic secure transmission) to make wireless payments. Samsung Pay uses both NFC and MST (magnetic secure transmission) to make wireless payments.\n\nSamsung has launched its mobile payment service, Samsung Pay, in India today. Samsung Pay will be available across the flagship Galaxy smartphones for now which includes the Galaxy Note 5, Galaxy S7, Galaxy S7 edge, Galaxy S6 edge+, Galaxy A7 (2016) and Galaxy A5 (2016), Galaxy A7 (2017) and Galaxy A5 (2017). Plus, the Gear S3 will also support Samsung Pay.\n\nSamsung has tied up with several banks and payment gateways in India. The list includes ICICI Bank, HDFC Bank, SBI, Standard Chartered, Citi Bank, and American Express. Its network partners are American Express, Visa, and MasterCard, while Pine Labs is the Acceptance partner for PoS machines. Finally Samsung has also tied up with mobile wallet Paytm for payments, and will be adding UPIs support via Axis Bank in the coming months.\n\n“The idea is that everything is part of the smartphone. With Samsung Pay, your debit cards, credit cards, mobile wallets will all be in one place. We have always supported Make in India, and with Samsung Pay we are doing meaningful innovation in India. We have worked closely with banks, payment gateways, card companies, and even mobile wallets in India,” said HC Hong, who is President and CEO of Samsung Electronics SouthWest Asia.\n\n“When we studied attitudes towards mobile payments in India, we found some barriers in acceptance among the consumers. The barriers were around security, ease of use and acceptance. With Samsung Pay, we’ve tried to overcome most of these issues,” said Asim Warsi, Senior Vice President at Samsung India.\n\nWarsi pointed out that Samsung Pay uses three levels of authentication: One is fingerprint authentication for authorizing payment, two being Card Tokenization, and finally Samsung’s own security feature called Samsung Knox. Samsung says it doesn’t really store the actual credit card number, instead with Tokenization a token number is stored as a placeholder by the company.\n\nSamsung Pay will not require merchants to upgrade to a different PoS machine, any machine with MST technology will be compatible with the eligible Samsung devices. Samsung Pay uses NFC (Near Fields Communication) as well as MST (Magnetic Secure Transmission) to make wireless payments. So essentially a user can just hold their Samsung smartphone next to a PoS machine, and the choose the card or wallet they want to make a payment with, and it will be detected by the machine. After that, the user can type in the amount they need to pay, enter their final transaction PIN, which is still required as per RBI norms, and the payment will go through.\n\nSamsung becomes the first company to launch a mobile payment service in India, ahead of Apple Pay or Android Pay. However, the service is still limited to a select few Galaxy smartphones, and we’ll have to wait, and see how soon it is rolled out to other devices.\n\nFor all the latest Tech News, download Indian Express App now\n\n© IE Online Media Services Pvt Ltd</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.businesstravelnews.com/Procurement/Amex-Increases-CEOs-2016-Pay&cid=0&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNFsaUt5PFmaEBqXzv0Eb00hoE2R9Q\">Business Travel News</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAmex Increases CEO's 2016 Pay\n", "text": "<p>Pardon Our Interruption...\n\nAs you were browsing http://www.businesstravelnews.com something about your browser made us think you were a bot. There are a few reasons this might happen:\n\nYou're a power user moving through this website with super-human speed.\n\nYou've disabled JavaScript in your web browser.\n\nA third-party browser plugin, such as Ghostery or NoScript, is preventing JavaScript from running. Additional information is available in this support article.\n\nTo request an unblock, please fill out the form below and we will review it as soon as possible.\n\nIgnore: Ignore: Ignore:\n\nFirst Name Last Name E-mail City Request Unblock</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://financeregistrar.com/2017/03/22/shares-offering-growth-at-a-reasonable-price-the-boeing-company-nyseba-american-express-company-nyseaxp/&cid=52779431421587&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNEQYIB2wGAo5lV29ktvtw8GUBpk9w\">The Finance Registrar</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nShares Offering Growth At A Reasonable Price: The Boeing Company (NYSE:BA ...\n", "text": "<p>The Boeing Company (NYSE:BA)\n\nThe forward price-to-earnings ratio is a powerful. For investors, it allows a quick snapshot of the company’s finances without getting bogged down in the details of an accounting report.\n\nThe Boeing Company (NYSE:BA) shares are trading 3.95% above their 50-day moving average, and 22.07% above their 200-day moving average. The stock recently closed at market price of 175.96 with a 1 year price target of 175.75. It is up 33.81% over 12 months and trades at 17.28 times forward earnings. While looking at Price-To-Book Ratio or P/B Ratio, company has a price-to-book ratio of 128.44, compared to an industry average at 7.69. Tracking last five years, its sales surge 6.60% a year on average and the company’s net income advanced by an average rate of 7.40%.\n\nPrice-To-Book Ratio or P/B is calculated by dividing the current closing price of the stock by the latest quarter’s book value per share. A lower P/B ratio could mean that the stock is undervalued.\n\nAmerican Express Company (NYSE:AXP)\n\nThe forward price-to-earnings ratio is a powerful. For investors, it allows a quick snapshot of the company’s finances without getting bogged down in the details of an accounting report.American Express Company (NYSE:AXP) recently closed at market price of $77.53 with a 1 year price target of $81.44. The company has a market cap of $70.96B. The P/E ratio is 13.76. The stock is down -1.67% and trades at 12.38 times forward earnings estimates.\n\nPrice-To-Book Ratio or P/B provides a valuable reality check for investors seeking growth at a reasonable price. A P/B ratio of less than 1.0 can indicate that a stock is undervalued, while a ratio of greater than 1.0 may indicate that a stock is overvalued.\n\nAmerican Express Company (AXP) maintains price-to-book ratio at 3.48 vs. an industry average at 2.87. In the last five years, the company’s full-year sales raise remained over 0.30% a year on average and the company’s earnings per share moved up by an average rate of 6.70%.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.brproud.com/news/local-news/former-financial-manager-pleads-guilty-to-embezzling-more-than-14-million-from-employer/678329334&cid=52779434974548&ei=bB7WWKH4DIKKuwT1lITICw&usg=AFQjCNEiKYtDJfwxAfii4cj6CP3m3u5JLA\">www.brproud.com</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nFormer financial manager pleads guilty to embezzling more than $1.4 million ...\n", "text": "<p>Copyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nBATON ROUGE, La (LOCAL 33) - A former financial manager has pleaded guilty to embezzling $1,406,080 from Axiall Corporation.\n\nAccording to U.S. Attorney Corey Amundson, 54-year-old Wade Barbay is accused of engaging in a wire fraud scheme used to embezzle money.\n\nDuring Wednesday's hearing, Barbay admitted to using his position as director of shared services, which oversaw Axiall’s corporate credit card program, to embezzle more than $1.4 million from the organization from January 2011 through May 2016.\n\nBarbay allegedly submitted fraudulent-inflated business expenses of other employees for payment to Axiall’s headquarters, causing the company to pay the inflated amounts to American Express. The defendant then directed American Express to credit his account with the fraudulently-inflated funds.\n\nThrough this scheme, the defendant embezzled over $1,125,000. In addition, the defendant’s scheme included negotiating and depositing corporate refund checks into his personal bank account, totaling approximately $280,430. I\n\nOver the course of a five-and-a-half-year period, the defendant fraudulently obtained more than $1.4 million from his former employer.</p>"}}]}