{"events": [{"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/news/earnings/17/03/9202102/mid-morning-market-update-markets-mostly-lower-nike-sales-miss-views&cid=52779434063818&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNEddj1-5q0rcBDcvQUvXvG3ZfI5JQ\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nMid-Morning Market Update: Markets Mostly Lower; Nike Sales Miss Views\n", "text": "<p>Following the market opening Wednesday, the Dow traded down 0.29 percent to 20,607.98 while the NASDAQ rose 0.05 percent to 5,796.52. The S&P also fell, dropping 0.16 percent to 2,340.38.\n\nLeading and Lagging Sectors\n\nWednesday morning, the utilities sector proved to be a source of strength for the market. Leading the sector was strength from Korea Electric Power Corporation (ADR) (NYSE: KEP) and RGC Resources Inc. (NASDAQ: RGCO).\n\nIn trading on Wednesday, financial shares fell 0.54 percent. Meanwhile, top losers in the sector included CBL & Associates Properties, Inc. (NYSE: CBL), down 4 percent, and ING Groep NV (ADR) (NYSE: ING), down 4 percent.\n\nTop Headline\n\nNike Inc (NYSE: NKE) reported upbeat earnings for its third quarter, while sales missed estimates.\n\nNike posted Q3 earnings of $0.68 per share on revenue of $8.4 billion. Analysts expected earnings of $0.53 per share on revenue of $8.47 billion. On a currency-neutral basis, Nike’s futures orders dropped 1 percent, while futures orders on a reported basis dropped around 4 percent.\n\nEquities Trading UP\n\nDuluth Holdings Inc (NASDAQ: DLTH) shares shot up 15 percent to $22.24 after the company reported upbeat Q4 results.\n\nShares of Moleculin Biotech Inc (NASDAQ: MBRX) got a boost, shooting up 27 percent to $1.36 after the company reported that its AML treatment Liposomal Annamycin has been awarded the FDA Orphan Drug designation.\n\nbebe stores, inc. (NASDAQ: BEBE) shares were also up, gaining 16 percent to $4.14 after dropping 44.65 percent on Tuesday.\n\nEquities Trading DOWN\n\nDiana Containerships Inc (NASDAQ: DCIX) shares dropped 26 percent to $1.69. Diana Containerships reported up to $150 million securities offering.\n\nShares of Sears Holdings Corp (NASDAQ: SHLD) were down around 12 percent to $8.02. Sears warned on Tuesday about its ability to continue as a going concern after years of losses and declining sales.\n\nVital Therapies Inc (NASDAQ: VTL) was down, falling around 8 percent to $3.90. Vital Therapies priced an offering of 8.75 million shares at $4 per share.\n\nCommodities\n\nIn commodity news, oil traded down 1.45 percent to $47.54 while gold traded up 0.06 percent to $1,250.30.\n\nSilver traded down 0.27 percent Wednesday to $17.535, while copper fell 0.63 percent to $2.602.\n\nEurozone\n\nEuropean shares were mostly lower today. The eurozone’s STOXX 600 fell 0.63 percent, the Spanish Ibex Index rose 0.04 percent, while Italy’s FTSE MIB Index slipped 0.15 percent. Meanwhile the German DAX declined 0.49 percent, and the French CAC 40 fell 0.42 percent while U.K. shares fell 0.88 percent.\n\nEconomics\n\nExisting-home sales declined 3.7 percent to an annual rate of 5.48 million in February, the National Association of Realtors reported. However, economists were expecting a 5.57 million rate.\n\nThe Energy Information Administration’s weekly report on petroleum inventories is schedule for release at 10:30 a.m. ET.\n\nPosted-In: Earnings News Eurozone Commodities Global Intraday Update Markets Movers\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.sfgate.com/business/article/Sears-Nike-and-US-Bancorp-stumble-while-FedEx-11020655.php&cid=52779433723471&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNEW_q63Sv1Jldho3522YU8PSDc-vQ\">SFGate</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nSears, Nike and US Bancorp stumble while FedEx, Duluth rise\n", "text": "<p>Sears, Nike and US Bancorp stumble while FedEx, Duluth rise\n\nNEW YORK (AP) — Stocks that moved substantially or traded heavily on Wednesday:\n\nSears Holdings Corp., down $1.12 to $7.98\n\nThe retailer said in a regulatory filing that there is \"substantial doubt\" it will be able to remain in business.\n\nNike Inc., down $4.09 to $53.92\n\nThe shoe and athletic apparel retailer reported weaker sales than expected and investors weren't pleased with its outlook.\n\nU.S. Bancorp, down 9 cents to $52.60\n\nBanks fell for the fourth trading day in a row as interest rates decreased again.\n\nFedEx Corp., up $4.08 to $195.92\n\nThe shipping company's holiday-season results were mixed, but analysts expect its business to improve.\n\nDuluth Holdings Inc., up $2.76 to $22.02\n\nThe clothing and tools supplier had a strong fourth quarter and its annual forecast was better than analysts expected.\n\nPPG Industries Inc., down 23 cents to $104.25\n\nPPG offered to buy industrial paints and chemicals company AkzoNobel for about $24 billion, which AkzoNobel rejected.\n\nPublic Service Enterprise Group Inc., up 44 cents to $45.10\n\nUtility companies continued to do better than the rest of the market as investors snap up high-dividend stocks as bond yields fall.\n\nMallinckrodt PLC, down $1.51 to $42.54\n\nImprimis Pharmaceuticals said it is studying a drug that would compete with Mallinckrodt's costly drug HP Acthar gel.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://stockmarketdaily.co/2017/03/22/stocks-to-watch-nike-inc-nysenke-fedex-corporation-nysefdx-regenxbio-inc-nasdaqrgnx-autozone-inc-nyseazo-and-achillion-pharmaceuticals-inc-nasdaqachn/&cid=52779432233981&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNFXfQ-C1DqyKIbiavgD1dYjjxnx7g\">Stock Market Daily</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nStocks To Watch: Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio ...\n", "text": "<p>Stocks To Watch: Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio Inc (NASDAQ:RGNX), AutoZone, Inc. (NYSE:AZO), And Achillion Pharmaceuticals, Inc. (NASDAQ:ACHN)\n\nAt least six companies’ shares are worth watching on Wednesday. They included Nike Inc (NYSE:NKE), FedEx Corporation (NYSE:FDX), Regenxbio Inc (NASDAQ:RGNX), AutoZone, Inc. (NYSE:AZO), and Achillion Pharmaceuticals, Inc. (NASDAQ:ACHN).</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://wolcottdaily.com/nike-nke-reaches-54-01-after-3-00-gap-down-modine-manufacturing-company-mod-si-decreased-by-13-31/&cid=52779433413169&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNF9UNlALl7eKa2RNa2RiBmxY82-vQ\">Wolcott Daily</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nNike (NKE) Reaches $54.01 After 3.00% Gap Down; Modine Manufacturing Company ...\n", "text": "<p>The stock of Nike Inc (NYSE:NKE) gapped down by $2.72 today and has $52.39 target or 3.00% below today’s $54.01 share price. The 7 months technical chart setup indicates high risk for the $88.34 billion company. The gap down was reported on Mar, 22 by Barchart.com. If the $52.39 price target is reached, the company will be worth $2.65B less. About 31.74M shares traded or 237.30% up from the average. Nike Inc (NYSE:NKE) has risen 2.18% since August 15, 2016 and is uptrending. It has underperformed by 4.84% the S&P500.\n\nModine Manufacturing Company (NYSE:MOD) had a decrease of 13.31% in short interest. MOD’s SI was 566,100 shares in March as released by FINRA. Its down 13.31% from 653,000 shares previously. With 309,700 avg volume, 2 days are for Modine Manufacturing Company (NYSE:MOD)’s short sellers to cover MOD’s short positions. The SI to Modine Manufacturing Company’s float is 1.2%. About 202,347 shares traded. Modine Manufacturing Co. (NYSE:MOD) has risen 7.04% since August 15, 2016 and is uptrending. It has outperformed by 0.01% the S&P500.\n\nNIKE, Inc. is engaged in the design, development, marketing and selling of athletic footwear, apparel, equipment, accessories and services. The company has market cap of $88.34 billion. The Company’s operating divisions include North America, Western Europe, Central & Eastern Europe, Greater China, Japan and Emerging Markets. It has a 22.55 P/E ratio. The Company’s portfolio brands include the NIKE Brand, Jordan Brand, Hurley and Converse.\n\nInvestors sentiment increased to 0.98 in 2016 Q4. Its up 0.04, from 0.94 in 2016Q3. It is positive, as 84 investors sold Nike Inc shares while 443 reduced holdings. 112 funds opened positions while 405 raised stakes. 993.29 million shares or 0.55% less from 998.81 million shares in 2016Q3 were reported. Boston Family Office Ltd Co holds 1.1% of its portfolio in Nike Inc (NYSE:NKE) for 166,154 shares. Greenwood Capital Assoc Ltd Co has invested 0.78% in Nike Inc (NYSE:NKE). Peak Asset Lc owns 7,137 shares for 0.15% of their portfolio. Mackenzie Financial Corporation holds 6.04 million shares or 1.84% of its portfolio. Charter Company reported 75,392 shares. North Star Asset Management has invested 0.29% in Nike Inc (NYSE:NKE). Bkd Wealth Advsrs Ltd Llc holds 4,358 shares. Camarda Fincl Lc holds 64 shares or 0% of its portfolio. Shamrock Asset Management Limited Liability Co owns 200 shares. Blue Ridge Ltd Liability Co accumulated 4.99 million shares. Exane Derivatives holds 0% or 41,548 shares in its portfolio. Ridgeworth Cap Llc holds 0.11% of its portfolio in Nike Inc (NYSE:NKE) for 248,349 shares. Lenox Wealth Mgmt accumulated 2,460 shares or 0.1% of the stock. 715 are held by Edge Wealth Mgmt Limited Liability Corporation. Blackrock Japan Ltd, a Japan-based fund reported 1.77 million shares.\n\nSince September 30, 2016, it had 1 buy, and 5 sales for $40.89 million activity. Slusher John F also sold $7.09M worth of Nike Inc (NYSE:NKE) shares. $10.48M worth of Nike Inc (NYSE:NKE) was sold by Ayre David J. Another trade for 150,000 shares valued at $7.47 million was made by PARKER MARK G on Tuesday, November 1. $52,717 worth of Nike Inc (NYSE:NKE) was bought by LECHLEITER JOHN C on Friday, September 30.\n\nAmong 37 analysts covering Nike Inc. (NYSE:NKE), 23 have Buy rating, 2 Sell and 12 Hold. Therefore 62% are positive. Nike Inc. had 113 analyst reports since July 29, 2015 according to SRatingsIntel. On Friday, September 25 the stock rating was maintained by B. Riley & Co with “Buy”. The rating was initiated by Oppenheimer on Tuesday, October 25 with “Perform”. The stock of Nike Inc (NYSE:NKE) earned “Neutral” rating by Wedbush on Wednesday, November 2. The stock has “Outperform” rating by Robert W. Baird on Wednesday, September 28. Canaccord Genuity maintained the stock with “Hold” rating in Friday, September 23 report. The rating was maintained by Credit Suisse with “Outperform” on Friday, September 25. As per Wednesday, December 2, the company rating was downgraded by Goldman Sachs. Barclays Capital maintained the shares of NKE in report on Wednesday, March 23 with “Overweight” rating. The rating was maintained by DA Davidson on Wednesday, December 23 with “Buy”. The rating was upgraded by BB&T Capital on Monday, October 19 to “Buy”.\n\nAmong 3 analysts covering Modine Manufacturing (NYSE:MOD), 3 have Buy rating, 0 Sell and 0 Hold. Therefore 100% are positive. Modine Manufacturing had 4 analyst reports since August 4, 2015 according to SRatingsIntel. The stock has “Hold” rating by Zacks on Tuesday, August 4. The firm has “Buy” rating given on Tuesday, January 31 by Gabelli. As per Thursday, March 24, the company rating was upgraded by Seaport Global.\n\nSince November 14, 2016, it had 0 buys, and 3 insider sales for $432,599 activity. 7,500 Modine Manufacturing Co. (NYSE:MOD) shares with value of $119,625 were sold by Bowser Scott L. $303,199 worth of stock was sold by Marry Thomas F on Tuesday, December 13. Patterson Christopher William sold $9,775 worth of Modine Manufacturing Co. (NYSE:MOD) on Monday, November 14.\n\nInvestors sentiment increased to 1 in Q4 2016. Its up 0.05, from 0.95 in 2016Q3. It improved, as 10 investors sold Modine Manufacturing Co. shares while 45 reduced holdings. 16 funds opened positions while 39 raised stakes. 40.26 million shares or 1.58% more from 39.64 million shares in 2016Q3 were reported. Gsa Cap Prtnrs Llp invested in 0.19% or 211,042 shares. Allianz Asset Ag accumulated 0% or 274,148 shares. Driehaus Management Limited Liability Com owns 162,910 shares. Glenmede Company Na owns 0% invested in Modine Manufacturing Co. (NYSE:MOD) for 10,448 shares. Cornerstone Capital Mgmt Holdg Lc accumulated 34,078 shares or 0% of the stock. Metropolitan Life New York reported 33,974 shares. Schwab Charles Investment Management Inc accumulated 0% or 209,483 shares. Qs Invsts Limited Liability Corp reported 0.02% of its portfolio in Modine Manufacturing Co. (NYSE:MOD). Wells Fargo Co Mn has 33,268 shares. Millennium Mngmt Ltd has 0% invested in Modine Manufacturing Co. (NYSE:MOD). Ajo L P owns 30,088 shares. Public Employees Retirement Association Of Colorado holds 0% in Modine Manufacturing Co. (NYSE:MOD) or 19,998 shares. Credit Suisse Ag owns 67,492 shares. Savings Bank Of Ny Mellon Corp has 0% invested in Modine Manufacturing Co. (NYSE:MOD). Jpmorgan Chase & holds 0% or 25,049 shares in its portfolio.\n\nModine Manufacturing Company provides engineered heat transfer systems and heat transfer components for use in on-highway and off-highway original equipment maker vehicular applications, and for sale into an array of building, industrial and refrigeration markets. The company has market cap of $541.23 million. The Company’s products include radiators and radiator cores, exhaust gas recirculation coolers, building heating, ventilating and air conditioning (HVAC) equipment, and coils. It has a 37.83 P/E ratio. The Company’s divisions include Americas, Europe, Asia and Building HVAC.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/general/education/17/03/9202032/premarket-prep-recap-march-22-the-vice-index&cid=52779433415513&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNGc_icim-hX_kP5Gw36sOL3eLH1mw\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nPreMarket Prep Recap, March 22: The Vice Index\n", "text": "<p>Did you miss today's PreMarket Prep? Here are some of the highlights from the show.\n\nKey Technical Levels\n\nThe following are some of the stocks discussed on the show. Co-host Joel Elconin offered technical levels.\n\nNike Inc (NYSE: NKE) hit a pre-market low of $54.32, Whole numbers come into play after that, but traders should keep in mind the double bottom from February 7-8 of $52.67 and $52.70.\n\n(NYSE: NKE) hit a pre-market low of $54.32, Whole numbers come into play after that, but traders should keep in mind the double bottom from February 7-8 of $52.67 and $52.70. Foot Locker, Inc. (NYSE: FL)'s Tuesday low of $72.40 is key. After that,there's potential air until the February 24 low of $70.37. It needs to clear the close of $73.45 to have any chance of a rally\n\n(NYSE: FL)'s Tuesday low of $72.40 is key. After that,there's potential air until the February 24 low of $70.37. It needs to clear the close of $73.45 to have any chance of a rally FedEx Corporation (NYSE: FDX) hit a pre-market high of $198.55 and backed off but not by much. The only relevant levels on the upside are the all-time high of $201.57 from December 13.\n\n(NYSE: FDX) hit a pre-market high of $198.55 and backed off but not by much. The only relevant levels on the upside are the all-time high of $201.57 from December 13. Silver Wheaton Corp. (USA) (NYSE: SLW) moved higher on light volume off its earnings report. Note the three-day high of $20.63; after that it opens up to the February 27 high of $21.32. There's support at the close of $19.93.\n\n(NYSE: SLW) moved higher on light volume off its earnings report. Note the three-day high of $20.63; after that it opens up to the February 27 high of $21.32. There's support at the close of $19.93. Winnebago Industries, Inc. (NYSE: WGO) The Street leaned the wrong way heading into this report. It needs to clear a double top from March 17 ($29.95) and March 20 ($30.02). It needs to hold $29.55 (Tuesday high) for rally to continue.\n\nIndustries That Got Crushed Tuesday\n\nCo-host Dennis Dick noted that, even though the financials have looked weak for a while, regional bank stocks like KeyCorp (NYSE: KEY) and Regions Financial Corp (NYSE: RF) took a particular hit on Wednesday. Listen to the full discussion here.\n\n(NYSE: KEY) and (NYSE: RF) took a particular hit on Wednesday. Listen to the full discussion here. Dick also pointed out the continued slide in retail. L Brands Inc (NYSE: LB) was downgraded at Keybanc. \"If you're thinking retail had already been beat up...they hit the retailers really hard again.\" He specifically noted Macy's Inc (NYSE: M), Kohls Corporation (NYSE: KSS) and Nordstrom, Inc. (NYSE: JWN) all had big down days on Tuesday. Listen to the full discussion here.\n\nMoneyball Economics\n\nAndrew Zatlin of Moneyball Econonmics stopped by the show to discuss his Vice Index, what it's telling him about overall consumer sentiment, and how it helps him forecast the market. Listen to the full interview with Zatlin here.\n\nHow To Listen And Watch\n\nPreMarket Prep is a daily trading ideas show with a focus on premarket volatility and technical setups. You can listen live and chat with our hosts, guests, and listeners every morning from 8-9 ET here or on YouTube Live. You can listen to the podcast on iTunes, Soundcloud, and Stitcher. The full recording of today's show is available below.\n\nPosted-In: Andrew Zatlin PreMarket PrepEducation Markets Trading Ideas Reviews Interview General\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.hotstockspoint.com/analysts-mean-rating-score-stands-at-2-10-while-nike-inc-s-nke-stock-price-is-now-at-58-01-notable-runners/&cid=52779429734208&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNHuRsNHhaLEc7Vy1CUM-WelXGHNoQ\">Hot Stocks Point</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nAnalysts mean rating score stands at 2.10 while NIKE, Inc.'s (NKE) stock price ...\n", "text": "<p>NIKE, Inc. (NKE)’s Stock Price Trading Update:\n\nNIKE, Inc. (NKE) stock price ended its day with loss -1.14% and finalized at the value of $58.01. During its last trading session, Stock traded with the total exchanged volume of 14.51 million shares. The average volume stands around 9.1 million shares. The average numbers of shares are traded in a security per day, during the recent 3-month period. The stock has relative volume of 1.59. Relative volume is ratio between current volume and 3-month average value, intraday adjusted. NIKE, Inc. (NKE) is a part of Consumer Goods sector and belongs to Textile – Apparel Footwear & Accessories industry.\n\nImportant Technical Indicators:\n\nATR value of company was 0.93. Average True Range (ATR) is an indicator based on trading ranges smoothed by an N-period exponential moving average percentage of the true range values. ATR can display volatility of stocks, ETFs and indexes. The principal of ATR is very similar to other volatility indicators: A high ATR value signals a possible trend change. A low ATR value correlates with a weaker trend movement.\n\nRelative Strength Index (RSI) was 62.27. Developed J. Welles Wilder, the Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements. RSI oscillates between zero and 100. Traditionally, and according to Wilder, RSI is considered overbought when above 70 and oversold when below 30.\n\nThe stock volatility for week was 1.69% while for month was 1.56%.The stock, as of last close, traded 19.16% to its 52 week low and was changed -10.25% from its 52 week high. Beta factor, which measures the riskiness of the security, was observed as 0.47. NKE’s value Change from Open was at -1.31% with a Gap of 0.17%.\n\nEarnings per share Details about NKE:\n\nEPS in next five year years is expected to touch 12.18% while EPS growth in past 5 year was 14.10% along with sales growth of 10.00% in the last five years.\n\nEPS growth in next year is estimated to reach 12.75% while EPS growth estimate for this year is set at 16.60%.\n\nThe price/earnings ratio (P/E) is 25.60 and the forward P/E ratio stands at 22.02. The price to earnings growth is 2.10 and the price to sales ratio is 17. It has a dividend yield of 1.24%.\n\nPerformance Review:\n\nTo review the NKE previous performance, look at its past history, which highlighted below:\n\nDuring last 5 trades the stock sticks almost 1.27%.\n\nDuring last one month it showed the change of 2.54%.\n\nDuring last 3 month it remained at 14.28%.\n\nDuring last one year month it performed at -9.25%.\n\nAlong with these its year to date performance is standing at 14.48%.\n\nAnalysts Mean Rating:\n\nAnalysts’ mean recommendation for NIKE, Inc. (NKE) stands at 2.10. Rating Scale; where 1.0 rating means Strong Buy, 2.0 rating signify Buy, 3.0 recommendation reveals Hold, 4.0 rating score shows Sell and 5.0 displays Strong Sell signal.\n\nNKE Stock Price Comparison to Moving Averages:\n\nUSA based company, NIKE, Inc. (NKE)’s latest closing price was 7.61% from the average-price of 200 days while it maintained a distance from the 50 Day Moving Average at 5.23% and 1.31% compared with the 20 Day Moving Average.\n\nThree Months Ago Analysts Rating:\n\nHere we discussed Analysts views what they told about Nike, Inc. (NKE) stock 3 Months Ago. Analysts recommended an average brokerage rating of Overweight derived from brokerage firms, according to FactSet. 18 said a “Buy Rating” and 3 announced “Overweight Rating”. 12 advised “Hold Rating” regarding the stock. 0 announced “Sell Rating” and 1 disclosed “Underweight Rating”. Analysts play a useful role in our capital markets. For example, by doing in-depth research for their large institutional clients and employers, analysts can help substantial sums of capital be directed to more productive uses in our economy. A “Buy” rating does not mean that every investor should acquire the stock. Nor does a “Sell” rating mean that every investor should immediately sell it. Your own financial situation and investment needs are what matter. If you consider any individual rating, do not views it in absolute or abstract terms, but in the context of your own unique financial situation. In short, whatever a given analyst recommendation may say, always consider whether a particular investment is right for you in light of your own financial circumstances. Remember, you are the boss, it’s your money, and your situation and goals that matter.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://heraldks.com/citigroup-starts-parsley-energy-pe-coverage-with-40-0-target-ems-capital-lp-increased-nike-nke-holding/&cid=52779433300919&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNFgHkJa_iH7S06y5NcgTXrf7cB7sw\">Herald KS</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nCitigroup Starts Parsley Energy (PE) Coverage with $40.0 Target; Ems Capital ...\n", "text": "<p>Ems Capital Lp increased Nike Inc (NKE) stake by 20% reported in 2016Q4 SEC filing. Ems Capital Lp acquired 180,000 shares as Nike Inc (NKE)’s stock declined 3.49%. The Ems Capital Lp holds 1.08M shares with $54.90M value, up from 900,000 last quarter. Nike Inc now has $88.95 billion valuation. The stock declined 6.25% or $3.62 reaching $54.38 on the news. About 12.05 million shares traded or 28.06% up from the average. Nike Inc (NYSE:NKE) has risen 2.18% since August 15, 2016 and is uptrending. It has underperformed by 4.84% the S&P500.\n\nAmong 5 analysts covering Parsley Energy (PE), 3 have Buy rating, 0 Sell and 2 Hold. Therefore 60% are positive. Parsley Energy has $45.0 highest and $37.0 lowest target. $41’s average target is 33.12% above currents $30.8 stock price. Parsley Energy had 5 analyst reports since August 29, 2016 according to SRatingsIntel. The stock has “Outperform” rating by FBR Capital on Tuesday, September 13. The company was downgraded on Wednesday, October 12 by Macquarie Research. On Monday, August 29 the stock rating was initiated by Williams Capital Group with “Hold”. Barclays Capital maintained Parsley Energy Inc (NYSE:PE) rating on Friday, February 10. Barclays Capital has “Overweight” rating and $41.0 target. The stock has “Outperform” rating by RBC Capital Markets on Tuesday, January 17.\n\nSince September 30, 2016, it had 1 insider purchase, and 5 selling transactions for $40.89 million activity. 1,000 shares were bought by LECHLEITER JOHN C, worth $52,717. On Monday, January 30 the insider Ayre David J sold $10.62 million. $5.29M worth of Nike Inc (NYSE:NKE) was sold by PARKER MARK G. On Tuesday, January 3 Slusher John F sold $7.09M worth of Nike Inc (NYSE:NKE) or 136,000 shares.\n\nAmong 37 analysts covering Nike Inc. (NYSE:NKE), 23 have Buy rating, 2 Sell and 12 Hold. Therefore 62% are positive. Nike Inc. had 113 analyst reports since July 29, 2015 according to SRatingsIntel. The firm earned “Buy” rating on Wednesday, September 28 by Nomura. The rating was maintained by Canaccord Genuity with “Hold” on Friday, September 25. Piper Jaffray maintained Nike Inc (NYSE:NKE) rating on Wednesday, June 29. Piper Jaffray has “Overweight” rating and $58 target. As per Tuesday, September 22, the company rating was maintained by Telsey Advisory Group. JP Morgan maintained the stock with “Overweight” rating in Wednesday, September 28 report. The company was maintained on Wednesday, September 28 by Canaccord Genuity. The stock of Nike Inc (NYSE:NKE) has “Buy” rating given on Friday, October 16 by B. Riley & Co. Barclays Capital maintained the stock with “Overweight” rating in Wednesday, March 23 report. As per Tuesday, September 29, the company rating was maintained by Argus Research. UBS maintained Nike Inc (NYSE:NKE) on Monday, December 12 with “Buy” rating.\n\nInvestors sentiment increased to 0.98 in 2016 Q4. Its up 0.04, from 0.94 in 2016Q3. It improved, as 84 investors sold NKE shares while 443 reduced holdings. 112 funds opened positions while 405 raised stakes. 993.29 million shares or 0.55% less from 998.81 million shares in 2016Q3 were reported. Mai Cap Management has invested 0.35% in Nike Inc (NYSE:NKE). Legal And General Group Public Ltd Company, United Kingdom-based fund reported 5.23 million shares. Kistler owns 2,096 shares. Pekin Singer Strauss Asset Mngmt Il accumulated 0.03% or 5,915 shares. Citizens Northern Corp stated it has 41,154 shares. Natl Planning invested in 10,253 shares. Essex Inc owns 16,856 shares or 0.18% of their US portfolio. Paragon Capital Ltd Co accumulated 203,695 shares or 3.43% of the stock. 1832 Asset Ltd Partnership, a Ontario – Canada-based fund reported 2.68 million shares. Montag Caldwell Limited Company accumulated 17,000 shares or 0.02% of the stock. Paloma Partners Mgmt owns 72,796 shares for 0.04% of their portfolio. First Midwest Natl Bank Division reported 54,437 shares. Blackrock Invest Management Ltd owns 5.77M shares. Grantham Mayo Van Otterloo & Ltd Limited Liability Company, Massachusetts-based fund reported 1.94M shares. 24,135 are held by Cambridge Communication.\n\nParsley Energy, Inc. is a holding company. The company has market cap of $8.22 billion. The Firm is an independent oil and natural gas company. It currently has negative earnings. The Firm focuses on the acquisition, development and exploitation of unconventional oil and natural gas reserves in the Permian Basin.\n\nAnalysts await Parsley Energy Inc (NYSE:PE) to report earnings on May, 3. They expect $0.10 earnings per share, up 600.00% or $0.12 from last year’s $-0.02 per share. PE’s profit will be $26.69M for 77.00 P/E if the $0.10 EPS becomes a reality. After $0.06 actual earnings per share reported by Parsley Energy Inc for the previous quarter, Wall Street now forecasts 66.67% EPS growth.\n\nSince October 5, 2016, it had 4 insider buys, and 8 insider sales for $14.74 million activity. Shares for $851,250 were sold by Hinson Mike. Roberts Colin also sold $174,600 worth of Parsley Energy Inc (NYSE:PE) shares. 20,000 Parsley Energy Inc (NYSE:PE) shares with value of $699,533 were sold by Dalton Ryan. Shares for $996,135 were bought by Gallagher Matthew on Tuesday, February 28. 3,000 Parsley Energy Inc (NYSE:PE) shares with value of $91,050 were bought by Windlinger Jerry. ALAMEDDINE A R bought $108,290 worth of Parsley Energy Inc (NYSE:PE) on Wednesday, March 1. Sheffield Bryan sold 312,500 shares worth $10.90M.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://seekingalpha.com/article/4057461-nike-key-levels-watch\">seekingalpha</a>"}, "start_date": {"hour": 21, "month": 3, "second": 51, "year": 2017, "day": 23, "minute": 14}, "end_date": {}, "text": {"headline": "Nike - Key Levels To Watch", "text": "<p>Nike Inc. (NYSE: NKE) was hammered in yesterday’s session following a weaker-than-expected forecast of worldwide future orders. As bears pounced on the opportunity to pressurize the stock, the important support of the 200-day SMA was violated and the stock ended near the day’s lows on strong volume. In this technical analysis article, I will discuss if the stock has re-entered the downtrend breached about a month ago and provide some key technical levels to watch out for. \n\n After the earnings announcement, very few expected the stock to be punished as badly as it did. During the day, the stock tried sustaining above the 200-day SMA at $54.26 but succumbed to the increasing selling pressure. The daily Nike price chart shows that the stock opened sharply lower than the previous close and maintained its bearish bias. The magnitude of pessimism was so high that the bulls never stood a chance to head above the 30-day and the 50-day SMAs of $56.87 and $55.35 respectively. Closing near the day’s lows, Nike has been pushed back below the downward sloping resistance that had kept the stock from taking off for over a year. \n\n Source: TradingView But, is there more pain in store for Nike? Yes, the stock can easily fall another couple percentage points to test the near-term support at $53. As the above chart shows, Nike began its upward journey following this support trendline. Buyers had repeatedly utilized any dips to this technical level to create long positions in Nike. So, it goes without saying that bulls must protect this cushion or risk revisiting $50.\n An interesting question that now appears in front of every investor is: Did the market expect Nike to disappoint? The weekly Nike price chart below shows that the stock stalled its upmove and never really took out its previous top even when the momentum was strongly in favor of the buyers. It is telling that the market slipped into a wait-and-watch mode before the earnings which is generally an indication of the underlying nervousness. Having said this, if the stock would have exceeded market expectations, there could have been a huge relief rally as well. \n\n Source: TradingView This huge relief rally could have come on account of the short-sellers who have pushed the short positions to a new 5-year high of 32.76 million. This is equivalent to 2.5 percent of the total outstanding float. \n\n Conclusion If bulls can recoup some of the losses and close the stock above $55 this week, then the stock can be protected from sideways action or from drifting down to $50. The case for $50 will be emboldened if the $53 support is taken out. I am of the opinion that the extreme selling pressure witnessed yesterday was a strong signal of the market’s disappointment with the stock. This is likely to keep the stock suppressed for some time. Note: I cover several stocks in different sectors as well as S&P 500, crude oil, gold and silver, U.S. dollar, etc. So, if you liked this update, and would like to read more of such informative articles, please consider hitting the \"Follow\" button above. Thank you for reading!\n\nDisclosure: I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours. \nI wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.newsoracle.com/2017/03/22/investors-catching-stocks-nike-inc-nke/&cid=52779432692552&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNFVVgZ_xTzvi_YVPqg3TVqN9-AHkg\">News Oracle</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\nInvestors Catching Stocks NIKE, Inc. (NKE)\n", "text": "<p>NIKE, Inc. (NKE) will report its next earnings on 21-Mar-17. The company reported the earnings of $0.5/Share in the last quarter where the estimated EPS by analysts was $0.43/share. The difference between the expected and actual EPS was $0.07/share, which represents an Earnings surprise of 16.3%.\n\nMany analysts are providing their Estimated Earnings analysis for NIKE, Inc. and for the current quarter 32 analysts have projected that the stock could give an Average Earnings estimate of $0.53/share. These analysts have also projected a Low Estimate of $0.48/share and a High Estimate of $0.58/share.\n\nIn case of Revenue Estimates, 29 analysts have provided their consensus Average Revenue Estimates for NIKE, Inc. as 8.47 Billion. According to these analysts, the Low Revenue Estimate for NIKE, Inc. is 8.32 Billion and the High Revenue Estimate is 8.61 Billion. The company had Year Ago Sales of 8.03 Billion.\n\nThese analysts also forecasted Growth Estimates for the Current Quarter for NKE to be -3.6%. They are projecting Next Quarter growth of 18.4%. For the next 5 years, NIKE, Inc. is expecting Growth of 12.18% per annum, whereas in the past 5 years the growth was 17.38% per annum.\n\nSome buy side analysts are also providing their Analysis on NIKE, Inc., where 8 analysts have rated the stock as Strong buy, 14 analysts have given a Buy signal, 11 said it’s a HOLD, 1 reported it as Underperform and 0 analysts rated the stock as Sell. (These Recommendations are for the Current Month Only reported by Yahoo Finance.)\n\nWhen it comes to the Analysis of a Stock, Price Target plays a vital role. 30 Analysts reported that the Price Target for NIKE, Inc. might touch $100 high while the Average Price Target and Low price Target is $62.47 and $46 respectively.\n\nTo analyze a stock, one should look for Upgrades and Downgrades of a stock. NIKE, Inc. got Initiated on 19-Jan-17 where investment firm Atlantic Equities Initiated the stock to Overweight.\n\nNIKE, Inc. closed its last trading session at $58.68 with the loss of -1.14%. The Market Capitalization of the company stands at 95.98 Billion. The Company has 52-week high of $65.44 and 52-week low of $49.01. The stock’s current distance from 20-Day Simple Moving Average (SMA20) is 1.31% where SMA50 and SMA200 are 5.23% and 7.61% respectively. The Company Touched its 52-Week High on Mar 22, 2016 and 52-Week Low on Nov 2, 2016.\n\nThe Relative Volume of the company is 1.59 and Average Volume (3 months) is 9.1 million. NIKE, Inc. P/E (price to earnings) ratio is 25.6 and Forward P/E ratio of 22.02.\n\nThe company shows its Return on Assets (ROA) value of 18%. The Return on Equity (ROE) value stands at 31.7%. While it’s Return on Investment (ROI) value is 25.5%.\n\nWhile looking at the Stock’s Performance, NIKE, Inc. currently shows a Weekly Performance of 1.27%, where Monthly Performance is 2.54%, Quarterly performance is 14.28%, 6 Months performance is 6.28% and yearly performance percentage is -9.25%. Year to Date performance value (YTD perf) value is 14.48%. The Stock currently has a Weekly Volatility of 1.69% and Monthly Volatility of 1.56%.</p>"}}, {"media": {"url": "", "caption": "Score Analyse", "credit": "<a href = \"http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.benzinga.com/news/17/03/9201309/18-stocks-moving-in-wednesdays-pre-market-session&cid=52779432938613&ei=7vLVWJG5B4i7uQS76YOgDg&usg=AFQjCNGf7qFkMmG-anjF6dgdRTsR5FEcWA\">Benzinga</a>"}, "start_date": {"hour": 12, "month": 3, "second": 0, "year": 2017, "day": 22, "minute": 0}, "end_date": {}, "text": {"headline": "\n18 Stocks Moving In Wednesday's Pre-Market Session\n", "text": "<p>Gainers\n\nbebe stores, inc. (NASDAQ: BEBE) rose 33.1 percent to $4.75 in pre-market trading after dropping 44.65 percent on Tuesday.\n\n(NASDAQ: BEBE) rose 33.1 percent to $4.75 in pre-market trading after dropping 44.65 percent on Tuesday. Achillion Pharmaceuticals, Inc. (NASDAQ: ACHN) rose 18.5 percent to $4.55 in pre-market trading after the company disclosed that the USPTO has granted composition of matter patent to company for small molecule complement alternative pathway factor D inhibitors.\n\n(NASDAQ: ACHN) rose 18.5 percent to $4.55 in pre-market trading after the company disclosed that the USPTO has granted composition of matter patent to company for small molecule complement alternative pathway factor D inhibitors. Moleculin Biotech Inc (NASDAQ: MBRX) shares rose 14.1 percent to $1.22 in pre-market trading after the company reported that its AML treatment liposomal annamycin has been awarded the FDA Orphan Drug designation.\n\n(NASDAQ: MBRX) shares rose 14.1 percent to $1.22 in pre-market trading after the company reported that its AML treatment liposomal annamycin has been awarded the FDA Orphan Drug designation. Ballard Power Systems Inc. (USA) (NASDAQ: BLDP) shares rose 6.5 percent to $2.30 in pre-market trading after declining 4.00 percent on Tuesday.\n\n(NASDAQ: BLDP) shares rose 6.5 percent to $2.30 in pre-market trading after declining 4.00 percent on Tuesday. Winnebago Industries, Inc. (NYSE: WGO) rose 5.2 percent to $29.25 in pre-market trading after the company reported better-than-expected results for its second quarter.\n\n(NYSE: WGO) rose 5.2 percent to $29.25 in pre-market trading after the company reported better-than-expected results for its second quarter. Sunrun Inc (NASDAQ: RUN) rose 4.2 percent to $5.00 in pre-market trading. UBS upgraded Sunrun from Neutral to Buy.\n\n(NASDAQ: RUN) rose 4.2 percent to $5.00 in pre-market trading. UBS upgraded Sunrun from Neutral to Buy. Pulmatrix Inc (NASDAQ: PULM) shares rose 3.9 percent to $4.03 in pre-market trading after surging 39.57 percent on Tuesday.\n\n(NASDAQ: PULM) shares rose 3.9 percent to $4.03 in pre-market trading after surging 39.57 percent on Tuesday. Amaya Inc. (NASDAQ: AYA) rose 2.6 percent to $15.75 in pre-market trading after the company reported strong quarterly results.\n\n(NASDAQ: AYA) rose 2.6 percent to $15.75 in pre-market trading after the company reported strong quarterly results. Aurinia Pharmaceuticals Inc (NASDAQ: AUPH) rose 2.5 percent to $8.58 in pre-market trading after dropping 4.67 percent on Tuesday.\n\n(NASDAQ: AUPH) rose 2.5 percent to $8.58 in pre-market trading after dropping 4.67 percent on Tuesday. FedEx Corporation (NYSE: FDX) shares rose 2 percent to $195.50 in pre-market trading. FedEx reported weaker-than-expected earnings for its third quarter and reaffirmed its earnings outlook for FY17.\n\nFind out what's going on in today's market and bring any questions you have to Benzinga's PreMarket Prep.\n\nLosers\n\nSears Holdings Corp (NASDAQ: SHLD) shares fell 11.4 percent to $8.06 in pre-market trading. 10-K from Sears showed a comment 'Our historical operating results indicate substantial doubt exists related to the Company's ability to continue as a going concern.'\n\n(NASDAQ: SHLD) shares fell 11.4 percent to $8.06 in pre-market trading. 10-K from Sears showed a comment 'Our historical operating results indicate substantial doubt exists related to the Company's ability to continue as a going concern.' Frontier Communications Corp (NASDAQ: FTR) shares fell 8.1 percent to $2.17 in pre-market trading. Goldman Sachs downgraded Frontier Communications from Neutral to Sell.\n\n(NASDAQ: FTR) shares fell 8.1 percent to $2.17 in pre-market trading. Goldman Sachs downgraded Frontier Communications from Neutral to Sell. Regenxbio Inc (NASDAQ: RGNX) fell 7.5 percent to $20.45 in pre-market trading. REGENXBIO reported a $75 million offering of common stock.\n\n(NASDAQ: RGNX) fell 7.5 percent to $20.45 in pre-market trading. REGENXBIO reported a $75 million offering of common stock. Global Blood Therapeutics Inc (NASDAQ: GBT) shares fell 6.4 percent to $34.00 in the pre-market trading session after dropping 2.81 percent on Tuesday.\n\n(NASDAQ: GBT) shares fell 6.4 percent to $34.00 in the pre-market trading session after dropping 2.81 percent on Tuesday. Nike Inc (NYSE: NKE) fell around 5.3 percent to $54.95 in pre-market trading. Nike reported upbeat earnings for its third quarter, while sales missed estimates.\n\n(NYSE: NKE) fell around 5.3 percent to $54.95 in pre-market trading. Nike reported upbeat earnings for its third quarter, while sales missed estimates. ING Groep NV (ADR) (NYSE: ING) fell 4.9 percent to $14.71 in pre-market trading after gaining 0.98 percent on Tuesday.\n\n(NYSE: ING) fell 4.9 percent to $14.71 in pre-market trading after gaining 0.98 percent on Tuesday. Golden Ocean Group Ltd (NASDAQ: GOGL) fell 3.6 percent to $7.33 in pre-market trading after dropping 6.75 percent on Tuesday.\n\n(NASDAQ: GOGL) fell 3.6 percent to $7.33 in pre-market trading after dropping 6.75 percent on Tuesday. Utah Medical Products, Inc. (NASDAQ: UTMD) fell 3.3 percent to $59.05 in pre-market trading after slipping 0.81 percent on Tuesday.\n\nPosted-In: #PreMarket Gainers LosersNews Movers & Shakers Pre-Market Outlook Markets Movers\n\n© 2017 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</p>"}}]}